{"title":"The Adventures of Dudley the Dragon","uid":7576945,"size":11711166509,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0021ec3db8cb1bc3c04eae099ef28a075134b96e&amp;dn=The+Adventures+of+Dudley+the+Dragon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nero2359","files":64,"time":1346138464,"description":"This torrent is for those who want their kids to experience an awesome show!\nOr just for those who want to take a trip down memory lane (like me).\n\nI couldn't find any good torrents for this show, so I found it on my own, labeled and re-encoded and am bringing for your enjoyment.\nI managed to finish all the labeling and whatnot sooner than I expected so here I have every episode!\n\n(Except for an episode in season 1 labeled &quot;Dudley Meets Mr.Can&quot; I can't seem to find an english copy anywhere, sorry)\n\n\nQuality is very decent.\n\nInfo:\n\nThe Adventures of Dudley the Dragon is a children's television series which aired in Canada on YTV and the United States on public television stations. It was a live-action show incorporating actors, full body costume characters (notably the titular dragon) and puppets. The story follows Dudley, a dragon who's recently woken up from centuries of hibernation and his new ten-year-old friends Matt and Sally. The two kids would guide Dudley around the modern world and the trio would learn about environmentalism, friendship and pro-social values.\n\nBesides Matt and Sally, Dudley was later joined by other kids, Julia, Terry, Laura, and Mickey. Other recurring characters included a grouchy apple tree named Mr. Crabby Tree, a laid back frog named Sammy, a lovable caveman, and the Robins.\n\nSeasons: 5\nDimension: 640x480\nFormat: MOV\nVideo: H.264\nAudio: AAC\nSize: 11.71 GB \nAverage File Size: 180 MB\n\nIf you like the show, help me out and seed when you're finished!\t","torrent":{"xt":"urn:btih:0021ec3db8cb1bc3c04eae099ef28a075134b96e","amp;dn":"The+Adventures+of+Dudley+the+Dragon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0021ec3db8cb1bc3c04eae099ef28a075134b96e","infoHashBuffer":{"type":"Buffer","data":[0,33,236,61,184,203,27,195,192,78,174,9,158,242,138,7,81,52,185,110]},"announce":[],"urlList":[]}}