{"title":"MusicLab RealLPC Standalone DXi VSTi v1.0-ASSiGN + Crack","uid":7593264,"size":351225259,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:005b6c4b9560d61d2fea1cb64a2e891af2b03a2e&amp;dn=MusicLab+RealLPC+Standalone+DXi+VSTi+v1.0-ASSiGN+%2B+Crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"elsera","files":1,"time":1346615607,"description":"RealLPC\nWe are proud to present the long-awaited RealLPC virtual guitar instrument bringing the incomparable Les Paul Custom Guitar sound to your studio.\n\nGibson's Les PaulÂ® Custom, a higher end variation of the Gibson Les Paul guitar has been used by the majority of world famous musicians, spanning generations and genres, such as Wes Montgomery, Al Di Meola, Pat Metheny, Chuck Berry, Jeff Beck, Peter Frampton, The Beatles, The Rolling Stones, Led Zeppelin, B.B.King, Bob Marley, Eric Clapton, Carlos Santana, Gary Moore, Eddie Van Halen, Lenny Kravitz, and many others.\n\nRealLPC - sample-based virtual instrument with an innovative approach to guitar sound modeling and guitar techniques emulating on a standard MIDI keyboard.\n\nRealLPC provides incredible playability based on the unique performance modes and easy-to-use keyboard layout as well as the advanced key/pedal/velocity switch system allowing a keyboardist to perform guitar parts with a whole new level of realistic expression. RealLPC covers practically all sounds, articulations, and techniques a professional guitarist can produce on his Les Paul, including mute, bridge mute, harmonics, pinch harmonics, unison bend, strumming, picking, chord chopping, scrapes, and much more...\n\nHigh quality dry samples recorded directly from Les Paul Custom pick-ups let you easily create any desired guitar sound using your favourite amplifier simulator.\n\nRealLPC innovations:\n\n* Multi-channel layering technology, incorporating a custom library of specially recorded samples taken from every fret of all 6 strings of a real guitar\n* The unique Floating Fret Position technology, which imitates change of fret position of a guitarist's hand on the neck. This gives you the possibility of playing on up to 140 guitar frets using just 46 keys of a standard keyboard!\n* Guitar Touch technology letting you easily imitate basic guitar techniques (strumming, plucking, sliding, bending, muting, etc...), using standard MIDI keyboard and MIDI controllers, such as Pitch Bender, Modulation Wheel, Sustain Pedal, Aftertouch\n* Sound Humanize technology allowing to wholly reduce 'machine gun' effect on note repetition (tremolo, strumming, plucking, etc...)\n\nRealLPC is equipped with powerful Pattern Manager\ncontaining complete MusicLab Guitar Pattern Library for easily creating guitar accompaniment tracks. All you have to do is to find the appropriate rhythm pattern[s] in the Pattern Manager tree view, copy it to the needed number of measures, start your sequencer and use MIDI keyboard to play chord changes, or alternatively add chords to a MIDI track via sequencer's editor.","torrent":{"xt":"urn:btih:005b6c4b9560d61d2fea1cb64a2e891af2b03a2e","amp;dn":"MusicLab+RealLPC+Standalone+DXi+VSTi+v1.0-ASSiGN+%2B+Crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"005b6c4b9560d61d2fea1cb64a2e891af2b03a2e","infoHashBuffer":{"type":"Buffer","data":[0,91,108,75,149,96,214,29,47,234,28,182,74,46,137,26,242,176,58,46]},"announce":[],"urlList":[]}}