{"title":"Dutch Treat A 051-100 (Various Until 01-07-2012 Part 2)","uid":7514483,"size":7751813135,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0092b0e1b57af9f4bf4a06cb201b452c5677af1b&amp;dn=Dutch+Treat+A+051-100+%28Various+Until+01-07-2012+Part+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1344431992,"description":"Hi,\n \nDutch Treat started as a collection in order to create a document for my first granddaughter containing a musical overview until her birth, called: The Day Before You Came.\n \nThis moment was probably the first time in history an individual was able to collect and listen to most music of our world, with the help of a few mouse clicks.\n\nTogether with the music community (I helped to build as an ICTer) I listened to some 300.000 tracks and felt I had to do something in return. So I selected a lot of tracks I would be happy to play for my customers (Bar) and created some playlists I share with you through the Dutch Treat series.\n \nAlong the way it became clear that the moment coincidented with a new movement that hides an important change in our world; Indie. Today all we need is a PC and Microphone. This will bring a lot of changes. So I took it kind of personal to introduce this new movement, with its familiar roots (music from home), as good as possible. So the Indie lists were added.\n \nOnce in a while we need to pause. So I froze my lists, created before the first of July and reorganized them to improve accessibility (and play sequence in cars). Cleaned my 200 old torrents (could still be running elsewhere) and created six torrents to cover the Dutch Treat playlists until 01-07-2012.\n \nA 001-050 (Various artists in various genres part 1)\nA 051-100 (Various artists in various genres part 2)\nB 001-030 (Artists highlighted)\nC 001-035 (Sweetlists various moods)\nI 001-055 (Indie Part 1)\nI 001-055 (Indie Part 2)\n \nYou may need some patience but when we share we will share a lot of beauty to enjoy (and get some new ideas from).... Enjoy. \n","torrent":{"xt":"urn:btih:0092b0e1b57af9f4bf4a06cb201b452c5677af1b","amp;dn":"Dutch+Treat+A+051-100+%28Various+Until+01-07-2012+Part+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0092b0e1b57af9f4bf4a06cb201b452c5677af1b","infoHashBuffer":{"type":"Buffer","data":[0,146,176,225,181,122,249,244,191,74,6,203,32,27,69,44,86,119,175,27]},"announce":[],"urlList":[]}}