{"title":"The Ed Show 8-22-12.mp4","uid":7561061,"size":168647109,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0240a384965fef4f26cb0f3aa34441072f3800fc&amp;dn=The+Ed+Show+8-22-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1345740127,"description":"The Ed Show; August 22, 2012.\n\nPaul Ryan is desperately trying to run from his radical past. But the GOP presidential ticket can't hide from their &quot;Akin&quot; problem.\n\nEd started with Terry O'Neill (President of The National Organization for Women), s Ed Schultz to connect the dots.\n\nThe Republican party supports Todd Akin's stance &quot;no exception for rape&quot; on abortion, so why are they running from him?\n\n Bob Shrum (Democratic Strategist) and Michael Steele (former Chairman of the Republican National Committee and MSNBC Analyst), looked at the explosion of Republican hypocrisy just five days before the Tampa convention.\n\nThe New York Times exposed another Mitt Romney lie on Medicare: that his plan wouldn't impact today's seniors. Ed corrected the white board again with Jonathan Alter (MSNBC Political Analyst and Bloomberg View Columnist).\n\nThe Republican obstruction in Congress leads to a dire warning from the Congressional Budget Office (CBO) about recession. The Romney camp is whacking the president on it, but Sen. Barbara Boxer joined Ed to whack back.\n\nYou won't believe what a Texas judge is speculating could happen if president Obama wins re-election.\n\nAnd in the Big Finish, the president is sacking Mitt Romney on his education plan. To finish, Super Bowl champ Warren Sapp explained how public education helped made him a football legend. ","torrent":{"xt":"urn:btih:0240a384965fef4f26cb0f3aa34441072f3800fc","amp;dn":"The+Ed+Show+8-22-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0240a384965fef4f26cb0f3aa34441072f3800fc","infoHashBuffer":{"type":"Buffer","data":[2,64,163,132,150,95,239,79,38,203,15,58,163,68,65,7,47,56,0,252]},"announce":[],"urlList":[]}}