{"title":"The Undertaker and His Pals (1966)","uid":7094371,"size":3942555648,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0298a313e34e2afa73dc5779a3e3aa0386d823f9&amp;dn=The+Undertaker+and+His+Pals+%281966%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Odin1066","files":-1,"time":1331488618,"description":"A Funeral Home owner has two friends who run a diner. Both enterprises aren't doing too well. So they think of a fiendish way to increase their businesses revenues. Well many rate this as a very bad movie. It is actually an intentionally silly horror movie and when you keep that in mind it is OK. And at least it is barely over one hour long. Being made in 1966 gives it some pleasing aspects like the music and  the three villains each have a beautiful mid-60s Triumph motorcycle which look and sound awesome. It has a fun review of all the characters before the ending credits are shown.\n\nWritten and Directed by T.L.P. Swicegood\nProduced by David C. Graham and Alex Grattan\nOriginal Music by Johnny White\nStarring: Ray Dannis, James Westmoreland, Marty Friedman, Warrene Ott, Sally Frei, Karen Ciral\nLength: 63 minutes  (Supposedly this film was edited because some theatres refused to show it and now no original, longer, unedited prints are known to exist.) \n\nI added some things before and after this movie which are about from the same time. There is a Coca-Cola, Newport cigarette and Folgers coffee commercial, then a Television Code of Conduct PSA before. After are a Colt 45 Malt Liquor commercial, a 10 minute long Westinghouse air conditioner models for 1966 short film featuring a pretty dancing presenter (probably shown at trade shows and dealer meetings), a Noxema mens shaving cream commercial and finally a movie trailer for Modesty Blaise.\n\nVideo:  720x480 MPEG2 NTSC 29fps\nAudio:  2 channel Stereo 48kHz\nTotal Length:  1:22:55\n","torrent":{"xt":"urn:btih:0298a313e34e2afa73dc5779a3e3aa0386d823f9","amp;dn":"The+Undertaker+and+His+Pals+%281966%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0298a313e34e2afa73dc5779a3e3aa0386d823f9","infoHashBuffer":{"type":"Buffer","data":[2,152,163,19,227,78,42,250,115,220,87,121,163,227,170,3,134,216,35,249]},"announce":[],"urlList":[]}}