{"title":"Patto - Patto(1970)(2002 Akarma)","uid":7098090,"size":254824979,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:032838e169b72c74313c4f3f6d528e5facec2b42&amp;dn=Patto+-+Patto%281970%29%282002+Akarma%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1331623398,"description":"eac secure cue log scans\n\n2002 - Akarma Records / 185 / Remastered / CD\n\nDon't be scared off by the frightening album art--an eyeless, open-mouth face, with hair made out of faces, and whose teeth spell &quot;Patto,&quot; streaming in through an open window(!!!); this is hard-rocking jazzy 70's rock with a bluesy sensibility, and isn't nearly as weird as the killer cover art may lead you to believe. Mike Patto's vocals are thick, rough, and genuine, and Ollie Halsall's guitar might be the primary draw--it's fluid, scorching, and fast, morphing to fit whatever each song demands, never boring and rarely unlistenably over-technical.\n\nThe album opens on a deceptively moody note, with Halsall's guitar cleanly chording and the bass and drums laying down an odd-tempo groove. As &quot;The Man&quot; works toward its climax, though, you're going to realize how rocking of a ride you're in for--Patto's soulful wailing is perfect, plus there's a vibraphone solo--played by Halsall! The opener is a very good omen; the band is weird enough to lay out strange time signatures and unusual rock instruments like vibraphone, but doesn't forget how important it is to rock! &quot;Hold Me Back&quot; is a catchy but dubious ode to chasing underage girls. It seems like only a 70's rock band could get away with that kind of subject matter. &quot;Time To Die&quot; is a change of pace, with acoustic guitar and Patto's world weary vocals really living the blues. &quot;San Antone&quot; is one of the jazziest tunes; it's in swing time and features great doo-wop-style background vocals. &quot;Government Man&quot; is probably my favorite track outside of &quot;The Man&quot;--it's sort of a story song, and it finds Patto at the height of his renegade, &quot;me vs. the man&quot; attitude (which pops up a lot on the album), and sounds like something straight out of Dusty in Memphis. &quot;Money Bag&quot; is the band at its jazziest, with 6:30 of pounding drums and wicked guitar shredding that morphs into a pretty sweet, laid back blusier song with vocals--since the guitar is a main draw for this band, it's probably an asset, but I can imagine song-oriented listeners having a hard time following the loose structure.\n\nIf there's any real flaw to Patto's approach, it's probably that their inventive songwriting approach includes a lot of unusual chord progressions which, because they're more complicated, often aren't backed up by strong melodies or memorable hooks, which makes a few of the tunes (&quot;Red Glow&quot; and &quot;Sittin' Back Easy,&quot; to my mind) enjoyable but tough to remember after hearing them. You have to pay pretty good attention to appreciate what they're doing, and I suppose eventually the hooks will sink in. Either way, I strongly recommend this album to fans of jazzier rock like John McLaughlin et al (this is a bit less intense) and as a more interesting alternative to bands like May Blitz. Repertoire, as usual, did a great job of remastering the album, and the jacket is really high-quality with a textured cover, and the album includes one 14 minute-long bonus track, &quot;Hanging Rope,&quot; which is similar to &quot;Money Bag&quot; in structure, but the vocal portion is catchier.\n\n\n\n1. Man\n2. Hold Me Back\n3. Time to Die\n4. Red Glow\n5. San Antone\n6. Government Man\n7. Money Bag\n8. Sittin' Back Easy ","torrent":{"xt":"urn:btih:032838e169b72c74313c4f3f6d528e5facec2b42","amp;dn":"Patto+-+Patto%281970%29%282002+Akarma%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"032838e169b72c74313c4f3f6d528e5facec2b42","infoHashBuffer":{"type":"Buffer","data":[3,40,56,225,105,183,44,116,49,60,79,63,109,82,142,95,172,236,43,66]},"announce":[],"urlList":[]}}