{"title":"Deranged.High.Comedy.US","uid":7580023,"size":4390162432,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:05e21bf302ffbde024abdf6728d021f254e778ec&amp;dn=Deranged.High.Comedy.US&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Vito15","files":10,"time":1346214142,"description":"Name: Deranged High\nGenre: Comedy\nIMDB Link: http://www.imdb.com/title/tt1595639/ \nIMDB Rating: 8.3/10 \nDirector: Vincent Shkreli\nWriters: Vincent Shkreli, Luke Marco\nCast: Johnny Skreli, Josh Hyman and Luke Marco\nPlot: \n\nThe teachers and students have their own agenda at Montgomery High. Principal Edwards wants all the teachers to be on their best behavior and look professional when the new, young, and sexy teacher Ms. Thomas arrives. The arrogant history teacher Mr. Hudson has to deal with his hangover while at the same time argues with the perverted science teacher, Mr. Bruce Lee Willis as both are trying to win the heart of Ms. Thomas. Timid English teacher Mr. O'Neal has to deal with his seductive relationship with down and out math teacher Mrs. Richards. In the students case, you have high school sweethearts and virgins, David and Veronica. But things with David and Veronica turn stale when class beauty and cheerleader Marissa persuades David to be her boyfriend so she can make her ex-boyfriend, the dumb and cocky Richard, insanely jealous. This is David's chance to finally lose his virginity with Marissa but his pothead friends Patrick and Brian question if he should risk his relationship with Veronica.\n\n \n\nNotes: \nThis movie was filmed during a 6 day shoot on a very low budget. We worked 13 hours each day and shot with two cameras. Please provide feedback on the film (positive or negative). Thank You! Enjoy! \n\nIndependant Film Director Looking for feedback on first film.\n\n\nRun Time: 92 mins.\nRelease Name: Deranged High\nFormat: VLC Media File (.vob)\nSize: 4.08 GiB\nSubtitles: None\n\n\n","torrent":{"xt":"urn:btih:05e21bf302ffbde024abdf6728d021f254e778ec","amp;dn":"Deranged.High.Comedy.US","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05e21bf302ffbde024abdf6728d021f254e778ec","infoHashBuffer":{"type":"Buffer","data":[5,226,27,243,2,255,189,224,36,171,223,103,40,208,33,242,84,231,120,236]},"announce":[],"urlList":[]}}