{"title":"The Ed Show 8-31-12.mp4","uid":7588829,"size":183646759,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:06f79522cead85e082d7b66f221d163917ac8508&amp;dn=The+Ed+Show+8-31-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1346483234,"description":"The Ed Show; August 31, 2012.\n\nThe truth took a beating in Tampa as the Republican National Convention ends with another flurry of lies. Will the Romney campaign's strategic dishonesty work?\nEd set the record straight in a special report on The Ed Show!\n\nThen, did the ghosts of the GOP's past and future overshadow Mitt Romney at the RNC? Van Jones (President and Co-Founder of the Rebuild the Dream), and Richard Wolffe (MSNBC Political Analyst), looked at the convention fallout.\n\nJosey Wales rides again! Ed explained how the Romney camp made the decision to allow the Clint Eastwood fiasco and how Republicans are trying to bail him out.\n\nScott Walker, Paul Ryan and Mitt Romney are all lying about the closing of a GM plant in Janesville, Wisconsin, and the auto loan. Friday (8/31/12), the workers, including Brad Dutcher (fmr. Janesville GM Plant Worker &amp; UAW Assistant Regional Director), and Ron McInroy (UAW Region 4 Director), joined Ed to respond and fact-check the RNC.\n\nKarl Rove got caught joking about murdering Missouri Senate candidate Todd Akin. Ed explained.\n\nAnd in the Big Finish, a major victory for the voters in Ohio: the Republican voter suppression effort was overruled by a federal judge. The one and only state senator Nina Turner (D-OH) responded. ","torrent":{"xt":"urn:btih:06f79522cead85e082d7b66f221d163917ac8508","amp;dn":"The+Ed+Show+8-31-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06f79522cead85e082d7b66f221d163917ac8508","infoHashBuffer":{"type":"Buffer","data":[6,247,149,34,206,173,133,224,130,215,182,111,34,29,22,57,23,172,133,8]},"announce":[],"urlList":[]}}