{"title":"The Sexualist (1975 Classic XXX)","uid":7516941,"size":763275264,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:07e6054faf9d1e063de9f64a823f87dbafc7c893&amp;dn=The+Sexualist+%281975+Classic+XXX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1344500864,"description":"Description:\nA screwball, anything-goes porn comedy that will appeal mainly to people who are open-minded about what is funny.\nJeffrey Montclair (Dale T. Fuller) is a former psych student and astrologist who decides that the greatest strides in 1975 society are being made in the graphic depictions of the art of love taking place in the newly-permitted adult film industry. Anxious to spread his message of Aquarian lust and understanding (not to mention the joys and importance of female masturbation!) through this medium, he takes out ads in all of the underground rags to get performers that represent all signs of the zodiac.\nUnfortunately for he and his producer Mr. Godfather (Jon F. Oppenheim), his first coupling is NOT going smoothly, with starlet Monica (Jennifer Welles) not quite hitting it off with her black co-star. Montclair envisions a beautiful meeting of the races and cultures, but all she can do is bitch at him that he can't turn her on, and he complains that &quot;her pasty white ass&quot; does nothing for him! Oh well.\nWith that, she's off to her local watering hole to get a drink (a theater marquee shows a double-bill of MARK OF THE DEVIL and CRY OF THE BANSHEE) and see if she can spot any young nubile girls to snag. Sure enough, in comes a runaway girl on a bike and Monica swoops in, taking her back to her pad and telling her that she can read some of her scripts (penned by brother Bob, &quot;the best in the business&quot;) the following day, and they get down to some sweet lovin'.\nAs if on cue, Bob shows up the next day and woos the girl with promises of stardom, setting up an interview with the dreaded Montclair! This doesn't sit well with Monica, and before you can say &quot;That's Showbiz&quot;, the girl has snagged Lady M's dream part, causing her to pull a dastardly manoeuvre that will set a tragic course...\n\nScene Breakdowns:\nScene 1. Arlana Blue, Jennifer Welles\nScene 2. Tina Russell\nScene 3. Jason Russell\nScene 4. Tina Russell, Jason Russell\nScene 5. Tina Russell, Jason Russell\nScene 6. Arlana Blue, Jennifer Welles\nScene 7. Tina Russell, Jason Russell\nScene 8. Tina Russell, Jason Russell\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=4pnd9plvikc9gfeqzgo5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=4pnd9plvikc9gfeqzgo5.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=swp7jrd3v7egmdx7ti0c.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=swp7jrd3v7egmdx7ti0c.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:07e6054faf9d1e063de9f64a823f87dbafc7c893","amp;dn":"The+Sexualist+%281975+Classic+XXX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07e6054faf9d1e063de9f64a823f87dbafc7c893","infoHashBuffer":{"type":"Buffer","data":[7,230,5,79,175,157,30,6,61,233,246,74,130,63,135,219,175,199,200,147]},"announce":[],"urlList":[]}}