{"title":"Onyx - Cold Case Files: Vol 2","uid":7534166,"size":131197003,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0950709365d22ae08136e72e52075e48263c2ecb&amp;dn=Onyx+-+Cold+Case+Files%3A+Vol+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dapbuploa","files":16,"time":1345046635,"description":"New album from hardcore rap group ONYX. 16 never-before-heard tracks. Not released on physical CD, this album was put out independently by ONYX themselves on their website. \n\nTrack list:\n\n1. Set It Str8\n2. Kidz From Queens\n3. Bring It\n4. Hi Hoe\n5. Crime Stories\n6. Punk Motherfukaz (full version, remastered and much better sound quality than one we put on Youtube)\n7. To All Ya'll Crews, Whatever (unrelated to Onyx song of similar title on Youtube. Never before heard, rough cut from All We Got Iz Us!)\n8. Anything Goes (flawless quality; better than leak we put on Youtube)\n9. Give It All You Got\n10. Flip Dat Shit (featuring Notorious B.I.G., Naughty By Nature, and 3rd Eye)\n11. Pussy on the Regular\n12. Take That (full length, much higher quality than one we leaked to Youtube)\n13. Raze It Up (alternate lyrics)\n14. Love of Money '96 (never-before-released version of other 2 Onyx songs with similar title; rock version. RIP X-1)\n15. We Comin' Thru Ya'll\n16. Walk in New York (original pre-album version heard on the Onyx DVD).\n\nWhat's up Onyx fans!! Here's the new hardcore collection of rare Onyx tracks. Meticulously collected by members of the group over the years, this purchase downloads right in your web browser. There is ABSOLUTELY NO DRM, and NO COPY PROTECTION on these MP3s! Burn them to CDs or copy them to whatever device you have a million times; there's no restrictions!\n\nKeep in mind that 100% of your purchase goes to members of Onyx. No record companies or anyone else taking a cut. You can log back in and download your purchase over and over again if you need to.\n\nWe wanted to give this to fans who are fiendin' for &quot;new&quot; Onyx music. Some of these are from very old cassette tapes from Onyx's lab; so the sound quality is good but not perfect. Other tracks were stored digitally on DAT all these years and sound perfect. Either way, the MP3s are super-high quality at a 256kbps bit-rate, and Punk Motherfukaz (full) and Take That (full) have been professionally restored from newer tapes so they sound much better than the other copies we put on Youtube. The rest? Tracks NOBODY has ever heard before. Even if the title sounds familiar, trust us, you never heard it!\n\nWhen you purchase, come back to this page and click the &quot;Downloads&quot; tab and all the links to the tracks will be there for you. Click the &quot;all tracks&quot; zip file to download them all at once, or click on the MP3s individually in the list; it's your choice! \t","torrent":{"xt":"urn:btih:0950709365d22ae08136e72e52075e48263c2ecb","amp;dn":"Onyx+-+Cold+Case+Files%3A+Vol+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0950709365d22ae08136e72e52075e48263c2ecb","infoHashBuffer":{"type":"Buffer","data":[9,80,112,147,101,210,42,224,129,54,231,46,82,7,94,72,38,60,46,203]},"announce":[],"urlList":[]}}