{"title":"Real Colors Pro v1.0.13 Final By bobiras2009","uid":7583530,"size":7974727,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:0a3b7b9a5b7f7b2e78e34216058d60eca67832f8&amp;dn=Real+Colors+Pro+v1.0.13+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346352241,"description":"                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nGenerate color schemes and beautiful color themes from images. We help designers, artists or craft makers get color inspiration from real life, capture real color palettes from images by using advanced algorithms to automatically extract colors.\n\nThe app uses popular color theory generation modes like monocromatic, triad, shades, analogus, complementary, split complementary or tetrad to create the perfect color theme for your next project. It's like using an auto color snap tool in real life.\n\nFeatures:\n\n    Automatically extract harmonious color schemes from images using a wide range of color theory generation modes: complementary, monochromatic, analogous, shades, triad, tetrad or split complementary *New*\n    Generate beautiful wallpapers from your favorite color schemes *New*\n    Automatically generate the color spectrum over the processed image\n    Colors can be easily edited\n    Find out detailed information about the colors including HEX, RGB and HSB values\n    Save color schemes in a Library for future reference and sharing\n    Color schemes can be exported by email, including color spectrum information, and color values in HEX, RGB and HSB.\n    Share your favorite color schemes with your friends on Facebook\n\nWhat's in this version : (Updated : Aug 29, 2012)\n\n    Fixed bugs\n    Added language support for German, Romanian, Portuguese, Italian, Chinese, French, Hungarian, Korean and Russian (If you find any translation mistakes please let us know at realcolors@makan_studios.com)\n    Added copy/paste for hex values for devices with Honeycomb and above\n    Added support for devices using x86 platform\n\nRequired Android O/S : 2.1+\n\n\n\n\n\n                                By bobiras2009\t\t\n","torrent":{"xt":"urn:btih:0a3b7b9a5b7f7b2e78e34216058d60eca67832f8","amp;dn":"Real+Colors+Pro+v1.0.13+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a3b7b9a5b7f7b2e78e34216058d60eca67832f8","infoHashBuffer":{"type":"Buffer","data":[10,59,123,154,91,127,123,46,120,227,66,22,5,141,96,236,166,120,50,248]},"announce":[],"urlList":[]}}