{"title":"Hell Cell","uid":7459552,"size":298164445,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0ac6e568c86c6baf6178b71ec5b58aa994ba23e6&amp;dn=Hell+Cell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rastamandita","files":3,"time":1342776811,"description":"Synopsis: FBI agent John Adams is on a life's quest, driven by dark dreamscapes in his childhood, to defeat the evil of the world. Beside him is his partner agent Eleanor Everson who shares his quest but with a brighter perspective in mind. After an investigation John deciphers the pattern of a serial killer who reflects the sum of all evil. This case invokes John to remember his childhood dreamscapes and realise that his nightmares are becoming reality. In the pursuit of his suspect, a psychopath profiled as the 'The Prince of Darkness', John is caught in a multi-dimensional battle with the darkness inside the Hell Cell.\nConcept: The aim of the film is to illustrate and translate the nature of multiple realities and the gradual evolution to the transcendental, through a virtuous play of perspectives, shifts from black and white to colour, shifts of the music themes and the integration of dynamic symbols.\nDirector's Synopsis:\nThe life of John Adams as a federal agent is mirrored through his entrance into a parallel reality both twisting and expanding the perception of the time-space continuum. In the midst of this twist are a couple of sorcerers that manipulate the events like puppeteers from a higher realm. As the storyline progresses so do the contours of the animation, symbolizing that as the mind evolves it develops vaster insight and is capable of noticing far more than it was initially programmed to. This gives the viewer a vaster grasp of existence. So, the understanding that life is nothing other than various realms of animation projected by a higher force Arises.","torrent":{"xt":"urn:btih:0ac6e568c86c6baf6178b71ec5b58aa994ba23e6","amp;dn":"Hell+Cell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ac6e568c86c6baf6178b71ec5b58aa994ba23e6","infoHashBuffer":{"type":"Buffer","data":[10,198,229,104,200,108,107,175,97,120,183,30,197,181,138,169,148,186,35,230]},"announce":[],"urlList":[]}}