{"title":"Blacklight Retribution v0.980","uid":7503207,"size":5717650721,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0ada174d1abf0b82ec2e73f20d2e39be3997ffd6&amp;dn=Blacklight+Retribution+v0.980&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"wavespell","files":-1,"time":1344087375,"description":"Wage war with advanced weapons and technology in Blacklight: Retribution, a free-to-play, futuristic first-person shooter. Deploy devastating armored exoskeletons and utilize lethal hand-held weapons in vicious competitive modes.\n\nSUIT UP, SIGHT ON, FIRE AWAY\n\nThe Hardsuit is the ultimate weapon. Powerful but slow, this armored suit packs a one-shot, one-kill railgun and a high velocity minigun to clear rooms... fast. Only by using teamwork, heavy weapons from in-game Weapon Depots and the Hyper Reality Visor (HRV), can players overcome the futuristic killing machine.\n\nThe advanced HRV enables players to see opponents, teammates, Weapon Depots and Hardsuit weak points through walls, but at the cost of all offensive capability.\n\nPlay with Hardsuits and the HRV alone or with a team of friends in one of Blacklight's tightly polished game modes. Current modes include: Deathmatch, Team Deathmatch, Domination and King of the Hill, but more are on the way.\n\nBUILD A FIGHTING MACHINE\n\nCustomize weapons, armors, taunts and more down to incredibly detailed levels. Play with muzzles, stocks, ammunition and more. Even configure the advanced weapons available from in-game depots.\n\nRegister to play for free @ playblacklight.com\t","torrent":{"xt":"urn:btih:0ada174d1abf0b82ec2e73f20d2e39be3997ffd6","amp;dn":"Blacklight+Retribution+v0.980","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ada174d1abf0b82ec2e73f20d2e39be3997ffd6","infoHashBuffer":{"type":"Buffer","data":[10,218,23,77,26,191,11,130,236,46,115,242,13,46,57,190,57,151,255,214]},"announce":[],"urlList":[]}}