{"title":"Guardians Of The Galaxy (Complete and No Ads)","uid":7505420,"size":1613473654,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0ca54237d993b9b34234275a33fc84a9de8aee76&amp;dn=Guardians+Of+The+Galaxy+%28Complete+and+No+Ads%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SplhcbPrime","files":-1,"time":1344154651,"description":"The original Guardians of the Galaxy are a fictional superheros team who appear in comic books published by Marvel Comics starting in January, 1969.\n\nIn Volume 1, The Guardians are active in the 31st century of an alternate time-line in the Marvel Universe on a planet dubbed Earth-691.  The original members of the team include:  Major Vance Astro, an astronaut from the 20th century Earth who spends a thousand years travelling to Alpha Centauri in suspended animation; the hero Vance Astrovik, now called Justice; Martinex T'Naga, a crystalline being from Pluto; Captain Charlie-27, a soldier from Jupiter; and Yondu Udonta, a blue-skinned &quot;noble savage&quot; from Beta Centauri IV.\n\nEach member is apparently the last of their kind and are forced to unite as a team against the actions of the Badoon, an alien race which attempts to conquer their Earth's solar system.  During the course of the war against the Badoon, the team recruit two more members, Starhawk and Nikki, and travel back in time where they encounter several of the heroes of 20th century Earth, including Captain America and The Thing.\n\nThe Guardians eventually defeat the Badoon, but soon find themselves facing a new foe called Korvac, who was in fact a creation of the Badoon.  After teaming with the Thunder God, Thor to defeat Korvac in the 31st century, the Guardians then follow Korvac to 20th century Earth, where, together with The Avengers, they fight a final battle.\n\nThe Guardians reappear years later and have a series of adventures with several others who eventual join The Guardians:  The Inhuman Talon; Replica, the Skrull; and the second version of Yellowjacket, Rita DeMara.\nWanting to expand the Guardians to a multiple team organization, Martinex eventually leaves the team to look for additional members for a second unit, nicknamed the Galactic Guardians.\n\nIn Volume 2 (started in May, 2008,) the team that was to become the Earth-616 incarnation of the Guardians discover a time displaced Vance Astro in a block of ice floating in space.  It is his introduction as &quot;Major Victory of the Guardians of the Galaxy&quot; that inspires the team to take up the name.  In issues 7 and 16, it was revealed a great &quot;error&quot; in the present day has caused the future to be destroyed.  Starhawk is constantly trying to prevent it via time travel, causing the future (and the Guardians) to be altered.  Only Starhawk, who is changed with each reboot, realizes anything is different, but each change still ends in a cataclysm.\n\nOn July 14, 2012 Marvel Studios officially confirmed that &quot;Guardians of the Galaxy&quot; is on its way to the big screen with a release date of August 1, 2014. The cast lineup includes Drax the Destroyer, Rocket Raccoon, Gamorra, Groot and Star Lord.\n\nThis humble torrent includes:  all issues of both Volumes; all four GOTG Annuals; plus some of the appearances of the GOG Gang in various other publications over the years.\n\nEnjoy, and please seed.\n\nNOTE:  These are not my scans.  All praise and glory to the original scanners, please.","torrent":{"xt":"urn:btih:0ca54237d993b9b34234275a33fc84a9de8aee76","amp;dn":"Guardians+Of+The+Galaxy+%28Complete+and+No+Ads%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ca54237d993b9b34234275a33fc84a9de8aee76","infoHashBuffer":{"type":"Buffer","data":[12,165,66,55,217,147,185,179,66,52,39,90,51,252,132,169,222,138,238,118]},"announce":[],"urlList":[]}}