{"title":"Obiatrypi - Cloud Motel","uid":7484476,"size":116661153,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0cb127633bcac286b00d4b35fcd39f1948e00d3d&amp;dn=Obiatrypi+-+Cloud+Motel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"e7add9","files":1,"time":1343536222,"description":"1 - Our Benefactors Ceramic [4.14]\n2 - Conscientious Objector [3.58]\n3 - 70 Sheets of Wide Ruled Paper [2.51]\n4 - Series of Things [4.27]\n5 - Gods Fridge [2.46]\n6 - Body Machine [7.05]\n7 - King of Cake [0.45]\n8 - Andean Pipe Dream [4.20]\n9 - Waking Up in March [5.03]\n10 - Operator line dead at 215 [3.40]\n11 - Nazcastereo [6.34]\n\n&quot;The musical ideas put forth on this record don't make sense if you try to make them make sense if that makes sense&quot;\n\nThis record was made over the course of about 8 or so months, beginning in December 2011. I wrote and played all the music, wrote being used liberally as a great deal of the music was recorded without a clear structure or direction in mind. Rather I just took the advantage of having the opportunity to record some music at my home and this is what was the final stuff.\n\nlisten to it loud, at night, Trip Out to it.\n\n---\n\nGuitar-FM4 filter modeler-polytune-Crybaby Classic wah-Phase90-DS1-BossDD3\nall guitars tracked thru 10watt Yamaha GA-10 (one of my favorite combo amps ever)\n\nDrums in 70 Sheets were programmed in FL Studio 9\n\nAll music except drums in series of Things was programmed in Reason 4. Drums were programmed in FL Studio 9 and I think i ran the drums through a phaser in Reason..\n\nAll music in Gods Fridge and Body Machine was written in Reason 4\n\nAndean Pipe Dream- intro melody written in Reason 4. Drums in reason 4. Piano composed in Reason 4. Guitar melodies were improvised\n\nWaking Up in march - Drums programmed through Fl Studio 9. the bass guitar is root notes of the chord progression played on the E string of a Les Paul.\n\nOperator line dead at 215 was the last song written. Guitar pedals and bass. Mainly the FM4 and the DD-3 digital delay were used .\n\nNazcastereo was the result of a week long obessesion with Radioheads album AMNESIAC. the beat from .10 to .32 was my attempt at remaking the reverbd harbor noises in &quot;Packt Like Sardines in a Crushd tin box&quot;. All music composed in Reason 4 except guitar melodies\n\n---\n\nThanks for downloading, i had fun making this record. Keep torrenting alive!\n\nIf you paid for this album you got ripped off. You can reuse this music anywhere for anything as long as credit is given to the name &quot;Obiatrypi&quot;.\n\nKeep an eye out for new music on my youtube channel\n\n\nBye, Namaste, have a great day\n\nDG\n\n7/28/12","torrent":{"xt":"urn:btih:0cb127633bcac286b00d4b35fcd39f1948e00d3d","amp;dn":"Obiatrypi+-+Cloud+Motel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cb127633bcac286b00d4b35fcd39f1948e00d3d","infoHashBuffer":{"type":"Buffer","data":[12,177,39,99,59,202,194,134,176,13,75,53,252,211,159,25,72,224,13,61]},"announce":[],"urlList":[]}}