{"title":"Do Chattaney hindi dub@goldy!!!!!!!!!!!!!!!!!!!!","uid":7588943,"size":1016867297,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0e32b6176d22ea500c523bd497b7d6f636cac8e2&amp;dn=Do+Chattaney+hindi+dub%40goldy%21%21%21%21%21%21%21%21%21%21%21%21%21%21%21%21%21%21%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"c_goldy","files":-1,"time":1346486347,"description":"Super hit action movie Do Chattaney 2008 (Malayalam Hindi Dub) Synopsis : Do Chattaney is story of Vijayan and Madhavankutty, stepbrothers who are at loggerheads due to plenty of old scores. Sons of the late police officer Mampilly Rajashekharan, Madhavankutty is the only son of Rajashekharan's legally married wife, but Vijayan, the illegitimate son was given the right to light the funeral pyre during his father's death. From there, Madhavankutty who refuse to acknowledge Vijayan as his brother, singles out every opportunity to irk and denounce Vijayan and his mother who are now considered as his sworn enemies. The Annual Kabadi Championship in memorial of their father is one such event where the brothers come up for cat fights. Vijayan has Biju and Komalan as his senseless croonies, while Madhavankutty roams around with Ramesan and Basheer in a jeep named 'Mambully-Original'. It could be a point of interest and engagement for you, to count exactly how many times these pair of idiotic aides gets beaten up by virtually everyone in the frame in their attempts to bring in some sort of laughs. Chitrangadan, the former Panchayath President and his wife Sarala the present Panchayath President, are the two who adds oil to the fire, igniting new skirmishes, campaigning for and against the brothers in arms. This do-or-die Kabadi game for both brothers suddenly turns irrelevant, with the arrival of Pooja and Sneha, twin daughters of Judge Viswanathan, to the village. Madhavankutty and Vijayan falls for each of them, but don't recognize them as twins. This results in them seeing the other as rivals in love also. How all of this chaos leads to further tortuousness and subjects of forced humor, forms the rest of the movie. \n\n\n\nplease check sample b4 making comments\n\ndnt forgt to say tks if u like my work\n\n\nfor more nice torrents pls visit\n &lt;a href=&quot;\nhttps://thepiratebay.se/user/c_goldy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/c_goldy&lt;/a&gt;\n\nplssssssss seed for otherssssssss....","torrent":{"xt":"urn:btih:0e32b6176d22ea500c523bd497b7d6f636cac8e2","amp;dn":"Do+Chattaney+hindi+dub%40goldy%21%21%21%21%21%21%21%21%21%21%21%21%21%21%21%21%21%21%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e32b6176d22ea500c523bd497b7d6f636cac8e2","infoHashBuffer":{"type":"Buffer","data":[14,50,182,23,109,34,234,80,12,82,59,212,151,183,214,246,54,202,200,226]},"announce":[],"urlList":[]}}