{"title":"POtHS - SIN-ister Secrets - 77 - Forks Over Knives  2011 - MUST ","uid":7497797,"size":2630435354,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0e44bc53124fd07db3c7747277255fa9c5f3bb7a&amp;dn=POtHS+-+SIN-ister+Secrets+-+77+-+Forks+Over+Knives++2011+-+MUST+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1343927238,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - SIN-ister Secrets - 77 - Forks Over Knives  2011 - MUST SEE\n\n\nPOtHS Comment: Are you a Fat Slob?? That is the Plan of The Food Industry,(there is more than that actually) The Elite are using The Food Industry to &quot;slow kill&quot; YOU.\nDescription:\n\nLee Fulkerson's illuminating documentary serves as a natural successor to Food, Inc. in taking a critical look at the consequences of Western dietary habits. While some might view the lower-budget Forks over Knives as a long-form commercial for veganism, Fulkerson's evidence supporting the benefits of a plant-based diet is too compelling to dismiss (and he never claims that a small piece of cheese ever killed anyone). The filmmaker builds his case around the work of two doctors who grew up on farms where cow's milk was considered &quot;nature's perfect food,&quot; as Dr. T. Colin Campbell puts it, and went into different fields of medicine, but their research led them to the same conclusion. For 20 years, Cornell University nutritional biochemist Campbell focused on China, where degenerative disease rates skyrocketed with the increased consumption of meat and dairy. By contrast, Japan and Kenya, where the fare is leaner, have experienced far fewer incidences of such illnesses. As a surgeon, Cleveland Clinic's Dr. Caldwell Esselstyn, an Olympic Gold Medalist for rowing, also witnessed the results of a dependence on animal-based and processed foods: heart disease, type 2 diabetes, and some forms of cancer. When his patients eliminated these items, they experienced significant improvement. Several appear on screen, along with Dr. Neal Barnard, Junshi Chen (collaborator on Campbell's China Study)--even mixed martial artist Mac Danzig. An opening title cautions that the film should not serve as a substitute for medical advice, but it certainly provides helpful information for anyone concerned about their health. --Kathleen C. Fennessy\nProduct Description\nWhat has happened to us? Despite the most advanced medical technology in the world, we are sicker than ever by nearly every measure.\n","torrent":{"xt":"urn:btih:0e44bc53124fd07db3c7747277255fa9c5f3bb7a","amp;dn":"POtHS+-+SIN-ister+Secrets+-+77+-+Forks+Over+Knives++2011+-+MUST+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e44bc53124fd07db3c7747277255fa9c5f3bb7a","infoHashBuffer":{"type":"Buffer","data":[14,68,188,83,18,79,208,125,179,199,116,114,119,37,95,169,197,243,187,122]},"announce":[],"urlList":[]}}