{"title":"Ski Safari v1.0.2 Final  By boiras2009","uid":7479599,"size":14727321,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:0ef4bbf804b468a1e46463f5790e6f6ea150acba&amp;dn=Ski+Safari+v1.0.2+Final++By+boiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1343349583,"description":"Ski Safari is where Animals, Avalanches and Action come together to create a new casual gameplay experience.\nOur deep sleeping hero has to stay ahead of a relentless avalanche that threatens the local mountainsides. Sven, as we like to call him, can use animals to aid his escape from an icey end. \n\nEach of the hillside animals have different attributes to make a speedier escape. Penguins glide further, Yetis are tougher, Eagles soar to great heights, each of these can provide useful advantage for Sven. Sometimes on the slopes Sven can find fast Snowmobiles which can ferry multiple animals a maintain a very high top speed.\n\nStaying ahead of the avalanche has its advantages and perks. Completing objectives can 'level up' Sven and increase his score multiplier. Riding animals, performing backflips add to the score and with an increased score multiplier Sven will rocketing up the highscore table with ease.\n\n\nWhat's in this version: (Updated : Jul 9, 2012)\n\n    Optimised loading and fixed some stalls on startup.\n    Added 2% more snowflakes.\n    Known Issues:\n    There are still some problems when switching apps on Galaxy Nexus running Jelly Bean (4.1). We're trying to find a solution to this so please bear with us! In the meantime use the back button on the title screen to exit out of the game.\n\nRequired Android O/S : 2.3+","torrent":{"xt":"urn:btih:0ef4bbf804b468a1e46463f5790e6f6ea150acba","amp;dn":"Ski+Safari+v1.0.2+Final++By+boiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ef4bbf804b468a1e46463f5790e6f6ea150acba","infoHashBuffer":{"type":"Buffer","data":[14,244,187,248,4,180,104,161,228,100,99,245,121,14,111,110,161,80,172,186]},"announce":[],"urlList":[]}}