{"title":"Race Relations in the United States.pdf","uid":7555750,"size":1197279,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10231bda2102cd240a7f388c1ef83f27ed677ba5&amp;dn=Race+Relations+in+the+United+States.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cowboy1966","files":-1,"time":1345604068,"description":"Race Relations in the United States, 1900-1920 By John F. Mcclymer\n\n\n 2009 | 200 Pages | ISBN: 031333935X , 0313337179 | PDF | 1 MB\n\n\n \n\nIn the first decades of the twentieth century, virulent racism lingered from Reconstruction, and segregation increased. Hostility met the millions of new immigrants from Eastern and southern Europe, and immigration was restricted. Still, even in an inhospitable climate, blacks and other minority groups came to have key roles in popular culture, from ragtime and jazz to film and the Harlem Renaissance. This volume is the content-rich source in a desirable decade-by-decade organization to help students and general readers understand the crucial race relations of the start of modern America. Race Relations in the United States, 1900-1920 provides comprehensive reference coverage of the key events, influential voices, race relations by group, legislation, media influences, cultural output, and theories of inter-group interactions.\n\n\n The volume covers two decades with a standard format coverage per decade, including Timeline, Overview, Key Events, Voices of the Decade, Race Relations by Group, Law and Government, Media and Mass Communications, Cultural Scene, Influential Theories and Views of Race Relations, Resource Guide. This format allows comparison of topics through the decades. The bulk of the coverage is topical essays, written in a clear, encyclopedic style. Historical photos, a selected bibliography, and index complement the text.","torrent":{"xt":"urn:btih:10231bda2102cd240a7f388c1ef83f27ed677ba5","amp;dn":"Race+Relations+in+the+United+States.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10231bda2102cd240a7f388c1ef83f27ed677ba5","infoHashBuffer":{"type":"Buffer","data":[16,35,27,218,33,2,205,36,10,127,56,140,30,248,63,39,237,103,123,165]},"announce":[],"urlList":[]}}