{"title":"Details for Growing Kids God's Way 3 Video DVD w/ PDF Workbook","uid":7442061,"size":23204058723,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1030f4994211f02572db71d9cd04b8ff226d42c5&amp;dn=Details+for+Growing+Kids+God%27s+Way+3+Video+DVD+w%2F+PDF+Workbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"instantnet","files":-1,"time":1342264555,"description":"If you like it, buy it.\n\nFrom website\nGrowing Kids God's Way on DVD w/Workbooks\n\n\nGROWING KIDS GOD'S WAY (Along the Virtuous Way) 5.0 series is a comprehensive values-based parenting curriculum. In the title the authors, Gary and Anne Marie Ezzo, place their emphasis on God's Way meaning the way of the Lord. We serve an ethical God. Moral rightness flows from His being. His moral law is a reflection of His holy character (Psalm 19:7). More than that, He has shown man what is good and what is required of him (Micah 6:8). Growing Kids God's Way can help any parent reach the heart of children with virtues and values that flow from the character of God and do it without stressing the child or the parents.\n\nUtilized by more than 9,000 churches and schools worldwide and serving over 1.7 million households, there is a reason why this core curriculum is so popular: it's practical and the applications work. The curriculum is designed for small group studies or can be utilized by individuals in the privacy of their own home.\n\nTopics include:\n\nHow to help children internalize virtues and values and how to help them practically live out the character of God in their life.\nWhat parents do to foster insecure children and how they can fix the problems that might now exist.\nHow to say &quot;I love you&quot; to your children and spouse in such a way that each member actually feels the full sensation of parental love.\nHow fathers build or undermine their children's sense of trust and confidence in parental leadership and how to build family loyalty and identity.\nWhat is true character and how do you teach your children to love and prefer each other?\nYou will learn how not to raise a moral robot&quot; but a child with moral sensibility.\nLearn what true biblical discipline is and what are the principles of first time obedience.\nHow to train right behavior into children so you will not have to spend unnecessary time correcting wrong behavior.\nHow to successfully handle sibling conflict, temper tantrums, and the three sister sins: lying, cheating and stealing.\nHow to instill that wonderful life-virtue of personal self-control and a sense of personal responsibility.\n\nThere are numerous examples, charts and teaching tools that assist the learning process along with a number of insightful appendices, each of which has helped internationally popularize the curriculum.\n\nGrowing Kids God's Way on DVD comes with the Introduction through Session 17 teaching lessons (18-week total), along with 2 student workbooks and leaders guide. For the blended families there are additional supplemental resources available to help their unique needs.","torrent":{"xt":"urn:btih:1030f4994211f02572db71d9cd04b8ff226d42c5","amp;dn":"Details+for+Growing+Kids+God%27s+Way+3+Video+DVD+w%2F+PDF+Workbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1030f4994211f02572db71d9cd04b8ff226d42c5","infoHashBuffer":{"type":"Buffer","data":[16,48,244,153,66,17,240,37,114,219,113,217,205,4,184,255,34,109,66,197]},"announce":[],"urlList":[]}}