{"title":"The Beatles Anthology Documentary - COMPLETE 5 DISC SET","uid":7507106,"size":23425376840,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1098604c67b76e31f1bb37c54b0df3635497b2dd&amp;dn=The+Beatles+Anthology+Documentary+-+COMPLETE+5+DISC+SET&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"XASOPA","files":77,"time":1344210700,"description":"Initially broadcast as a TV miniseries to go with the series of three Anthology double-CD albums, this set of eight documentary tapes has the heft and scope of one of Ken Burns's expansive projects. Still, unless you are either a historian or a truly committed fan, you'll find yourself with way more material--particularly about the Beatles' early lives as lads in Liverpool--than you'll want toThe documentary material is copious, including early performance films and tapes, at the point before they found their true voices. The actual Beatlemania years--beginning in 1963 and concluding in 1970--feature extensive performance films, as well as home movies and archival material. The best parts, of course, are the interviews with the Beatles themselves, who produced the entire thing. Along with reworking two previously unreleased John Lennon tracks as &quot;new Beatles songs,&quot; the Anthology includes some unseen Lennon interview tapes so that his acerbic voice can be heard as well. This stands as a comprehensive document of that heady period, the second coming of rock &amp; roll, as the Beatles took what Elvis had started and expanded upon it exponentially. The tapes give a solid sense of the historical context and the way these four musicians changed the world around them in the 1960s.","torrent":{"xt":"urn:btih:1098604c67b76e31f1bb37c54b0df3635497b2dd","amp;dn":"The+Beatles+Anthology+Documentary+-+COMPLETE+5+DISC+SET","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1098604c67b76e31f1bb37c54b0df3635497b2dd","infoHashBuffer":{"type":"Buffer","data":[16,152,96,76,103,183,110,49,241,187,55,197,75,13,243,99,84,151,178,221]},"announce":[],"urlList":[]}}