{"title":"Mark Derr - How the Dog Became the Dog [96] 2011 - Unabridged","uid":7583373,"size":363989708,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:10e9bc08f0830c1084704cb39c509bbd4603f44c&amp;dn=Mark+Derr+-+How+the+Dog+Became+the+Dog+%5B96%5D+2011+-+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1346347240,"description":"Overview\nThat the dog evolved from the wolf is an accepted fact of evolution and history, but the question of how wolf became dog has remained a mystery, obscured by myth and legend. How the Dog Became the Dog posits that dog was an evolutionary inevitability in the nature of the wolf and its human soul mate. The natural temperament and social structure of humans and wolves are so similar that as soon as they met on the trail they recognized themselves in each other.\n\nHow the Dog Became the Dog adeptly and engrossingly examines this singular relationship. Combining the most recent scientific research with Mark Derr's original insights, this book shows that dogs made us human just as humans affected the evolution of dogs.\n\nKirkus Reviews\nDerr (A Dog's History of America,2004, etc.) explores various scenarios on the road to the long, fruitful relationship between dogs and humans.\n\n&quot;Among the broader population of Pleistocene wolves and human were individuals who by virtue of extreme sociability and curiosity, or both, became best friends and compatriots after encountering each other on the trail,&quot; writes the author in this rangy, critically stimulating and warm book. Derr begins with an overview of behavioral and biological experiments and models and theories, which becomes a dirge-like march, perhaps because readers know that he is going to pick many of them apart. So much new information comes in daily regarding dog studies that the ground is always shaky. But there are a number of ideas, backed by research and evidence, which Derr unfolds in a quietly stirring manner. The first is that wolves and humans were drawn together by their mutual sociability and curiosity, and that they stayed together thanks to mutual utility. All evidence places the first dogs at the camps of hunters, so the old notion that humans and dogwolves first made acquaintance around the local dumpster can be laid to rest. &quot;Rather it was an animal capable of forming an active friendship with a creature from another species,&quot; and, absent proof otherwise, likely consensual, in response to the needs and desires of both. Indeed, being able to manage anger and fear, control assertiveness and restraint and moderate one's appetite is more wolf than primate behavior. Derr also provides a striking geographical analysis of mixing grounds (&quot;a biological and a cultural process involving two highly mobile species&quot;) and enjoyable illustrative scenarios as he imagines specific events taking place.\n\nA transporting slice of dog/wolf thinking that will pique the interest of anyone with a dog in their orbit.\n\nMeet the Author\nMark Derr is the author of Dog's Best Friend and A Dog's History of America, coming soon from Overlook He has appeared regularly on The Charlie Rose Show, and in documentaries for A&amp;E and the Discovery Channel. He writes regularly for Atlantic Monthly, Natural History, Smithsonian and The New York Times. He lives in Miami Beach, Florida.","torrent":{"xt":"urn:btih:10e9bc08f0830c1084704cb39c509bbd4603f44c","amp;dn":"Mark+Derr+-+How+the+Dog+Became+the+Dog+%5B96%5D+2011+-+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10e9bc08f0830c1084704cb39c509bbd4603f44c","infoHashBuffer":{"type":"Buffer","data":[16,233,188,8,240,131,12,16,132,112,76,179,156,80,155,189,70,3,244,76]},"announce":[],"urlList":[]}}