{"title":"XPS Annotator","uid":7484668,"size":491111,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:12f55e9ba0d5499edfcc33f34430384bc4f67661&amp;dn=XPS+Annotator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sonnie460","files":2,"time":1343542147,"description":"XPS files, where XPS stands for XML Paper Specification, define the layout, printing specifications, and other factors about a document. They're similar to PDFs, but are based on XML. Windows has a built-in XPS Viewer that opens automatically when you click an XPS file, but it's pretty basic. XPS Annotator is a free, full-featured, standalone XPS file viewer, document annotator, XPS-to-image converter, properties adder and editor, and digital document signing tool. It has familiar operations such as zoom, search, save, copy, and print to a variety of output options. It supports hyperlinks, too.\n\nXPS Annotator is a compact program that has several installation options, including a totally portable installation, but we chose to run the Windows-style setup wizard. The program's interface is very clean and simple, with a blank document window and simple file menus and control icons for printing, copying, and zooming in and out on documents, as well as set page layouts. We navigated to an XPS file and selected it. A thumbnail preview of the file appeared in the right half of the Open File dialog, a useful touch. We opened the file in XPS Annotator, which displayed it in the main view. We clicked Signatures, and a properties dialog for signing documents opened. We entered our data in the appropriate fields, clicked Sign, and then clicked Done. We then reopened Signatures and edited the one we'd created, changing several entries, and saved it. Next we clicked Properties, and a Properties Dialog template opened with blank fields. We entered our document data and clicked OK. We closed the document, returned to the desktop, and opened the document in the built-in Windows XPS Viewer, which correctly identified the new digital signature. We clicked Properties, and the properties dialog we'd just created appeared. We also tried the Permissions and Request Signatures functions, which worked as advertised.\n\nThis free tool does much more than the native Windows utility, but it's just as easy to use. XPS Annotator is recommended to anyone who handles XPS documents.\n\n\nRead more: XPS Annotator - CNEThttp://download.cnet.com/XPS-Annotator/3000-10743_4-10912169.html#ixzz21tnKlKkz\n\nscreenshot: http://bayimg.com/AAaBHAAEh","torrent":{"xt":"urn:btih:12f55e9ba0d5499edfcc33f34430384bc4f67661","amp;dn":"XPS+Annotator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12f55e9ba0d5499edfcc33f34430384bc4f67661","infoHashBuffer":{"type":"Buffer","data":[18,245,94,155,160,213,73,158,223,204,51,243,68,48,56,75,196,246,118,97]},"announce":[],"urlList":[]}}