{"title":"The Expendables 2 Videogame Update 1-SKIDROW","uid":7571003,"size":20971068,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:13a53a8255a493d3b099f32e754740dad7312cb7&amp;dn=The+Expendables+2+Videogame+Update+1-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Gh0stNet","files":7,"time":1345991013,"description":"The.Expendables.2.Videogame.Update.1-SKIDROW\n\nGeneral Information\n\nThe Expendables 2 Videogame Update 1\n27-08-2012......Release Date\nProtection.................Steam\nAction.............Game Type\nDisk(s)......................DOX\n\nDescription\n\nFour Expendables (Barney, Gunner, Caesar and Yin Yang) are hired to rescue an extremely valuable kidnapped Chinese billionaire. It's business as usual until all hell breaks loose and the explosive mix of testosterone and kerosene detonates. The result is a massive fireball that never lets up, with the relentless action concluding where the new movie begins. The Expendables 2 videogame is a way for fans to experience all of their favourite explosive moments, as their favourite stars, in four-player co-op action\n\nFeatures\n\n* Over-The-Top Action - Experience intense firepower, huge explosions and relentless opposition\nas you play out all of your favorite over-the-top action moments from The Expendables movies\n* Four-Player Co-Op - Team up with three of your friends for Expendables co-op action. Take\non the singleplayer campaign or compete in the many challenge modes and work together to join the elite ranks\n* Expendables Characters - Play as some of the most memorable characters from The Expendables movies: Barney Ross, Yin Yang, Gunner Jensen and Hale Caesar\n* Challenge Modes - Challenge yourself, your buddies or the rest of the worldwide leaderboards in the many Expendables challenge modes that unlock as you play through the intense campaign\n* Vehicular Combat - Take it to the enemy as you fly choppers &amp; airplanes, drive 4x4s and wreak havoc with your entire vehicular arsenal\n* Signature Cinematic Kills - Experience some of the most stylish finishes ever thanks to the unique signature moves for each character. Relive your victories with the close-up dynamic camera capturing all your best moments\n* Battle in Foreign Terrain - Battle in tactical, assault, stealth and melee missions in a great variety of environments, from the forests of the Balkan countryside to mountainous Somalian deserts, Kowloon industrial docks and Burmese jungles\n\nInstallation\n\n1. Unpack release\n2. Run The.Expendables.2.Videogame.Update.1.exe\n3. Install\n4. Copy the cracked content from the SKIDROW folder to the main install folder and overwrite\n5. Play the game\n6. Support the companies, which software you actually enjoy!\n\nRelease Notes\n\nRead changelog.txt for information on updated content! Use Launcher.exe, included with the cracked content, for setting the language of your choice. You don't need to have any of the previous updates installed, as this update is featuring all previous updated content\n","torrent":{"xt":"urn:btih:13a53a8255a493d3b099f32e754740dad7312cb7","amp;dn":"The+Expendables+2+Videogame+Update+1-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13a53a8255a493d3b099f32e754740dad7312cb7","infoHashBuffer":{"type":"Buffer","data":[19,165,58,130,85,164,147,211,176,153,243,46,117,71,64,218,215,49,44,183]},"announce":[],"urlList":[]}}