{"title":"Rachel's Dream","uid":7478112,"size":173106464,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1445fdf4a082bb3c35c836f23be544c510eb00ff&amp;dn=Rachel%27s+Dream&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"WWK3","files":1,"time":1343346632,"description":"Shown as part of Channel 4's Video Fantasies series, a selection of four innovative dramas deploying state-of-the-art visual and electronic effects. This was the only one of the four that had a futuristic basis. It was set perhaps a couple of decades ahead in a world being slowly drowned by technology, a world in which traffic jams are the norm instead of the exception, and where the people avoid getting caught in the rain for better reasons than simply not wanting to get wet. The Rachel of the title is the younger sister of an up-and-coming marketing executive who has just secured a contract with a wealthy but repulsive millionaire who is into toxic waste, which he stores in secret for large sums of money. Rachel finds that, through a large bank of video screens in her sister's apartment, her wishes can come true when she brings to life the image on an anti-pollution poster. This new friend helps her to make up her mind about her own future. The style of the production was fresh and colourful, the pace slow and moody for the most part, and it made for an interesting half-hour's viewing.","torrent":{"xt":"urn:btih:1445fdf4a082bb3c35c836f23be544c510eb00ff","amp;dn":"Rachel%27s+Dream","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1445fdf4a082bb3c35c836f23be544c510eb00ff","infoHashBuffer":{"type":"Buffer","data":[20,69,253,244,160,130,187,60,53,200,54,242,59,229,68,197,16,235,0,255]},"announce":[],"urlList":[]}}