{"title":"POtHS 3 - Bible - 83 - The Perfect Gift","uid":7474082,"size":2054873181,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:181bd8e002fa9c447db777703123bc361c671a53&amp;dn=POtHS+3+-+Bible+-+83+-+The+Perfect+Gift&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":59,"time":1343241558,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS 3 - Bible Movies - 83 - The Perfect Gift\n\nPOtHS says: Excellent again.\n\nDescription:\n\nReview:\nThis is a wonderful Christmas film that will encourage people to look at the real definition of Christmas and the reason we celebrate this time of the year. Like so many other Jefferson Moore movies, this one is truly enjoyable for the entire family. Max is a young girl who just happens to have a birthday on the same day that Jesus was born, but she does not like it. She also is not happy that her school assignment is to write about Christmas. As Jes helps Max with her essay, he also helps the community, her mother and the assistant minister see how important God's perfect gift to us was, the gift of love. It also takes a look at what is happening in the world today at this very special holiday season. That Christmas is a time for kindness and love, not gifts and shopping. And that people need to stand up for what they believe in and not let others that do not believe bully us in hiding the real reason we celebrate Christmas. We are proud to award The Perfect Gift the Dove Family-Approved Seal for all ages. --Donna Rolfe, The Dove Foundation\nProduct Description\n\nDescription:\nFrom the producers of 'The Perfect Stranger' and 'Clancy' comes a Christmas movie for the ages. 'THE PERFECT GIFT' is a heartwarming holiday tale of a spoiled schoolgirl (Christina Fougnie, 'Clancy'), her overworked executive mother, and a disillusioned young minister (Matt Wallace, 'Forrest Gump'), and how each learns a valuable lesson about Christmas from a friendly, but mysterious drifter named Jess (Jefferson Moore, 'The Perfect Stranger').\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\n","torrent":{"xt":"urn:btih:181bd8e002fa9c447db777703123bc361c671a53","amp;dn":"POtHS+3+-+Bible+-+83+-+The+Perfect+Gift","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"181bd8e002fa9c447db777703123bc361c671a53","infoHashBuffer":{"type":"Buffer","data":[24,27,216,224,2,250,156,68,125,183,119,112,49,35,188,54,28,103,26,83]},"announce":[],"urlList":[]}}