{"title":"Performance Auto And Sound - Fall 2012 By bobiras2009","uid":7610286,"size":92130141,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:183d9962a0cccad1292bb5e980217577346c4a2d&amp;dn=Performance+Auto+And+Sound+-+Fall+2012+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bobiras2009","files":-1,"time":1347045184,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nEnglish | PDF | 180 pages | 87.9 Mb\n\n\nPerformance Auto &amp; Sound (PAS) Magazine has been setting trends and covering the sport compact scene since its inception. From its humble beginnings to our current reign as having largest magazine page-count in the sport compact market, PAS continues to grow in readership and size every year. Performance Auto &amp; Sound Magazine has asserted itself as a staple in the automotive industry among the top three best-selling titles in the USA and as the number one selling enthusiast title in Canada for several years running. The formula is simple: steady expansion, calculated risks and giving enthusiasts the articles they want by our team of editorial gear heads. From reviews on the latest car audio and multimedia to the hottest performance parts being put to the test, we pride ourselves on bringing readers the best of the automotive aftermarket. We aim to deliver the best automotive coverage from tire-shredding Time Attack and Drift vehicles to over the top show cars and incredible audio installs. Couple all this with our relevant event coverage, behind the scenes tech articles, countless hard-hitting features and the result is the most comprehensive magazine on the market.\n\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:183d9962a0cccad1292bb5e980217577346c4a2d","amp;dn":"Performance+Auto+And+Sound+-+Fall+2012+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"183d9962a0cccad1292bb5e980217577346c4a2d","infoHashBuffer":{"type":"Buffer","data":[24,61,153,98,160,204,202,209,41,43,181,233,128,33,117,119,52,108,74,45]},"announce":[],"urlList":[]}}