{"title":"DreamManager_cowboy1966.epub","uid":7443857,"size":111229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:196c96f815b6086d2fa0f0e3a06cbcb4005665e1&amp;dn=DreamManager_cowboy1966.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cowboy1966","files":-1,"time":1342300123,"description":"Matthew Kelly, &quot;The Dream Manager&quot;\n\n\nISBN: 1401303706 | 2007 | EPUB/MOBI | 176 pages | 109 KB/117 KB\n\n\nA business parable about how companies can achieve remarkable results by helping their employees fulfill their dreams\n\n\nManaging people is difficult. With disengagement and turnover on the rise, many managers are scratching their heads wondering what to do. It's not that we dont dream of being great managers, it's just that we havent found a practical and efficient way to do it. Until now . . .\n\n\nThe fictional company in this remarkable book is grappling with real problems of high turnover and low morale -- so the managers begin to investigate what really drives the employees. What they discover is that the key to motivation isnt necessarily the promise of a bigger paycheck or title, but rather the fulfillment of crucial personal dreams. They also learned that people at every level need to be offered specific kinds of help and encouragement -- or our dreams will forever remain just dreams as we grow dissatisfied with our lives and jobs.\n\nBeginning with his important thought that a company can only become the-best-version-of-itself to the extent that its employees are becoming better-versions-of-themselves, Matthew Kelly explores the connection between the dreams we are chasing personally and the way we all engage at work. Tackling head-on the growing problem of employee disengagement, Kelly explores the dynamic collaboration that is unleashed when people work together to achieve company objectives and personal dreams.\n\nThe power of The Dream Manager is that simply becoming aware of the concept will change the way you manage and relate to people instantly and forever. What's your dream? \n\nPlease seed and share \n &lt;a href=&quot;\nhttp://imgur.com/tVLjK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgur.com/tVLjK&lt;/a&gt;","torrent":{"xt":"urn:btih:196c96f815b6086d2fa0f0e3a06cbcb4005665e1","amp;dn":"DreamManager_cowboy1966.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"196c96f815b6086d2fa0f0e3a06cbcb4005665e1","infoHashBuffer":{"type":"Buffer","data":[25,108,150,248,21,182,8,109,47,160,240,227,160,108,188,180,0,86,101,225]},"announce":[],"urlList":[]}}