{"title":"Brothers In Arms 2 FULL","uid":7590734,"size":5312834,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:198af2de3d1719a52051d3ea3a989bac2f63dcb6&amp;dn=Brothers+In+Arms+2+FULL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"YahSoft","files":-1,"time":1346532725,"description":"In these battlefields, soldiers become heroes.\n\n\nFREE THROWS\nDownload the game and start playing for free in Story mode or Multiplayer. Wins ID Cards and XP as you play that can be used to unlock tons of extra features and gear to customize your soldier. Alternatively, in order to get purchase Medals to unlock them faster. It's you!\n\nTO JOIN YOUR ALLIES ONLINE\nChallenge up to 5 friends to multiplayer battles on five maps and 3 different modes (Free For All, Fight to the Death and Domain). You can connect locally via Bluetooth or even go online using Wi-Fi to battle against friends anywhere.\nA FIGHTING GLOBAL\nLive each front war with 50 missions to unlock in 5 locations: the Pacific, Normandy, North Africa, Germany and Sicily.\n\nWAR MACHINES\nControls 3 different vehicles including the tank, a vehicle all-terrain or a glider, to defeat your opponents or a daring escape. You can even occupy the tower artillery vehicle to destroy your enemies with the machine gun.\n\nBATTLE GETS LIFE\nThe splendid graphics and authentic settings are inspired by real battlefields from WWII and created in detailed 3D were.\n\nAN EPIC EXPERIENCE\nWitness captivating sequences &quot;cutscene&quot; with more interaction between you and members of your team, thus developing the game.\n\nAN ARSENAL TO YOUR DISPOSAL\nUses a wide variety of historically accurate weapons including machine guns, bazookas, assault rifles and flamethrowers.","torrent":{"xt":"urn:btih:198af2de3d1719a52051d3ea3a989bac2f63dcb6","amp;dn":"Brothers+In+Arms+2+FULL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"198af2de3d1719a52051d3ea3a989bac2f63dcb6","infoHashBuffer":{"type":"Buffer","data":[25,138,242,222,61,23,25,165,32,81,211,234,58,152,155,172,47,99,220,182]},"announce":[],"urlList":[]}}