{"title":"Appriority 1.1.6","uid":7520148,"size":6403102,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:1afc4f59995b838203ba8ea39df9842edf06612b&amp;dn=Appriority+1.1.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"openarena","files":-1,"time":1344596467,"description":"Appriority is an easy-to-use tool for Mac OS X that simply makes the app you're working in go faster by allowing you to optimize the CPU load on your computer. Once fully configured, Appriority works by suspending and resuming applications as you switch among them. Inactive applications can be set for suspension which will eliminate their CPU usage until you switch back to them. The benefits of this are improved performance in the application you currently have active, less battery power used while mobile, and less heat produced by your computer.\n\nThe Free Market edition of Appriority also uses the renice command to put the highest priority on the active application you are currently working in. Open applications that are inactive will automatically be reniced to a lower priority. Renicing is done automatically as you switch among your open applications. (This feature is not available in the Mac App Store edition).\n\nAppriority tells you what applications are using the most cpu resources and makes it easy to bring their usage to a halt. It reports your average CPU load and more.\n\nAppriority is designed to be easy to use and makes no permanent changes to your system. Simply launch it to turn it on, and quit it to return all of your applications to normal. \n\nWhat's New\nVersion 1.1.6:\n\nCodesigned for Gatekeeper\nImproves auto configuration for new users.\nFixes reported issues with Tiger systems.\nThis release makes minor optimizations and improvements.\nRequirements: Universal Binary requires OS X 10.4 - 10.7.2","torrent":{"xt":"urn:btih:1afc4f59995b838203ba8ea39df9842edf06612b","amp;dn":"Appriority+1.1.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1afc4f59995b838203ba8ea39df9842edf06612b","infoHashBuffer":{"type":"Buffer","data":[26,252,79,89,153,91,131,130,3,186,142,163,157,249,132,46,223,6,97,43]},"announce":[],"urlList":[]}}