{"title":"Ad Muncher 4.93.33707 Final","uid":7480376,"size":595186,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1b6f9b8a76ff150ef2f88b5098897c02f73d1855&amp;dn=Ad+Muncher+4.93.33707+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nikita200","files":-1,"time":1343417113,"description":"Ad Muncher is designed to work immediately after installing. You won't need to spend days setting up filters, and can enjoy faster and safer browsing immediately. Don't let your ad blocker decide which browser you're allowed to use, use whichever you prefer with Ad Muncher! Ad Muncher blocks many nasties on the net, such as scripts that track your browsing habits or try to install spyware, adware and dialers.\n\nWhat makes Ad Muncher the ultimate ad blocker?\n- Blocks ads in all browsers, including Internet Explorer, Firefox, Opera, Google Chrome, Safari, Flock, Netscape, Maxthon and Avant Browser.\n- Kills unwanted popups in all browsers.\n- Removes advertising in programs like Pando, SopCast, ICQ, Morpheus, Kazaa, PalTalk, iMesh, Bearshare, LimeWire, Yahoo! Music Jukebox, TVAnts and more.\n- Speeds up page loading and saves bandwidth, thanks to the missing ads and pop up windows.\n- Works immediately out of the box, thanks to the most extensive ad blocking list available.\n- Filters quickly and reliably, thanks to ten years of constant development and feedback from users.\n- Protects your privacy by blocking common third-party tracking systems.\n- Blocks rich media advertising like video ads, interstitial ads and floating ads.\n- Blocks many spyware, adware and dialer installers.\n\nHome Page: http://www.admuncher.com/\n\n","torrent":{"xt":"urn:btih:1b6f9b8a76ff150ef2f88b5098897c02f73d1855","amp;dn":"Ad+Muncher+4.93.33707+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b6f9b8a76ff150ef2f88b5098897c02f73d1855","infoHashBuffer":{"type":"Buffer","data":[27,111,155,138,118,255,21,14,242,248,139,80,152,137,124,2,247,61,24,85]},"announce":[],"urlList":[]}}