{"title":"Nyan Cat: Lost In Space 3.0 (Mac App Store)","uid":7430064,"size":28980528,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:1de0bf495a9a9bb085c89928504b9bb6bf2760f4&amp;dn=Nyan+Cat%3A+Lost+In+Space+3.0+%28Mac+App+Store%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"openarena","files":-1,"time":1341917105,"description":"\nNyan Cat: Lost In Space 3.0 (MAS)\n\n\nDescription\n\nWARNING! The Nyan Cat game and music are seriously addictive! Play with Nyan Cat only at your own risk!\n\niTunes reviews (USA and UK):\n&quot;Best, game, EVAR!&quot; - Jamiejdjdjdjdj\n&quot;This is the beat of the nyan cat games&quot; - Crazyboy4826\n&quot;This game is pro!&quot; - Oseycyhycyg\n&quot;I can't stop playing this Nyantastic game&quot; - Rossw123\n&quot;cute game thats fun to play! love the art style &amp; glad it's universal! dont like cats, but i DO love this game!&quot; - Starscream1017\n\nFeatures for humans:\n-powerups (magnet, ...)\n-achievements\n-score multipliers\n-two playable character: NYAN CAT and TAC NAYN\n-different forms of NYAN CAT (Supernyan, ...) and TAC NAYN\n-beautiful pixel art\n\n\nWhat's New in Version 3.0\n\n-two new gorgeous background themes and skin packs: Bunny and Western. NYAN CAT never looked so coool\n-NYAN CAT's messages are slightly changed\n-Valentine's Day Skin and Background Theme Pack (2 in 1)\n-get score for distance covered!\n-color milk bottle combos! 3 special milk bottles: red, blue and green. Collect 3 green bottles for the Green Gem! Find all possible combinations for other extras!\n-magnet bug and OS X 10.7 crash bug fixed\n\nBLACK HOLE: Collect the BLUE-GREEN-BLUE milk bottle combo to activate the black hole. Click on Nyan Cat's body to make him attract all items for a few seconds (even power-ups!)\n\nROCKET JUMP: You can use it similar to Black Hole, but you need to get the BLUE-GREEN-RED milk bottle combo. Activate it to make Nyan Cat rise for a short time. Can be a life-saver!\n\nNow you can exceed the 2 billion points hi-score cap\nJumper platforms have changed: walk over for a small jump or jump on for a super jump.\nNYAN CAT now has a slightly larger vocabulary\n\nNYAN SHOP:\nGet more Magnet and Gold Nyan power ups!\n\nUnfortunatley TAC NAYN has been quite busy as well and he has come forth with 2 new power ups:\nghost platforms: platforms are sometimes visible and sometimes they aren't...\nanti magnet: you repel milk and cookies\n\n-new platform type: every time you hit Golden Platform, you get more and more scores\n-new powerup item: reggae cat - everything is soooo slooow\n-a bunch of small improvements!","torrent":{"xt":"urn:btih:1de0bf495a9a9bb085c89928504b9bb6bf2760f4","amp;dn":"Nyan+Cat%3A+Lost+In+Space+3.0+%28Mac+App+Store%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1de0bf495a9a9bb085c89928504b9bb6bf2760f4","infoHashBuffer":{"type":"Buffer","data":[29,224,191,73,90,154,155,176,133,200,153,40,80,75,155,182,191,39,96,244]},"announce":[],"urlList":[]}}