{"title":"Demolition Inc. HD v25.68490 Final+ SD Data bobiras2009","uid":7493702,"size":225548678,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:1e822605040898b783bc524137c17371bb0ae5be&amp;dn=Demolition+Inc.+HD+v25.68490+Final%2B+SD+Data+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1343820936,"description":"DEMOLITION, INC. is a new action strategy game: Assume the role of the daring demolition worker Mike and start a devastating chain reaction on earth. Use cool tools and weapons and expand your destructive powers!\n\nYou navigate Mike's UFO over the cities of Earth and unfold complete chaos with your tools and weapons: Cars which drive into tower blocks and make them collapse; high-rises which fall onto other high-rises, exploding cows which make whole streets of houses come tumbling down!\n\nDEMOLITION, INC. is 100% physics technology: nothing is predetermined, and nothing is pre-animated. Your actions alone decide what happens and what you see!\n\nBecause of this, every time you play will be a unique experience and you won't get enough from those explosive chain reactions you make by yourself.\n\nFeatures:\n\n    Ground-breaking technology - Car and building physics is fully simulated. Everything is destructible and nothing is pre-animated. No game round is like another.\n    Combining action and strategy - Use the endless possibilities of combining your tools and weapons to make devastating chain reactions. Only this way can you manage to tear down whole cities!\n    Tools and Weapons - Use you tractor beam to take control of cars, place anti-gravity ramps to maximize damage, use the huge wrecking ball to clear your path.\n    Improve your skills on the way and unlock breathtaking and crazy new tools and weapons!\n    Exciting levels - 6 cities and 27 districts are waiting to be demolished by you and led to their fate!\n    Campaign mode - Fulfill your mission and destroy one city after another. By cunning use of your tools and weapons you will turn district after district into rubble!\n    Rampage mode - Limitless destruction. Unleash mayhem with all your tools and weapons you have unlocked. The level is your playground and you experience new breathtaking scenes of destruction over and over again.\n\nWhat's in this version: (Updated : Jul 27, 2012)\n\n    Fixed a crash that occurred sometimes while loading.\n\nRequired Android O/S : 2.3+\n","torrent":{"xt":"urn:btih:1e822605040898b783bc524137c17371bb0ae5be","amp;dn":"Demolition+Inc.+HD+v25.68490+Final%2B+SD+Data+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e822605040898b783bc524137c17371bb0ae5be","infoHashBuffer":{"type":"Buffer","data":[30,130,38,5,4,8,152,183,131,188,82,65,55,193,115,113,187,10,229,190]},"announce":[],"urlList":[]}}