{"title":"Sexually Broken------Innocent girl next door Mia Gold  Matt Will","uid":7517644,"size":824015878,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:1efe20e2f020698c16839c808b316fd8b939a285&amp;dn=Sexually+Broken------Innocent+girl+next+door+Mia+Gold++Matt+Will&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1344523736,"description":"Innocent girl next door turn into a bondage slut | Mia Gold | Matt Williams\n\nAugust 8, 2012 \n \n   \nMP4 + Pics.  \n    \n \nWelcome the sexy Mia Gold to Sexually Broken. She is relatively new to the industry, and we get to watch her explore things for the very first time. This cute girl next door looks so innocent and cute on the outside, but inside she is a borderline nymphomaniac that is just finding out hardcore bondage hits the right buttons for her. She will never be the same again after we are done with her.\n\nThe most important thing we do here at Sexually Broken is not letting the models &quot;act&quot;. We instruct them to be themselves, not their &quot;porn selves&quot;; their REAL selves. All the reactions, orgasms, moans and and screams are real, nothing is ever faked like you see at other BDSM sites.\n\nMia is an enigma. You look at her and you see the innocent girl next door. However looks can and always will be deceiving. Once we instruct Mia to just be herself, and not to &quot;act&quot; in any preconceived way, we are shocked by how sexually bold she really is. \n\nWe bind her expertly to a heavy wooden pole with her arms stretched out, hood her, and put on her knees. Dressed in a sexy leather mini dress she walked right off the plane in, we notice quickly she didn't even have panties on. Her sexy shaved pussy can be seen peeking out from the bottom of her short dress. She waits in total darkness, completely clueless about what will happen to her next. \n\nThe hood is ripped off and a hard cock is jammed down the back of her throat. A brutal skull fucking ensues, and Mia handles it like a pro and craves more. We quickly find out the real Mia is a complete cock whore. No matter how hard we fuck her she takes it, and wants it harder. After using her throat like a wet pussy we vibrate our whore to her first orgasm. One is not enough for this slut, but we don't care. The cock goes back down her throat until we break her a bit. The brutal face fucking cracks the armor and she is beginning to feel what being totalyl helpless is like for the first time in her life. \n\nWe bind her legs to the pole and suspend her off the ground. Her legs open so wide, her pussy so wet and puffy it is begging for cock. We simple slide our cock all the way deep into her wet pussy and there is nothing she can do to prevent us. She is simply a fuck toy, to use as we see fit. Mia gets fucked to multiple orgasms, then vibrated to several more. The bitch is cum drunk, deep into subspace. She wants more, but we leave her craving and begging, as all girls should be left... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_08mia/SexuallyBroken-Mia-Gold-Matt-Williams-Innocent-girl-next-door-turn-into-a-bondage%20slut.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_08mia/SexuallyBroken-Mia-Gold-Matt-Williams-Innocent-girl-next-door-turn-into-a-bondage%20slut.php&lt;/a&gt;\n\nAnd if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\nCheers  :-) \n\n","torrent":{"xt":"urn:btih:1efe20e2f020698c16839c808b316fd8b939a285","amp;dn":"Sexually+Broken------Innocent+girl+next+door+Mia+Gold++Matt+Will","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1efe20e2f020698c16839c808b316fd8b939a285","infoHashBuffer":{"type":"Buffer","data":[30,254,32,226,240,32,105,140,22,131,156,128,139,49,111,216,185,57,162,133]},"announce":[],"urlList":[]}}