{"title":"Lockerbie: Case Closed  2012  02  AJ","uid":7487690,"size":181405987,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1fb59703d5f32730959b2af80f294038dfae7e0b&amp;dn=Lockerbie%3A+Case+Closed++2012++02++AJ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"john1942","files":1,"time":1343646076,"description":"Lockerbie: Case Closed  2012  02  AJ\n\n173mb/47mns/mp4\n\n\nWas Abdel Baset al-Megrahi wrongly convicted of being responsible for the 1988 Lockerbie bombing?\n\nWednesday, December 21, 1988 was the longest night of the year, the night of the winter solstice. At 6.30pm that evening Pan Am Flight 103 took off from London Heathrow airport en route to JFK New York. On board Clipper Maid of the Skies, as it was called, were 16 crew members and 243 passengers, many of whom were carrying Christmas gifts in their luggage for family and friends.\n\nBut also in the baggage hold was a brown Samsonite suitcase, packed with new clothes and a Toshiba radio cassette player. Investigators later determined that hidden in the Toshiba were some 450 grammes of high explosive and an electronic timer. \n\nAt 7.03pm as the plane was 31,000 feet over Scotland, the device exploded. A little under a minute later, 200,000 pounds of Kerosene ignited as the wings and part of the fuselage fell onto the small Scottish town of Lockerbie. All on board were killed; so too were 11 residents of Lockerbie - 270 innocent people murdered by a terrorist bomb.\n\nTwenty-three years later, the scene changes to a small house on the outskirts of Tripoli in Libya, where the only man found guilty of causing those events lies helpless in bed. Abdel Baset al-Megrahi, whom the world knows as the Lockerbie bomber, is dying of prostate cancer. \n\n\nFor the first, last and only time he is about to give a television interview about his case - and he is to tell Al Jazeera that new evidence will prove that he was wrongly convicted. \n\nThe Lockerbie disaster was Europe's worst terrorist outrage - more civilians died than in any other attack before 9/11. It has also become the most infamous. The events of that night, the painstaking police forensic investigation that followed, the identification of al-Megrahi and Libya as the likely culprits, his eventual trial and conviction in Holland, the overwhelming sense of relief that justice had been done felt by many relatives of the victims, and the controversy surrounding his subsequent return to Libya on compassionate grounds - all of these things have been the subject of intense scrutiny over the years.\n\nAs has been the growing concern, felt by some, that al-Megrahi may have been wrongly accused. \n\nThis film, Lockerbie: Case Closed, will give hope to all those who believe that the Libyan is an innocent man and not the mass murderer that the prosecution claimed at his trial.\n\n &quot;The Lockerbie disaster was Europe's worst terrorist attack. More Americans died in that attack than in any other terrorist event before 9/11. It's also Britain's worst miscarriage of justice, the wrong man was convicted and the real killers are still out there.&quot;\n &lt;a href=&quot;\nhttp://www.aljazeera.com/programmes/2012/02/20122286572242641.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.aljazeera.com/programmes/2012/02/20122286572242641.html&lt;/a&gt;\n\nshunster","torrent":{"xt":"urn:btih:1fb59703d5f32730959b2af80f294038dfae7e0b","amp;dn":"Lockerbie%3A+Case+Closed++2012++02++AJ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fb59703d5f32730959b2af80f294038dfae7e0b","infoHashBuffer":{"type":"Buffer","data":[31,181,151,3,213,243,39,48,149,155,42,248,15,41,64,56,223,174,126,11]},"announce":[],"urlList":[]}}