{"title":"Kink.com The upperfloor------UF-17886  Dylan, Mickey Mod, Bobby","uid":7092010,"size":854708494,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1fca98a987ac1613059a6c2270b81f8e61447811&amp;dn=Kink.com+The+upperfloor%5C------UF-17886++Dylan%2C+Mickey+Mod%2C+Bobby&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1331397380,"description":"From Kink.com   ( The Upperfloor )    + Pics\n\nKink.com The upperfloorUF-17886  Dylan, Mickey Mod, Bobby Bends, Krysta Kaos and Odile\n\nHouse slaves kaos and tramp are both known for their exceptional slut skills, both in squirting and insatiable sexual appetites. However, neither has put their skills to the test and the House decides its time to take their pussies to the limit. Both slaves are presented with a collection of gigantic toys and make a show of shoving gigantic plastic cocks in their holes. The guests all cheer them on as the slaves work to impress and ultimately win a fuck with the biggest cocks in the crowd, Bobby Bends and Mickey Mod. \n\nThe winner is allowed to savor, enjoy, and please herself with the gentlemans cocks, while the loser is brutally whipped, berated, and punished with a rough fucking and denial of cum. \n\nMeanwhile our bartender and slave o is distracted and fucked behind the bar while a mean spirited female guest pours ice on her bouncing tits. Eden Alexander has a new female playmate and puts her in her place with a solid flogging and humiliation. Alpha and Nerine play out an intense scene with omega, reducing the shy blond to tears with mind fucking and a cattle prod. Jack Hammer places beautiful Alice in a restrictive suspension while our new favorite slut Simon pleases her Master on the couch with a skillful blowjob. \n\n\nScreens &lt;a href=&quot; http://www.theupperfloor.com/site/shoot.jsp?shootId=17886&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.theupperfloor.com/site/shoot.jsp?shootId=17886&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:1fca98a987ac1613059a6c2270b81f8e61447811","amp;dn":"Kink.com+The+upperfloor%5C------UF-17886++Dylan%2C+Mickey+Mod%2C+Bobby","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fca98a987ac1613059a6c2270b81f8e61447811","infoHashBuffer":{"type":"Buffer","data":[31,202,152,169,135,172,22,19,5,154,108,34,112,184,31,142,97,68,120,17]},"announce":[],"urlList":[]}}