{"title":"Sticky.Password.PRO.v6.0.3.368.Cracked-MESMERiZE","uid":7484979,"size":19725967,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:230cf7604a4f0c48d65c184327fcacbfc359738e&amp;dn=Sticky.Password.PRO.v6.0.3.368.Cracked-MESMERiZE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"reinstallation","files":-1,"time":1343554315,"description":"Description:\n\nSticky Password - a unique program that integrates the system remembers and automatically enters the user IDs and passwords to the field site, any program on your computer! Sticky Password oppose keylogeram and other spy program to try to capture your passwords. A password-protected powerful encryption algorithms, including AES / Rijndael with 256 to date, most reliable.\n\nSticky Password - the best solution for passwords!\n  No need to remember all those passwords\n  Keep your personal data safe!\n  Automatic Form Filling\n  Protection from phishing and keyloggers\n  Take your passwords with you wherever you sent\n\nMain features of Sticky Password:\n\n  Password Protector uses the latest technology and is opposed to keyloggers and other spyware. It informs the user about the attempts of computer programs and libraries to get information from other programs.\n  The portable version allows you to have passwords at your fingertips. Sticky Password can be run from any portable device - USB drive or a CD.\n  Open access to the passwords using USB or Bluetooth device. Now you do not need to enter your password.\n  Passwords are protected by powerful encryption algorithms that are impossible to crack within a reasonable time.\n  Automatic form filling work for all programs and web pages. Password, login and other fields are filled in automatically only when necessary.\n  You can save multiple passwords and logins for one account.\n  Easy to use: you can use and modify the stored information directly from the program that uses them.\n  Automatic backup of passwords database: modified or deleted passwords can be retrieved at any time.\n\nNew in v6.0.3.368:\n\n  Added support for German, French\n  Added support for Web browsers, Opera 12, Firefox / Thunderbird and Seamonkey 2.12 15\n  Added option to minimize the Sticky Password in the taskbar at startup\n  Added a context menu Cut / Copy / Paste / editor, etc., in personal notes\n  added the ability to pull accounts between the two groups\n  Simplified setup wizard when you first install\n  The icon will display the password generator password can now be locked to keep viewing the password.\n  Fixed duplicate hot keys for quick launch and windows locked\n  Fixed a problem with the button &quot;Like&quot; on Facebook\n  Improved support for auto-complete for many websites\n\nSystem requirements:\n\nWindows 2000/XP/Vista/7","torrent":{"xt":"urn:btih:230cf7604a4f0c48d65c184327fcacbfc359738e","amp;dn":"Sticky.Password.PRO.v6.0.3.368.Cracked-MESMERiZE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"230cf7604a4f0c48d65c184327fcacbfc359738e","infoHashBuffer":{"type":"Buffer","data":[35,12,247,96,74,79,12,72,214,92,24,67,39,252,172,191,195,89,115,142]},"announce":[],"urlList":[]}}