{"title":"Folx Pro 2.0.129","uid":7431472,"size":9517798,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:256753d599483042bb5df8ccbc2ceae68e0383a8&amp;dn=Folx+Pro+2.0.129&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"openarena","files":-1,"time":1341957945,"description":"Folx is an essential 2-in-1 download tool. It is easy-to-use, not overloaded with unnecessary features and at the same time it has everything you may need for fast and convenient downloading. All you need to do to download something is click the link in an Internet browser and Folx will start downloading for you. Not only you can download any files from the web, but also you can download torrent content from various torrent trackers.\n\nFolx is a free download manager for Mac OS X that is fast thanks to splitting downloads into threads; it also features auto resuming in case the download was interrupted for some reason. Folx will also make you forget about the mess in your download folder! You can assign a tag or several tags to each download task and easily find them whenever you need them even if they were downloaded long ago. You can also set the priority for each download task and control the download and upload speed with handy sliders.\n\nFolx is also available as PRO version. It brings such handy features as splitting the downloads in up to 10 threads which speeds up the download process; scheduling the download tasks up to your convenience; smart speed adjustment option (download speed will be adjusted automatically whenever you need to use Internet traffic in some other applications) and searching the web for torrents directly from Folx.\n\nWhat's New\nVersion 2.0.1029:\n\nNote: The 'Download Now' link above will download the Free version of Folx, while the 'Buy Now' link points to the Pro version.\n\nAdded: OS X 10.8 support\nImprovements for compatibility with OS X 10.7.4\n\nRequirements\nPPC / Intel, Mac OS X 10.4 or later","torrent":{"xt":"urn:btih:256753d599483042bb5df8ccbc2ceae68e0383a8","amp;dn":"Folx+Pro+2.0.129","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"256753d599483042bb5df8ccbc2ceae68e0383a8","infoHashBuffer":{"type":"Buffer","data":[37,103,83,213,153,72,48,66,187,93,248,204,188,44,234,230,142,3,131,168]},"announce":[],"urlList":[]}}