{"title":"Rhapsodies In Black - Music and Words from the Harlem Renaissanc","uid":7543332,"size":1033178254,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:259eb55d45aff5e890deff69876e1b78f0994c9d&amp;dn=Rhapsodies+In+Black+-+Music+and+Words+from+the+Harlem+Renaissanc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"rambam1776","files":-1,"time":1345280915,"description":"Harlem has captivated the imagination of writers, artists, intellectuals, and politicians around the world since the early decades of this century. Rhapsodies in Black: Art of the Harlem Renaissance examines the cultural reawakening of Harlem in the 1920s and 1930s as a key moment in twentieth-century art history, one that transcended regional and racial boundaries. Published to coincide with the exhibition that opens in England and travels to the United States, this catalog reflects the Harlem Renaissance's impressive range of art forms--literature, music, dance, theater, painting, sculpture, photography, film, and graphic design. The participants included not only artists based in New York, but also those from other parts of the United States, the Caribbean, and Europe.\n\nRichard J. Powell and David A. Bailey present selected works that focus on six themes: Representing &quot;The New Negro;&quot; Another Modernism; Blues, Jazz, and the Performative Paradigm; The Cult of the Primitive; Africa: Inheritance and Seizure; and Jacob Lawrence's Toussaint L'Ouverture series. The visual arts from 1919 to 1938 included in the book suggest the extraordinary vibrancy of the time when Harlem was a metaphor for modernity. In spite of the importance of the Harlem Renaissance to early twentieth-century American culture and to the artistic climate of &quot;Jazz Age&quot; Paris and Weimar Berlin, few art exhibitions have been devoted exclusively to the subject. Rhapsodies in Black will be welcomed for its unique presentation of this creative time.\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Rhapsodies-Black-Various-Artists/dp/B00004ZDZC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Rhapsodies-Black-Various-Artists/dp/B00004ZDZC&lt;/a&gt;","torrent":{"xt":"urn:btih:259eb55d45aff5e890deff69876e1b78f0994c9d","amp;dn":"Rhapsodies+In+Black+-+Music+and+Words+from+the+Harlem+Renaissanc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"259eb55d45aff5e890deff69876e1b78f0994c9d","infoHashBuffer":{"type":"Buffer","data":[37,158,181,93,69,175,245,232,144,222,255,105,135,110,27,120,240,153,76,157]},"announce":[],"urlList":[]}}