{"title":"The Ed Show 8-14-12.mp4","uid":7534157,"size":200321999,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:25cc016b8c23abc73a4bd331c9b509a014ae739c&amp;dn=The+Ed+Show+8-14-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1345046199,"description":"The Ed Show; August 14, 2012.\n\n84 days until the 2012 election and the Romney-Ryan lies about Medicare have turned into a full-on campaign push. Ed showed the official Republican playbook that instructs candidates to deceive voters by hiding behind their mothers' skirts.\n\nFormer health insurance executive Wendell Potter exposed the campaign of lies (http://leanforward.msnbc.com/_news/2012/08/14/13277101-wendell-potter-ryan-is-a-dream-come-true-for-health-insurance-industry read Potter's fascinating Lean Forward column Ryan is a 'dream come true' for health insurance industry) and Howard Fineman (The Huffington Post, MSNBC Political Analyst) weighed in on whether or not it will work.\n\nThen, Paul Ryan could have a big impact on some congressional races, but not in a way Republicans hoped. Ed talked with North Dakota Democratic Senate candidate Heidi Heitkamp (Former AG of ND).\n\nRighties are comparing Paul Ryan to President Reagan, but one of Reagan's budget architects said Ryan's budget doesn't compare. Ed looked at the numbers with David Cay Johnston (Pulitzer Prize-winning journalist and columnist for Reuters).\n\nRepublicans in Washington are comparing the Paul Ryan VP pick to &quot;the day the music died.&quot; Is the Romney-Ryan ticket a real loser? \nThe Big Panel; Joy Reid (thegrio.com), Susan Del Percio (Republican strategist), and Catherine Crier (attorney and author) weighed in that.\n\nPresident Obama officially let the dogs out, but the Romney camp is howling mad about the president's dog-on-the-roof jab.\n\nAnd in the Big Finish, the Romney campaign claimed Vice President Joe Biden used racially coded language in his newest attack on Mitt Romney. Michael Eric Dyson joined Ed to set the record straight. ","torrent":{"xt":"urn:btih:25cc016b8c23abc73a4bd331c9b509a014ae739c","amp;dn":"The+Ed+Show+8-14-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25cc016b8c23abc73a4bd331c9b509a014ae739c","infoHashBuffer":{"type":"Buffer","data":[37,204,1,107,140,35,171,199,58,75,211,49,201,181,9,160,20,174,115,156]},"announce":[],"urlList":[]}}