{"title":"POtHS - SIN-ister Secrets - 85 - Chemtrails  WHY in the World ar","uid":7603947,"size":3309876713,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:28cc6e414b26526206d98cfa549cce357216ef0c&amp;dn=POtHS+-+SIN-ister+Secrets+-+85+-+Chemtrails++WHY+in+the+World+ar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1346896192,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - SIN-ister Secrets - 85 - Chemtrails  WHY In The World Are They Spraying\n\n\n\n\n\n\n\nPOtHS Comment: Yes they are POISONING US. Just look up in the sky.\n\n\nDescription:\n\nChemtrails - WHY in the World are They Spraying:\n\nPeople around the world are noticing that our planet's weather is dramatically changing. They are also beginning to notice the long lingering trails left behind airplanes that have lead millions to accept the reality of chemtrail/geoengineering programs. Could there be a connection between the trails and our severe weather? While there are many agendas associated with these damaging programs, evidence is now abundant which proves that geoengineering can be used to control weather. In this documentary you will learn how the aerosols being sprayed into our sky are used in conjunction with other technologies to control our weather. While geoengineers maintain that their models are only for the mitigation of global warming, it is now clear that they can be used as a way to consolidate an enormous amount of both monetary and political power into the hands of a few by the leverage that weather control gives certain corporations over the Earth's natural systems. This of course, is being done at the expense of every living thing on the planet.\n\n\nWHAT in the World Are They Spraying? (part.1)\n\n\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:28cc6e414b26526206d98cfa549cce357216ef0c","amp;dn":"POtHS+-+SIN-ister+Secrets+-+85+-+Chemtrails++WHY+in+the+World+ar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28cc6e414b26526206d98cfa549cce357216ef0c","infoHashBuffer":{"type":"Buffer","data":[40,204,110,65,75,38,82,98,6,217,140,250,84,156,206,53,114,22,239,12]},"announce":[],"urlList":[]}}