{"title":"Gadget Boy &amp; Heather","uid":7538965,"size":3495081984,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:29636c6a370155c5e396e9b2029496de2635f7bd&amp;dn=Gadget+Boy+%26amp%3B+Heather&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"Warsun99","files":-1,"time":1345164127,"description":"Gadget Boy &amp; Heather (also known as Gadget Boy) was an animated television series from DiC Entertainment. The series debuted in 1995 in first-run syndication in the United States and on M6 in France.\n \nThis series is about &quot;Gadget Boy&quot;, a bionic kid-detective with a personality similar to that of Inspector Gadget. He was conceived as a bionic &quot;child&quot; with the personality of a &quot;perfect adult detective&quot; (although as with the aforementioned Inspector Gadget, he is anything but). Just as maladroit as the original Inspector Gadget, Gadget Boy was usually bailed out of situations by the more practical Heather, though he was also helped greatly by his myriad high-tech gadgets and extendable arms and legs. Gadget Boy's bionic implants were installed by Switzerland-based inventor Myron Dabble (Maurice LaMarche) who has an unrequited crush on Heather. Gadget Boy and Heather receive their assignments from Italy-based Chief Stromboli (Maurice LaMarche), who, much like Chief Quimby, is a frequent, long-suffering victim of Gadget Boy's bungling. Gadget Boy is assisted by the beautiful and resourceful agent Heather (Tara Charandoff), a very tall equivalent of sorts to Penny (the difference being that Heather is in her late teens or early 20s). He is also assisted by a robotic dog named G-9 (Maurice LaMarche), who serves as the &quot;Brain&quot; of this series, which shows through his morphing capabilities to get the gang out of the stickiest situations.\n \nThe main villain of this series, instead of Dr. Claw, is the mask-wearing six-armed villainess Spydra (Louise Vallance) who is accompanied by Boris, a frequently abused, wisecracking, sarcastic vulture with a Russian accent, along with her henchmen Mulch and his twin brother Houmous, all played by Maurice LaMarche.\n \nThe main title theme song was written and performed by Mike Piccirillo. Musical underscore composers were Mike Piccirillo and Jean-Michel Guirao.\n","torrent":{"xt":"urn:btih:29636c6a370155c5e396e9b2029496de2635f7bd","amp;dn":"Gadget+Boy+%26amp%3B+Heather","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29636c6a370155c5e396e9b2029496de2635f7bd","infoHashBuffer":{"type":"Buffer","data":[41,99,108,106,55,1,85,197,227,150,233,178,2,148,150,222,38,53,247,189]},"announce":[],"urlList":[]}}