{"title":"The Watch -Xvid.cam- GLOBE.avi","uid":7541377,"size":1189101384,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2a14088b984e66b9b39dc8949fd8b76740bb64a3&amp;dn=The+Watch+-Xvid.cam-+GLOBE.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1345225996,"description":"* XVID CAM  * 01H36M42S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Plot :\n\nIn the small town of Glenview, Ohio, Evan Trautwig (Ben Stiller) is an active participant in the community and the senior manager of the local Costco store. His life is disrupted when the store's night security guard is murdered. The local police have no leads and show no interest in investigating further. Determined to find the killer and bring him to justice, Evan decides to form a Neighborhood Watch. However, he only manages to recruit Bob (Vince Vaughn), a construction worker and loving father, Franklin (Jonah Hill), a high school dropout who dreams of being a police officer but failed the written, physical, and mental health tests, and Jamarcus (Richard Ayoade), a recent divorcee.\nThe Watch members use the group as an excuse to drink and have fun, much to Evan's annoyance. While driving on patrol they accidentally hit something. On investigation they discover a strange metallic orb that acts as a highly destructive weapon. The group deduces that it is of alien origin. Meanwhile, several more townspeople are mysteriously killed. The Watch responds to the murders and encounters an alien, which attacks them. Evan seemingly kills it with a lawn gnome before the group return with the creature to Bob's house. The creature regains consciousness and escapes, stealing the metallic orb and warning them that the aliens have already infiltrated the town. The Watch theorizes that the aliens are stealing their victims' skin and disguising themselves as humans, meaning that anybody in Glenview could be an alien. Bob confides to Evan that he is constantly worried about his daughter Chelsea (Erin Moriarty), and does not trust her boyfriend Jason (Nicholas Braun). Evan admits that he has been avoiding his wife Abby (Rosemarie DeWitt) because he is sterile, and afraid that revealing that to her will cause her to leave.\n\n\n\n\n* enjoy ...\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:2a14088b984e66b9b39dc8949fd8b76740bb64a3","amp;dn":"The+Watch+-Xvid.cam-+GLOBE.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a14088b984e66b9b39dc8949fd8b76740bb64a3","infoHashBuffer":{"type":"Buffer","data":[42,20,8,139,152,78,102,185,179,157,200,148,159,216,183,103,64,187,100,163]},"announce":[],"urlList":[]}}