{"title":"Hollywood Heights Season 1 E01-E10","uid":7561666,"size":3860364066,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2b1425e03f78ea08aca4c1c86164dae156da7805&amp;dn=Hollywood+Heights+Season+1+E01-E10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"RayCort","files":10,"time":1345756184,"description":"Summary: Nick at Nite adds sizzle to summer weeknights with the original primetime drama Hollywood Heights. The debut \n\nseries will encore every night at 9:00 p.m. (ET/PT) Monay through Friday. \n\nLoren (Brittany Underwood) a smart, shy and independent high school senior who has ambitions of being a songwriter and secretly sends her song lyrics to her celebrity crush, rock superstar Eddie Duran (Cody Longo). Loren's wildest dreams come true when she not only wins a songwriting competition sponsored by Eddie, but strikes up a friendship with her idol. Eddie sees beyond Loren's potential as a songwriter and gives her a first break as a singer, and when the truth about his less-than-faithful girlfriend Chloe (Melissa Ordway) is revealed, Eddie and Loren's friendship blossoms. \n\nCast:\n\nCody Longo ... Eddie Duran\n \nBrittany Underwood ... Loren Tate\n \nRobert Adamson ... Phil Sanders\n \nBrandon P Bell ... Jake Madsen (as Brandon Bell)\n \nAshley Holliday ... Melissa Sanders\n \nShannon Kane ... Traci Madsen\n \nBrian Letscher ... Gus Sanders\n \nGrayson McCouch ... Don Masters\n \nMelissa Ordway ... Chloe Carter\n \nMeredith Salenger ... Lisa Sanders\n\n\nHollywood Heights S01E01 (Meeting a Rockstar)\n\nAir Date: 11 Jun 2012\n\nSummary: Loren and Melissa talk their way into Eddie's concert, which is the final stop of his latest tour.\n\n\n\nHollywood Heights S01E02 (Loren Catches Eddie's Attention)\n\nAir Date: 19 Jun 2012\n\nSummary: Loren makes eye contact with Eddie while he's performing, and later she sends him a song lyric. Meanwhile, Chloe clears up some misunderstandings with Tyler.\n\n\n\nHollywood Heights S01E03 (Eddie's Songwriting Contest)\n\nAir Date: 20 Jun 2012\n\nSummary: Tyler and Eddie quarrel about the past. Elsewhere, Melissa encourages Loren to enter Eddie's songwriting contest.\n\n\n\nHollywood Heights S01E04 (Chloe's Secret)\n\nAir Date: 21 Jun 2012\n\nSummary: Melissa submits Loren's song into Eddie's contest. Elsewhere, Eddie almost finds out Chloe's secret.\n\n\n\nHollywood Heights S01E05 (Eddie Decides to Take he Next Step)\n\nAir Date: 22 Jun 2012\n\nSummary: Loren worries about her song entry, so Melissa and Nora work on lifting her spirits. Meanwhile, Eddie wants his \n\nrelationship with Chloe to progress to the next level.\n\n\n\nHollywood Heights S01E06 (Loren Makes the Top 25)\n\nAir Date: 25 Jun 2012\n\nSummary: Loren's song advances in the contest. Meanwhile, Chloe hides a damaging photo from the press; and Jake mentors Kelly.\n\n\n\nHollywood Heights S01E07 (Loren Has to Make a Decision)\n\nAir Date: 26 Jun 2012\n\nSummary: Loren's priorities shift after she's awarded a scholarship. Elsewhere, Eddie alludes to tying the knot while talking to the press.\n\n\nHollywood Heights S01E08 (Max Questions Chloe)\n\nAir Date: 27 Jun 2012\n\nSummary: Max grows distrustful of Chloe. Meanwhile, Tyler faces eviction; and Adriana uses Phil's help to cheat on an exam.\n\n\nHollywood Heights S01E09 (Loren Doesn't Make the Cut)\n\nAir Date: 28 Jun 2012\n\nSummary: Jake removes Loren's song from the list of finalists. Meanwhile, Loren plans to deliver her song to Eddie at the club opening.\n\n\n\nHollywood Heights S01E10 (Eddie Questions His Feelings)\n\nAir Date: 29 Jun 2012\n\nSummary: Loren's song-delivery plan gets derailed. Meanwhile, Eddie sees a shocking photo of Chloe.\n","torrent":{"xt":"urn:btih:2b1425e03f78ea08aca4c1c86164dae156da7805","amp;dn":"Hollywood+Heights+Season+1+E01-E10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b1425e03f78ea08aca4c1c86164dae156da7805","infoHashBuffer":{"type":"Buffer","data":[43,20,37,224,63,120,234,8,172,164,193,200,97,100,218,225,86,218,120,5]},"announce":[],"urlList":[]}}