{"title":"The Ed Show 8-23-12.mp4","uid":7563132,"size":178039550,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2d6d012fccc42d02ede59b6aba5e803276d71791&amp;dn=The+Ed+Show+8-23-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1345793274,"description":"The Ed Show; August 23, 2012.\n\nTodd Akin's political enemies and allies are getting louder. And Mitt Romney is now demanding the media stop asking him about the &quot;forcible rape&quot; controversy.\n\nEd Schultz dove into the GOP's &quot;no exception for rape&quot; abortion controversy with Cecile Richards (President of Planned Parenthood), and Karen Finney (MSNBC Political Analyst and Former DNC Communications Director).\n\nThen, brand new polling has proven Mitt Romney's Medicare lies aren't working. Ed broke down the new numbers with Howard Fineman (MSNBC News Political Analyst and Editorial Director of the Huffington Post Media Group).\n\nThe Obama campaign said it has the answer to stop Republicans from stealing Ohio. State Sen. Nina Turner (D-OH) and Jennifer Brunner (former Ohio Secretary of State), had analysis.\n\nMr. Self Deportation set his own goal for support among Latinos, but is coming up woefully short. Los Angeles mayor Antonio Villaraigosa joined Ed for that.\n\nMore drilling, less regulation. What could possibly go wrong with Mitt Romney's energy plan?\n\nAnd in the Big Finish, how did Mitt Romney get completely shut out among African American supporters in the latest NBC news poll? Larry Wilmore (Senior Black Correspondent at The Daily Show) will explain Mitt Romney's zero percent.","torrent":{"xt":"urn:btih:2d6d012fccc42d02ede59b6aba5e803276d71791","amp;dn":"The+Ed+Show+8-23-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d6d012fccc42d02ede59b6aba5e803276d71791","infoHashBuffer":{"type":"Buffer","data":[45,109,1,47,204,196,45,2,237,229,155,106,186,94,128,50,118,215,23,145]},"announce":[],"urlList":[]}}