{"title":"Windows 8 English - MSDN Untouched Part 3","uid":7593695,"size":23779335486,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2d79d942f86c87293582276f75e49ea6cb0f1599&amp;dn=Windows+8+English+-+MSDN+Untouched+Part+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"prathaprabhu","files":17,"time":1346624901,"description":"Windows 8 is the basic edition of Windows for the x86 and x86-64 architectures. This edition contains features aimed at the home market segment and provides all of the basic new, Windows 8 features including the Start screen with semantic zoom, live tiles, Windows Store, Internet Explorer 10, connected standby, Microsoft account integration, the Windows desktop, and more.\n\nWindows 8 Pro succeeds Windows 7 Professional and Ultimate and is targeted towards enthusiasts and business users; it includes all the features of Windows 8. Additional features include operating as a Remote Desktop server, the ability to participate in a Windows Server domain, Encrypting File System, Hyper-V, and Virtual Hard Disk Booting, Group Policy as well as BitLocker and BitLocker To Go. Windows Media Center functionality will be available only for Windows 8 Pro, as a free &quot;add-on.&quot;\n\nWindows 8 Enterprise provides all the features in Windows 8 Pro (except the ability to install the Windows Media Center add-on), with additional features to assist with IT organization (see table below). This edition is available to Software Assurance customers, as well as MSDN and Technet Professional subscribers, and was released on August 15, 2012.\n\nMicrosoft Windows 8 has the following editions:\n\nWindows 8\nWindows 8 N\nWindows 8 Pro\nWindows 8 Pro N\nWindows 8 Enterprise and Enterprise N\n\nApart from the above editions - UK gets its own version of English in Windows 8\n\nMicrosoft's Windows 8 operating system will have the U.K. version of English as a display language option, to address customers in that country, and some other countries like South Africa, India, Ireland, and Australia that use the version of the language.","torrent":{"xt":"urn:btih:2d79d942f86c87293582276f75e49ea6cb0f1599","amp;dn":"Windows+8+English+-+MSDN+Untouched+Part+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d79d942f86c87293582276f75e49ea6cb0f1599","infoHashBuffer":{"type":"Buffer","data":[45,121,217,66,248,108,135,41,53,130,39,111,117,228,158,166,203,15,21,153]},"announce":[],"urlList":[]}}