{"title":"Andrew_Lane_Young_Sherlock_Holmes_Ebooks_pdf","uid":7583051,"size":5545467,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31c062130533596c7f1c828231050136392cedef&amp;dn=Andrew_Lane_Young_Sherlock_Holmes_Ebooks_pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"akurox","files":5,"time":1346335309,"description":"Young Sherlock Holmes is a series of young adult Thriller novels by Andy Lane featuring Arthur Conan Doyle's detective Sherlock Holmes as a teenager in the 1860s that is faced with numerous crimes and adventures throughout the series.\n\nBooks in the series\n\nSo far there have been four books released in the series, with the fifth coming out in September 2012. There could potentially be nine in total.\n\nDeath Cloud (June 2010): Fourteen-year-old Sherlock Holmes is sent to live with his Aunt and Uncle in Hampshire and teams up with Matty Arnatt to investigate two mysterious deaths which appear to be somehow related to a black cloud which Sherlock Holmes has solve.\n\nRed Leech (November 2010): A few months after the events of the first novel, Holmes investigates the possibility that John Wilkes Booth is alive and well, and living in England. The investigation takes Sherlock to America with his tutor, Amyus Crowe.\n\nBlack Ice (June 2011): Mycroft invites Sherlock and his tutor to London for a visit, but when they arrive at the Diogenes Club they find Mycroft with a dagger in his hand and a dead body on the floor. The adventure takes them from the depths of the London sewers to the frozen Russian landscapes.\n\nFire Storm (November 2011): Fourteen-year-old Sherlock has come up against some challenges in his time, but what confronts him now is completely baffling. His tutor, Crowe, and Crowe's daughter, Virginia , have vanished. Their house looks as if nobody has ever lived there.","torrent":{"xt":"urn:btih:31c062130533596c7f1c828231050136392cedef","amp;dn":"Andrew_Lane_Young_Sherlock_Holmes_Ebooks_pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31c062130533596c7f1c828231050136392cedef","infoHashBuffer":{"type":"Buffer","data":[49,192,98,19,5,51,89,108,127,28,130,130,49,5,1,54,57,44,237,239]},"announce":[],"urlList":[]}}