{"title":"Ultimate Call Screen HD Pro Proper v7.0.2 Final By bobiras2009","uid":7607553,"size":1078019,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:33f9781dbcdb300034df1ff94a8a27e7bcf2f0df&amp;dn=Ultimate+Call+Screen+HD+Pro+Proper+v7.0.2+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bobiras2009","files":-1,"time":1346976443,"description":"                                 By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nUltimate Call Screen HD Free combines a Fullscreen Caller ID replacement, contact picture manager, call blocker, and, on top of that, sensor-base actions such as rejecting calls by turning the phone screen-down, and swipe gestures just to be sure you handle your phone any way you want to.\n\n    Set the &quot;Turn to reject&quot; feature: Turn the phone screen-down to reject an incoming call.\n\nPro Features:\n\n    Intercept and show SMS messages with fullscreen caller picture below. Fully themable SMS screen.\n    Option to make incoming SMS show above lockscreen, including turning the screen on\n    Dismiss or reply to sms directly from UCS SMS screen, with buttons or swipe gestures\n    Link your contacts to Facebook friends and use their HD profile pictures as call screen.\n    Setup UCS to use your current android contact picture as fullscreen caller ID.\n    Enable swipe gestures to answer, decline,or bring up your default phone interface\n    Use UCS themes to personalize your call screen even more! Different default themes for known and unknown contacts, as well as hiding callscreen elements.\n    Setup different themes for individual contacts\n    Activate the &quot;Turn to mute ring&quot; feature (if your hardware supports it).\n    Activate the &quot;Turn for loudspeaker&quot; feature (if your hardware supports it).\n    Activate the &quot;Block all incoming calls&quot; feature: every single call will be blocked.\n    Activate the &quot;Whitelist mode&quot;. This allows you to invert the blocking selection, and all contacts NOT marked for blocking will be blocked.\n    Activate the &quot;Block Unknown Callers&quot; feature.\n\nWhat's in this version : (Updated : Aug  29, 2012)\n\n    Redesigned User Interface\n    Added &quot;I Feel Lucky&quot; option to Facebook integration: attempt to automatch phone contacts to Facebook friends automatically (licensed only)\n    Added &quot;Sync As You Go&quot; option to Phone Syncer: automatically sync android internal pictures when you assign new ones in UCS\n    Fixed issue with auto-cropping to square aspect-ratio for internal phone syncing\n    Removed option to lock screen after missed call- it would only work on rooted and patched phones\n\nRequired Android O/S : 2.1+\n\n\n\n                                By bobiras2009","torrent":{"xt":"urn:btih:33f9781dbcdb300034df1ff94a8a27e7bcf2f0df","amp;dn":"Ultimate+Call+Screen+HD+Pro+Proper+v7.0.2+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33f9781dbcdb300034df1ff94a8a27e7bcf2f0df","infoHashBuffer":{"type":"Buffer","data":[51,249,120,29,188,219,48,0,52,223,31,249,74,138,39,231,188,242,240,223]},"announce":[],"urlList":[]}}