{"title":"White.Collar.Season.3.WEB-DL.480p.H264","uid":7490559,"size":2789093984,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:34206a1bba9e09f269d2dbfc94de8bdd4ae80384&amp;dn=White.Collar.Season.3.WEB-DL.480p.H264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"twentyforty","files":34,"time":1343727807,"description":"On Guard\nS3, Ep1\nJun. 7, 2011\nDespite successfully escaping after having robbed the Federal Reserve, a notorious thief returns to retrieve the stash he left behind. Peter and Neal must put their differences aside to capture the criminal before he disappears for good.\n\nWhere There's a Will\nS3, Ep2\nJun. 14, 2011\nPeter and Neal must follow a treasure map will to save a kidnapped daughter.\n\nDeadline\nS3, Ep3\nJun. 21, 2011\nDiana goes undercover to protect a magazine journalist; Peter and Neal investigate.\n\nDentist of Detroit\nS3, Ep4\nJun. 28, 2011\nWhen a mobster from Mozzie's Detroit childhood surfaces in Manhattan, Neal and Peter must help their friend rework a scam from his past to take down the ruthless gangster and prevent a mob war.\n\nVeiled Threat\nS3, Ep5\nJul. 5, 2011\n\n\nScott Free\nS3, Ep6\nJul. 12, 2011\nA talented teenage con artist wreaks havoc in Manhattan, and Neal must decide if he should help him or take him down.\n\nTaking Account\nS3, Ep7\nJul. 19, 2011\nA hacker empties a bank's accounts, so Neal assumes the thief's identity and goes on a spending spree in order to force the criminal to surface.\n\nAs You Were\nS3, Ep8\nJul. 26, 2011\nJones' classmate from the Naval Academy goes missing, prompting Peter and Neal to investigate an international private-security team, which could be linked to the disappearance.\n\nOn the Fence\nS3, Ep9\nAug. 2, 2011\n\nCountdown\nS3, Ep10\nAug. 9, 2011\nNeal and Mozzie must stay one step ahead of the the FBI while appearing to work with them in order to keep them from discovering that they possess the treasure.\n\nCheckmate\nS3, Ep11\nJan. 17, 2012\nPeter and Neal work together to save Elizabeth from Keller.\n\nUpper West Side Story\nS3, Ep12\nJan. 24, 2012\nWhen scholarship funds from a prestigious prep school mysteriously disappear, Neal poses as a substitute teacher to help Peter and the FBI figure out where the money is really going.\n\nNeighborhood Watch\nS3, Ep13\nJan. 17, 2012\n\nPulling Strings\nS3, Ep14\nFeb. 7, 2012\n\nStealing Home\nS3, Ep15\nFeb. 21, 2012\nWhen a wealthy Yankees fan recruits Neal to help steal a prized piece of memorabilia, Neal is reminded of what life could be like again as a high-end thief.\n\nJudgment Day\nS3, Ep16\nFeb. 28, 2012\nWhen Agent Kramer returns to derail Neal's commutation, Neal races to right a wrong from his past. Peter in turn must choose a side. Set against the backdrop of Neal's commutation hearing, Neal will ultimately decide between fight and flight.","torrent":{"xt":"urn:btih:34206a1bba9e09f269d2dbfc94de8bdd4ae80384","amp;dn":"White.Collar.Season.3.WEB-DL.480p.H264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34206a1bba9e09f269d2dbfc94de8bdd4ae80384","infoHashBuffer":{"type":"Buffer","data":[52,32,106,27,186,158,9,242,105,210,219,252,148,222,139,221,74,232,3,132]},"announce":[],"urlList":[]}}