{"title":"Bigasoft YouTube Downloader Pro v1.1.12.4605 [NepsterJay]","uid":7535044,"size":10056227,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3523f50170cf6fec12eca71dd6b60a43cb3be239&amp;dn=Bigasoft+YouTube+Downloader+Pro+v1.1.12.4605+%5BNepsterJay%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NepsterJay","files":1,"time":1345064019,"description":"Bigasoft YouTube Downloader - Boot video FaceBook, Google Video, Vimeo, Metacafe and other sites, batch download, introduction to the shell browser, configure the boot options, setting the parameters, setting up automatic shutdown laptop after downloading, high speed and quality, nice design and intuitive interface. \n\nBigasoft YouTube Downloader is the most workable and professional YouTube Downloader which lets you download YouTube videos instantly in HD (high-definition 720p, 1080p, and 2k), ultra high definition (4K), 3D video and stand definition with a single click. \n\nThe wonderful YouTube Downloader enables you to download multiple YouTube videos in batch simultaneously. Two download quality options are provided. You can choose to download the &quot;Best Available&quot; of a YouTube URL (usually in MP4 format) or to download the normal quality of a YouTube URL (usually in FLV format). \n\nBigasoft YouTube Downloader is more than a YouTube video downloader. It can download videos from almost all video sharing and video publishing websites like Facebook, Google Videos, Metacafe, eHow, Vimeo, MTV, BBC,etc. \n\nKey Features \nDownload YouTube Videos \nDownload YouTube videos in HD (high-definition 720p, 1080p, and 2k), ultra high definition (4K), 3D video and stand definition. \nAll in one online video downloader \nNot only can Bigasoft YouTube Downloader download videos from YouTube, it can download videos from allmost all popular video sharing and video publishing sites like Facebook, Google Videos, Metacafe, eHow, Vimeo, MTV, BBC,etc. \nDownload as best \nThe excellent YouTube Downloader allows to choose download quality. For example, if YouTube offers 1080p, 720p, 480p video playback, by choosing &quot;Best Available&quot;, HD 1080p video will be downloaded; \nDownload YouTube in MP4 \nA YouTube video may be stored in the format of MP4, FLV, WebM to meet different web browsers. Bigasoft YouTube Downloader enables you to always download YouTube video in MP4 (a much more versatile and compatible format across operating systems and which usually gives better video and audio quality). No worry for the playback support of downloaded YouTube videos. \nEasy to download \nThe considerate YouTube Downloader will automatically paste the copied URL of YouTube videos and will start download immediately after click the download button. \nBatch download \nSupport pasting multiple URLs and batch downloading multiple YouTube videos at a time. \nPause and resume downloading \nYou can pause and resume downloading at any time. It is very convenient to use. \nName downloaded file intelligently \nBigasoft YouTube Downloader will name the downloaded file intelligently by the title of the YouTube URL for easy finding. \nAfter done action \nIf you have lots of video to download, you can set to shut down computer or exit program, log off, hibernate or stand by after all the download tasks are finished. \nYouTube downloader for worldwide \nThe efficient YouTube downloader supports multi-language in English, German, French, Italian, Chinese, and Japanese now. \nYouTube Downloader for Windows 7 \nBigasoft YouTube Downloader is fully compatible with 64bit/32bit Windows 7, Windows XP, Windows Vista, and Windows 2000. \n\nWebpage: www.bigasoft.com \nLanguage: English\nPlatform: Windows 2000 / XP / vista / 7\n\n","torrent":{"xt":"urn:btih:3523f50170cf6fec12eca71dd6b60a43cb3be239","amp;dn":"Bigasoft+YouTube+Downloader+Pro+v1.1.12.4605+%5BNepsterJay%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3523f50170cf6fec12eca71dd6b60a43cb3be239","infoHashBuffer":{"type":"Buffer","data":[53,35,245,1,112,207,111,236,18,236,167,29,214,182,10,67,203,59,226,57]},"announce":[],"urlList":[]}}