{"title":"Aida64 Business Edition 2.60.2100+keys by Senzati.rar","uid":7558228,"size":14559188,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3670a12cf6104c04c46aca03fc811e4d12afe889&amp;dn=Aida64+Business+Edition+2.60.2100%2Bkeys+by+Senzati.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BySenzati","files":1,"time":1345675425,"description":"AIDA64 Business Edition is an essential Windows network management solution for small and medium scale enterprises. AIDA64 Business Edition provides a wide range of features to compile, manage, and analyse hardware and software inventory of corporate computer networks. Its capabilities cover local and remote system diagnosis, network monitoring, remote control, and license management. AIDA64 is compatible with all current 32-bit and 64-bit Microsoft Windows operating systems.\n\nAutomated network audit\n\nWith AIDA64 hardware and software information of networked computers can be collected via command-line automation. Details on each computer can be written into CSV or XML report files, or SQL database. Collected reports are processed by the AIDA64 Audit Manager, that can also produce network audit statistics and diagrams on hardware and software distribution.\n\nChange tracking and network alerting\n\nAIDA64 Change Manager detects and lists changes between network audit snapshots. Both hardware and software changes can be detected per user, per computer, or by date. AIDA64 real-time alerting facility notifies the network administrator via e-mail when a hardware or software change occurs, when the available disk space gets critical, or when the anti-virus database expires\n\nRemote monitoring and remote control\n\nThe activity and status of a whole network of computers can be monitored remotely with AIDA64 Remote Monitor. Applications and services can be launched remotely, remote computers can be shut down or restarted. With AIDA64 Remote Control it is also possible to take full control of the remote computer to perform administrative tasks and transfer files\n\nHardware diagnostics\n\nAIDA64 has the most accurate hardware detection capabilities in its class, to provide detailed information on the computer internals without the need to open it up. The hardware detection module is strengthened by an exhaustive hardware database holding over 120,000 entries. Additional modules are available to overview processor frequencies, check CRT and LCD display status, and stress the system to reveal potential hardware failures and thermal issues.\n\nSoftware and operating system analysis\n\nAIDA64 provides over 50 pages of information on installed programs, software licenses, security applications, and Windows settings. List of started processes, services, DLL files, startup programs, and visited web pages is also available. \n\nAIDA64 Business Edition is designed to run on 32-bit and 64-bit Microsoft Windows operating systems. It can be run directly from an optical disc, but in such case any configuration changes made in the Preferences of the software will be lost.\n\nSystem requirements\n\nOperating system: \nWindows 95/98/Me \nWindows NT4/2000\nWindows XP\nWindows PE\nWindows Server 2003\nWindows Vista\nWindows Server 2008\nWindows 7\nWindows Server 2008 R2\nWindows 8\nWindows Server 2012\n","torrent":{"xt":"urn:btih:3670a12cf6104c04c46aca03fc811e4d12afe889","amp;dn":"Aida64+Business+Edition+2.60.2100%2Bkeys+by+Senzati.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3670a12cf6104c04c46aca03fc811e4d12afe889","infoHashBuffer":{"type":"Buffer","data":[54,112,161,44,246,16,76,4,196,106,202,3,252,129,30,77,18,175,232,137]},"announce":[],"urlList":[]}}