{"title":"Dishonorable Disclosures (2012) Xvid-AC3 avi","uid":7541035,"size":187980370,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:36c7280996d878c1e1be8daaeed3989768f68a22&amp;dn=Dishonorable+Disclosures+%282012%29+Xvid-AC3+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1345216794,"description":"Dishonorable Disclosures\nHow Leaks and Politics Threaten National Security\n &lt;a href=&quot;\nhttp://opsecteam.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://opsecteam.org/&lt;/a&gt;\n\nXvid 864x480 29.97 fps 1 Mbps Qf 0.08\nAC3 2ch 44.1 kHz 128 kbps\n22 min. 00 sec.\n\n- - - - -\n &lt;a href=&quot;\nhttp://www.huffingtonpost.com/2012/08/15/opsec-special-forces_n_1777538.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.huffingtonpost.com/2012/08/15/opsec-special-forces_n_1777538.html&lt;/a&gt;\n\nBy Mark Hosenball\nWASHINGTON Aug 14 [2012](Reuters) - A group of former U.S. intelligence and Special Forces operatives is set to launch a media campaign, including TV ads, that scolds President Barack Obama for taking credit for the killing of Osama bin Laden and argues that high-level leaks are endangering American lives.\n\nLeaders of the group, the Special Operations OPSEC Education Fund Inc, say it is nonpartisan and unconnected to any political party or presidential campaign. It is registered as a so-called social welfare group, which means its primary purpose is to further the common good and its political activities should be secondary.\n\nIn the past, military exploits have been turned against presidential candidates by outside groups, most famously the Swift Boat ads in 2004 that questioned Democratic nominee John Kerry's Vietnam War service.\n\nThe OPSEC group says it is not political and aims to save American lives. Its first public salvo is a 22-minute film that includes criticism of Obama and his administration. The film, to be released on Wednesday, was seen in advance by Reuters.\n\n&quot;Mr. President, you did not kill Osama bin Laden, America did. The work that the American military has done killed Osama bin Laden. You did not,&quot; Ben Smith, identified as a Navy SEAL, says in the film.\n\n&quot;As a citizen, it is my civic duty to tell the president to stop leaking information to the enemy,&quot; Smith continues. &quot;It will get Americans killed.&quot;\n\nAn Obama campaign official said: &quot;No one in this group is in a position to speak with any authority on these issues and on what impact these leaks might have, and it's clear they've resorted to making things up for purely political reasons.&quot;\n\nObama has highlighted his foreign policy record on the campaign trail, emphasizing how he presided over the killing of bin Laden, as well as how he ended the war in Iraq and set a timeline for winding down the war in Afghanistan.\n\nHowever, Obama has come under sharp attack from Republican lawmakers who have accused his administration of being behind high-level leaks of classified information.\n\nThey have pointed to media reports about clandestine drone attacks, informants planted in al Qaeda affiliates and alleged cyber-warfare against Iran that Republicans say were calculated to promote Obama's image as a strong leader in an election year.\n\nThe White House has denied leaking classified information.\n\nThe president of Special Operations OPSEC Education Fund Inc, Scott Taylor, is a former Navy SEAL who in 2010 ran unsuccessfully for the Republican nomination for a congressional seat in Virginia.\n\nCalling itself &quot;OPSEC&quot; for short - which in spy jargon means &quot;operational security&quot; - the anti-leak group incorporated last June in Delaware, a state that has the most secretive corporate registration rules in the U.S.\n\nIt also set itself up as a nonprofit organization under section 501(c)4 of the U.S. Tax Code, allowing it to keep donors' identities secret. Spokesmen for the group declined to discuss its sources of financing.\n\n","torrent":{"xt":"urn:btih:36c7280996d878c1e1be8daaeed3989768f68a22","amp;dn":"Dishonorable+Disclosures+%282012%29+Xvid-AC3+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36c7280996d878c1e1be8daaeed3989768f68a22","infoHashBuffer":{"type":"Buffer","data":[54,199,40,9,150,216,120,193,225,190,141,170,238,211,152,151,104,246,138,34]},"announce":[],"urlList":[]}}