{"title":"Control (2012)","uid":7471280,"size":291599028,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3807c2e0eb5f40d18eaf43c0c7720bea19be43dc&amp;dn=Control+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Xenonite","files":-1,"time":1343159288,"description":"Control is a pilot for a drama series set in the Mission Control of a manned space mission, written as a hybrid of Apollo 13 and The West Wing in style and tone.\n\nAn International coalition has come together to send the first humans to Mars--but a race is on with a Chinese mission to see who gets there first.\n\nWhen a military stand-off between the US and China threatens to start a war, Flight Director Peter Lacey must fight to keep his astronauts from becoming pawns in the Earthly conflict. But a secret has been kept from him that threatens the lives of both crews, who hang in the balance 150 million miles from home...\n\nFrom the creators of Pioneer One, Control is destined for entry into the 2012 New York Television Festival, where P1 took home 'Best Drama Pilot' in 2010. Whereas Pioneer One continued on as a series online, Control is being made specifically to shop to networks both online and on television. This year's NYTVF is going to be a prime opportunity to do that, with buyers from Hulu, Syfy, IFC, and others yet to be announced.","torrent":{"xt":"urn:btih:3807c2e0eb5f40d18eaf43c0c7720bea19be43dc","amp;dn":"Control+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3807c2e0eb5f40d18eaf43c0c7720bea19be43dc","infoHashBuffer":{"type":"Buffer","data":[56,7,194,224,235,95,64,209,142,175,67,192,199,114,11,234,25,190,67,220]},"announce":[],"urlList":[]}}