{"title":"Straw Dogs (1971) DVD5 (ISO) Disc 1 Criterion Collection","uid":7596540,"size":4696965120,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3adecf5563b472ec9463fa916fad9ea3a7f54d5e&amp;dn=Straw+Dogs+%281971%29+DVD5+%28ISO%29+Disc+1+Criterion+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Auge","files":-1,"time":1346709143,"description":"Straw Dogs (1971) DVD5 (ISO) Disc 1 Criterion Collection\n\n*** \nI use a Transfer Cap and upload 7 gigs a day. \nThis is why I upload a new torrent every other day or so. \nI do this to keep my IP off my back as they have initiated a monthly limit.\nIt usually takes me two days to fully seed a torrent so please be patient. \n***\n\nThis is a DVD rip to an ISO so you can watch it on your media player mount it to a virtual drive or burn it to a DVD. You can even unzip it with WinZip or WinRAR to unpack it to the original VOBs.\n\nThis rip is a (DVD-5)\n\n- What I mean by (DVD-5) this ISO has been compressed to fit onto a single layer disc the main film has been touched as little as possible and unless you are watching this on a high definition projector at over 60 inches you should not be able to notice any difference. Nothing has been taken out of the original DVD.\n\n\n1960\n89 minutes\nBlack &amp; White\n1.33:1\nSpoken Language: Swedish\nSubtitles: English\nNTSC\n\nDirector: \nSam Peckinpah\n\nCast: \nDustin Hoffman Susan George Peter Vaughan T.P. McKenna Del Henney Jim Norton Donald Webster Ken Hutchison\n\nDisc Features:\n* New high-definition digital transfer of the uncut version enhanced for widescreen televisions\n* Audio commentary by film scholar Stephen Prince\n* Isolated music and effects track\n* English subtitles for the deaf and hearing impaired\n\nSYNOPSIS:  \nAstrophysicist David Sumner (Dustin Hoffman) and wife Amy (Susan George) move to England to get away from the violence in America. But the Sumners learn that things are no better on the other side of the pond when local construction workers intimidate and exploit the couple. The trouble turns into a bloody battle when David -- who discovers a feral and vicious side of himself -- is forced to defend his home after Amy gets raped.\n\nStuff I Want:\nI am desperately seeking an invite to BitHQ.\nIf anybody can help me out you would be doing me a big favor.\n","torrent":{"xt":"urn:btih:3adecf5563b472ec9463fa916fad9ea3a7f54d5e","amp;dn":"Straw+Dogs+%281971%29+DVD5+%28ISO%29+Disc+1+Criterion+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3adecf5563b472ec9463fa916fad9ea3a7f54d5e","infoHashBuffer":{"type":"Buffer","data":[58,222,207,85,99,180,114,236,148,99,250,145,111,173,158,163,167,245,77,94]},"announce":[],"urlList":[]}}