{"title":"Alien Arena 7.53 Linux","uid":7103311,"size":440048351,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:3b206222ce5e07add853030c5ca3dcb9075f92d8&amp;dn=Alien+Arena+7.53+Linux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nldsfim","files":-1,"time":1331770753,"description":"Do you old school deathmatch with modern features? How about rich, colorful, arcadelike atmospheres? How about...retro Sci Fi? Then you're going to love what Alien Arena has in store for you! This game combines some of the very best aspects of such games as Quake III and Unreal Tournament and wraps them up with a retro alien theme, while adding tons of original ideas to make the game quite unique.\n\nAlien Arena 2011 is the latest version of a freeware online deathmatch game that was first introduced to the public in October, 2004. Since that time, the game has been downloaded over 1 million times, and currently stands at revision 7.50(Dec 16, 2010 release). In October 2007, Linux.com reviewed Alien Arena, annointing it as the very best of the free online games available at the time. Alien Arena has been reviewed and featured on cover DVD's by dozens of gaming publications, including heavy hitters such as PC Power Play and PC Gamer, as well as being featured on gaming media outlets such as GIGA Tv.\n\nThe goal of Alien Arena was to create the perfect marriage between Quake and Unreal Tournament, between retro sci-fi and futuristic tech, and between casual gamer and advanced expert, and wrap it up in a package with quality that could rival that of commercial games. The game has a weapon set that is unique and fun, and deviates a bit away from the standard Q3 or UT2k4 weapons. Gameplay can be altered easily in the menu by choosing between the various game types, such as Deathmatch, Team Core Assault, All Out Assault, Capture the Flag, Duel, and Cattle Prod. Users can also apply a number of different mutators to the game rules as well, creating some pretty interesting scenarios. Players can join others on servers using the in-game browser, or use the Galaxy client, which also serves as a way to communicate with the large, and friendly Alien Arena community.\n\nUsing the CRX engine, which is based on the Id GPL source code, Alien Arena includes modern effects such as real time per pixel lighting and soft shadows, ragdoll physics, lensflares, light blooms, textured particles, decals, 32 bit color, shaders, fog, weather effects, and much more. The engine has been optimized with each release, and will run very nicely even on older hardware. Netcode is tried and true, and runs smooth even on high ping servers, and has been made very secure to malicious attacks. Development of the engine continues at a torrid pace, and with each release moves closer in quality to that of commercial gaming.\n\nAlien Arena is a furious frag fest with arenas ranging from the small, to the massive. With a large built-in player base, it's never hard to find a good match going on, at any hour of the day. The community is friendly, as well as prolific. Dozens of maps, models, and various accessories have been created by community members to add on to the game experience.\n\nAlien Arena features team based gameplay as well, such as Team Core Assualtl, a mode in which players must work together to disable their enemy team's central metal spider. Don't forget about the Team Deathmatch, Cattle Prod, Capture the Flag, Deathball, and All Out Assault mode(in which players can enter vehicles) either. For the 1v1 players, Alien Arena now features a duel mode!\n &lt;a href=&quot;\nhttp://red.planetarena.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://red.planetarena.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:3b206222ce5e07add853030c5ca3dcb9075f92d8","amp;dn":"Alien+Arena+7.53+Linux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b206222ce5e07add853030c5ca3dcb9075f92d8","infoHashBuffer":{"type":"Buffer","data":[59,32,98,34,206,94,7,173,216,83,3,12,92,163,220,185,7,95,146,216]},"announce":[],"urlList":[]}}