{"title":"Indiana Jones 4 Recut (ColonelDredd edit)","uid":7504352,"size":3005436476,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3b4b85836f5378b5f0d356434b9ef7e80fd1db23&amp;dn=Indiana+Jones+4+Recut+%28ColonelDredd+edit%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"coloneldredd","files":1,"time":1344120317,"description":"You must already own a copy of 'Indiana Jones and the Kingdom of the Crystal Skull' before downloading this copy. Go out and support the filmmakers. This exercise is not for profit. \n\n---\n\nTook a long time to overhaul the flick to make it watchable and enjoyable. \n\nShaved away as much awkward expository dialogue as possible, and also re-scored some of the action scenes (along with significantly tightening some of them up).\n\nI deleted the 'son' subplot until the last possible moment and also increased Indy's annoyance with Mutt through some carefully placed edits. The 'jungle chase' was worked on for a long time to turn it into more of a classic Spielberg scene, as well, all of the focus has been put back on Indy. Shots and sequences have been rearranged to change the narrative of the chase to change the emphasis to an old-school 'Indy' tone. \n\nEvery scene has been recut or shaved down to work the flow of the flick better, I love this series and tried as hard as possible to make this fourth one something that resembles the other three. Trying to give it more of a fun spirit and focus on the character we all know and love.\n\nEven the 'part time' line has been replaced with the better reading from the  trailer.","torrent":{"xt":"urn:btih:3b4b85836f5378b5f0d356434b9ef7e80fd1db23","amp;dn":"Indiana+Jones+4+Recut+%28ColonelDredd+edit%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b4b85836f5378b5f0d356434b9ef7e80fd1db23","infoHashBuffer":{"type":"Buffer","data":[59,75,133,131,111,83,120,181,240,211,86,67,75,158,247,232,15,209,219,35]},"announce":[],"urlList":[]}}