{"title":"The Ed Show 8-17-12.mp4","uid":7544349,"size":199072265,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3bc1c00ecf078f60a5d7da71e5d2c173c9a5623e&amp;dn=The+Ed+Show+8-17-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1345305940,"description":"The Ed Show; August 17, 2012.\n\n\n81 days until the election and Paul Ryan lies almost as much as Mitt Romney does. The big Eddie board of truth returned Friday night.\n\nEd started with the Big Eddie Board of Truth and took apart Paul Ryan's stimulus lie with Rep. Gwen Moore, (D-WI) and Richard Wolffe (MSNBC Political Analyst) also joined Ed for that.\n\nPaul Ryan got ready for some *assisted* lying in Florida.  Ed showed the stakes for ending Medicare in the sunshine state with Mitchell Ceasar (Chairman of Broward County Democratic Party), and Mike Papantonio (host of &quot;The Ring of Fire&quot; radio show).\n\nThe block the vote effort continued in Pennsylvania. Ed showed the latest obstacle voters are facing in the state with Stephanie Singer (Philadelphia City Commissioner).\n\nThe Obama campaign kept taxes on the table with a creative offer. And the creator of the wire dropped the hammer on Mitt Romney's ridiculous tax rate. Ed dove into these stories with Daniel Berger (Patriotic Millionaire member and a Philadelphia attorney).\n\nPaul Ryan said he likes the band Rage Against the Machine, but they sure don't like him. Ed told about that smack down.\n\nAnd new poll numbers show U.S. Rep. Michele Bachmann is in political trouble. Ed talked with Jim Graves, the Democrat who is challenging Bachmann in the election.","torrent":{"xt":"urn:btih:3bc1c00ecf078f60a5d7da71e5d2c173c9a5623e","amp;dn":"The+Ed+Show+8-17-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bc1c00ecf078f60a5d7da71e5d2c173c9a5623e","infoHashBuffer":{"type":"Buffer","data":[59,193,192,14,207,7,143,96,165,215,218,113,229,210,193,115,201,165,98,62]},"announce":[],"urlList":[]}}