{"title":"The Ed Show 8-10-12.mp4","uid":7523209,"size":189964677,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3c7c753deba4206fbe4ca786d9173de82c6eb3f9&amp;dn=The+Ed+Show+8-10-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1344695744,"description":"The Ed Show; August 10, 2012.\n\nThe Romney campaign is spending half of its ad resources on a commercial that is a total lie.  Today, the Obama campaign hit back.\n\nEd started with Michael Eric Dyson (Professor of Sociology at Georgetown university and author of &quot;Can You Hear Me Now?&quot;), and Paul Waldman (Contributing Editor with The American Prospect magazine), join Ed with the latest.\n\nRighties continue to slam the hard-hitting &quot;Joe Soptic&quot; ad.  Bill Burton (Former White House Deputy Press Secretary under President Obama), will respond.  \n\nThe Catholic Bishops called his budget &quot;immoral&quot; and Republicans want him as the vice presidential nominee.  Richard Viguerie (Chairman of Conservativehq.com), thinks the young gun has a laundry list of problems, and he'll join Ed to explain.\n\nThere's new evidence that Republicans have been out to sabotage the president since day one. The source?  Vice President Joe Biden. \n\nThe big panel; Keli Goff, (Author of &quot;The GQ Candidate&quot; and Political Correspondent for TheRoot.com), Michael Maslansky (Republican Strategist), and Ari Melber (Correspondent for The Nation) will weigh in on that.\n\nThe Romney campaign isn't the only one spreading lies in campaign ads. We'll show the lie Karl Rove's super PAC is pushing in North Dakota.\n\nAnd in the Big Finish, NASA's rover Curiosity sends back stunning color images of the Martian surface.  Derrick Pitts (Chief Astronomer at Franklin Institute) has the latest on the most advanced space craft ever sent to another planet. ","torrent":{"xt":"urn:btih:3c7c753deba4206fbe4ca786d9173de82c6eb3f9","amp;dn":"The+Ed+Show+8-10-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c7c753deba4206fbe4ca786d9173de82c6eb3f9","infoHashBuffer":{"type":"Buffer","data":[60,124,117,61,235,164,32,111,190,76,167,134,217,23,61,232,44,110,179,249]},"announce":[],"urlList":[]}}