{"title":"Edgar Broughton Band - Keep Them Freaks a Rollin` (Live-1969) FL","uid":7578902,"size":428612081,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3c82268bfd02fde93b3a26585c5f302e7f77cac7&amp;dn=Edgar+Broughton+Band+-+Keep+Them+Freaks+a+Rollin%60+%28Live-1969%29+FL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Let it rock","files":17,"time":1346188071,"description":"       Edgar Broughton Band\n\n                                 'Keep Them Freaks A Rollin'\n\n                       Live At Abbey Road,December 1969 [Remastered 2004] \n\n\n A legend in its own lifetime, Keep Them Freaks a Rollin' was, as its subtitle makes plain, recorded live\n at Abbey Road Studios in 1969, as a possible first album by the then newly signed Broughton Band. \n However, the tapes were shelved in favor of a more conventional studio recording, and only one \n excerpt ever made it out, a harshly edited 45 of the closing &quot;Out Demons Out,&quot; already established as \n the band's live tour de force. The full-length version, however, remained unheard and, like the rest of \n the show, it eventually faded into mythology. The tapes were finally resuscitated in 2004, to herald \n EMI's CD remastering of the full Edgar Broughton Band catalog. And, though 35 years had now \n passed, the primal energy and majesty of the Broughtons in full flight still burns through. Egged on by \n a studio full of friends and fans, the band recounts its entire period live show, with a churning \n &quot;Smokestack Lightning&quot; and an evil &quot;Dropout Boogie&quot; pinpointing the two influences that collided to \n create the Broughtons' own unique brew. &quot;American Boy Soldier,&quot; still one of the most potent \n protest songs of the entire Vietnam era (and an equally valid component in the modern-day outfit's \n live show) is spellbinding and, at almost 15 minutes, spotlights the band's improvisational powers to \n perfection. And then there's &quot;Out Demons Out,&quot; restored to its full ten-minute glory once again, and \n still capable of swaying the stoniest heart. Would history have been different had this become the \n band's debut album? Probably not -- and besides, what would have become of Wasa Wasa if it had? \n But still, any survey of the British underground through the early '70s would be woefully incomplete \n without an evening spent with this album and, alongside Hawkwind's Doremi Fasol Latido, the first \n Pink Fairies album, and Mick Farren's Carnivorous Circus, it remains the key to what that entire \n movement was all about. ","torrent":{"xt":"urn:btih:3c82268bfd02fde93b3a26585c5f302e7f77cac7","amp;dn":"Edgar+Broughton+Band+-+Keep+Them+Freaks+a+Rollin%60+%28Live-1969%29+FL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c82268bfd02fde93b3a26585c5f302e7f77cac7","infoHashBuffer":{"type":"Buffer","data":[60,130,38,139,253,2,253,233,59,58,38,88,92,95,48,46,127,119,202,199]},"announce":[],"urlList":[]}}