{"title":"POtHS 3 - Bible - 94 - Saul and David","uid":7595707,"size":3308564590,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3cad348495678797e1be8c08f526b22834850c88&amp;dn=POtHS+3+-+Bible+-+94+-+Saul+and+David&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":-1,"time":1346687717,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS 3 - Bible Movies - 94 - Saul and David\n\n\nPOtHS says: Very Good.\n\nDescription:\n\nDavid of Bethlehem, slays the giant and become a rival to King Saul.\n\nFrom the Old Testament, the First Book of Samuel; this beautifully filmed story of David's life with King Saul has all the power and sensitivity of the Biblical account.\n\nKing Saul, requesting a conqueror to slay the Philistine giant Goliath, is amused when the child-servant of God, David of Bethlehem, answers his request. With the faith in God, David slays the giant and wins the love and admiration of Israel and the King. David becomes a great warrior for the King's army.\n\nEven though King Saul comes to admire David, the King starts to slowly lose faith in God. With the spirit of God departed from Saul, David is anointed King of Israel, thus begins a love-hate relationship between Saul and David. As the blessings of God fall upon David and he is exalted, Saul's fury rises against him in this epic tale.\n\nSpecial Features\n\n   Actor &amp; Bible Character Bios\n   Previews\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.","torrent":{"xt":"urn:btih:3cad348495678797e1be8c08f526b22834850c88","amp;dn":"POtHS+3+-+Bible+-+94+-+Saul+and+David","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cad348495678797e1be8c08f526b22834850c88","infoHashBuffer":{"type":"Buffer","data":[60,173,52,132,149,103,135,151,225,190,140,8,245,38,178,40,52,133,12,136]},"announce":[],"urlList":[]}}