{"title":"Cuckold Fantasies vol. 23","uid":7525534,"size":564622030,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3e0d8522ec01dd9c96540eb6c8f9eedab442afdf&amp;dn=Cuckold+Fantasies+vol.+23&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1344771910,"description":"FORCED BI with Black Bull! CREAMPIE EATING! \n \n\n\nUnsatisfied wife Amanda Blow drags her wimpy husband Jimmy to couples therapy. She rubs her pussy in frustration.\n\n\nTall, black, therapist Jayson knows just what this marriage needs. He whips out his GIANT BLACK COCK and, to Jimmy's horror,  Amanda can't keep her hands and mouth off of it.\n \nAmanda and the therapist insist that to heal their marriage, Jimmy must share the experience. She grabs Jimmy's head and FORCES HIM TO SUCK COCK with her! She makes him LICK THOSE BIG BLACK BALLS and laughs at his feeble protests.\n \nThey strip, and Amanda finds the comparison between Jayson's enormous black hard-on and Jimmy's tiny limp dick hilarious. She SPANKS her husband and forces him to keep blowing the therapist.\n \n \n \nBut that's not the end of the FORCED BISEXUAL depravity! Soon the therapist is FUCKING Amanda while she lies on top of Jimmy. She orders her husband to lick up her cum as it drips off that big black cock and balls. She pulls the huge pole out of her pussy and forces it deep into her husband's mouth.\n \nShe climbs on top of the therapist and orders Jimmy to guide that big dick into her hole. He then has to KISS HER FEET as he watches his wife's pussy get more and more stretched out, and listens to her scream in ecstasy.\n \n \n \nAmanda CUMS multiple times, then rejoices as the therapist blasts his massive load inside and outside her pussy. She grabs Jimmy's head and slams it into her crotch, forcing him to lap up the thick, nasty CREAMPIE.\n \nAfter cleaning her up, Amanda finally allows Jimmy wank himself until he cums.\n\n\nScreens &lt;a href=&quot;\nhttp://www.romanvideo.net/shop/product_info.php?products_id=1559&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.romanvideo.net/shop/product_info.php?products_id=1559&lt;/a&gt;\n\n\n\n\n\nAnd if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\n \n\nCheers  :-) \n\t\t","torrent":{"xt":"urn:btih:3e0d8522ec01dd9c96540eb6c8f9eedab442afdf","amp;dn":"Cuckold+Fantasies+vol.+23","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e0d8522ec01dd9c96540eb6c8f9eedab442afdf","infoHashBuffer":{"type":"Buffer","data":[62,13,133,34,236,1,221,156,150,84,14,182,200,249,238,218,180,66,175,223]},"announce":[],"urlList":[]}}