{"title":"Wayne Fontana &amp; The Mindbenders (2002) (2on1) [FLAC] ","uid":7533244,"size":310206751,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3f29e2e7e255211abb3abff1235a97b3f18bfac8&amp;dn=Wayne+Fontana+%26amp%3B+The+Mindbenders+%282002%29+%282on1%29+%5BFLAC%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":7,"time":1345031997,"description":"\n\nWayne Fontana &amp; The Mindbenders - Wayne Fontana &amp; The Mindbenders/It's Wayne Fontana &amp; The Mindbenders (2002) [FLAC]\n\nGenre: UK, Beat\n\nTracklist:\n\n1. She's Got the Power - Wayne Fontana and the Mindbenders, Greenwich\n2. You Don't Know Me - Wayne Fontana and the Mindbenders, Arnold, Eddy\n3. Git It! - Wayne Fontana and the Mindbenders, Kelly\n4. Jaguar and Thunderbird - Wayne Fontana and the Mindbenders, Berry, Chuck\n5. Certain Girl - Wayne Fontana and the Mindbenders, Neville, Naomi\n6. One More Time - Wayne Fontana and the Mindbenders, Ellis\n7. Where Have You Been? - Wayne Fontana and the Mindbenders, Mann, Barry\n8. Keep Your Hands Off My Baby - Wayne Fontana and the Mindbenders, Goffin\n9. Too Many Tears - Wayne Fontana and the Mindbenders,\n10. Girl Can't Help It - Wayne Fontana and the Mindbenders, Troup, Bobby\n11. Cops and Robbers - Wayne Fontana and the Mindbenders, McDaniel\n12. I'm Gonna Be a Wheel Someday - Wayne Fontana and the Mindbenders, Bartholomew, Dave\n13. Um, Um, Um, Um, Um - Wayne Fontana and the Mindbenders, Mayfield\n14. Some Other Guy - Wayne Fontana and the Mindbenders, Barrett, Richard [1\n15. She's a Rebel - Wayne Fontana and the Mindbenders, Pitney\n16. Like I Did - Wayne Fontana and the Mindbenders, Ellis\n17. Memphis Tennessee - Wayne Fontana and the Mindbenders, Berry, Chuck\n18. It's Just a Little Bit Too Late - Wayne Fontana and the Mindbenders, Ballard Jr.\n19. The Shadow Knows - Wayne Fontana and the Mindbenders, Leiber\n20. I Remember Love - Wayne Fontana and the Mindbenders, McCoy\n21. Skinny Minnie - Wayne Fontana and the Mindbenders, Haley, Bill\n22. Honey and Wine - Wayne Fontana and the Mindbenders, Goffin\n23. (I'm Your) Hoochie Coochie Man - Wayne Fontana and the Mindbenders, Dixon, Willie\n24. Please Stay - Wayne Fontana and the Mindbenders, Bacharach\n25. Long Time Comin' - Wayne Fontana and the Mindbenders, Stewart\n26. The Game of Love - Wayne Fontana and the Mindbenders, Ballard Jr.\n\t\t\n\n","torrent":{"xt":"urn:btih:3f29e2e7e255211abb3abff1235a97b3f18bfac8","amp;dn":"Wayne+Fontana+%26amp%3B+The+Mindbenders+%282002%29+%282on1%29+%5BFLAC%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f29e2e7e255211abb3abff1235a97b3f18bfac8","infoHashBuffer":{"type":"Buffer","data":[63,41,226,231,226,85,33,26,187,58,191,241,35,90,151,179,241,139,250,200]},"announce":[],"urlList":[]}}