{"title":"Chrome: Specforce","uid":7095124,"size":1444190344,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:41135e5c9a119541144092152369ab6b8bcf36bc&amp;dn=Chrome%3A+Specforce&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sarsars","files":-1,"time":1331543077,"description":"Chrome: Specforce (C) Deep Silver\n\n03/2006 :..... RELEASE.DATE .. PROTECTION .......: Starforce 3.6\n2 :.......... DISC(S) .. GAME.TYPE ........: Action\n\nIn a not too distant future, the rapid advancement of technology has allowed\nman's common dream of colonizing distant planets become reality. With need\nof further natural resources and living space, the human race rapidly\nexpands. Unprepared for the scale of development, the Federation, overseer\nfor the process of colonizing the universe, limit the selling of\n'terra-forming' permits. Outraged by the decision, powerful mega\ncorporations begin holding an authoritarian rule on their very own &quot;private&quot;\nplanets. The full autonomy of these new worlds soon creates a safe haven\nfor criminal activity and bringing down the Federation is their number one\npriority.\n\nFor a little more than 12 months the Federation's special division has led\nan investigation into the ever more frequent case of government officers\nbeing confronted by criminals, commonly found under the influence of an as\nyet unknown stimulant. Based of synthetic enzymes, the substance causes the\nfearless, aggressive, trigger-happy and pain resistant hitmen to wreak\nhavoc, and the problem is now spreading.\n\nCreated with the purpose of ridding the planetary system of global hazards\nand crisis situations endangering the Federation's stability, the elite\nstrike unit Chrome: SpecForce has finally caught a break in the\ninvestigation.\n\nArmed with the latest military technology in combat, designed with Special\nForces in mind, the SpecForce field agents equip themselves with SPA4\nPower Armour, the main element of a SpecForce field agent's operational\nequipment and vital to mission success. Be it assassination, espionage,\ninfiltration or sabotage, the armours systems enhance the efficiency of\ntactical operations conducted in enemy territory.\n\nDispatched to the planetary system of Estrella to collect evidence, it\nquickly becomes clear that a seemingly simple task leads to an intrigue\non a much grander scale...\n\nInstallation Instructions:\n1. Unrar.\n2. Burn or mount with Daemon Tools.\n3. Install the game, When asked for a serial enter one of the serials included in Serials.txt.\n4. Copy over the cracked content from the Crack directory on CD1 to your\ninstallation directory.\n5. Play the game.\n","torrent":{"xt":"urn:btih:41135e5c9a119541144092152369ab6b8bcf36bc","amp;dn":"Chrome%3A+Specforce","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41135e5c9a119541144092152369ab6b8bcf36bc","infoHashBuffer":{"type":"Buffer","data":[65,19,94,92,154,17,149,65,20,64,146,21,35,105,171,107,139,207,54,188]},"announce":[],"urlList":[]}}