{"title":"Sleeping Dogs XBOX360-SWAG","uid":7534918,"size":8739293573,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:421c87494412710dc94b0048bf4a84bb9b076325&amp;dn=Sleeping+Dogs+XBOX360-SWAG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"boobiesrfunu","files":-1,"time":1345061624,"description":"Sleeping Dogs XBOX360-SWAG\n\nInspired by classic Hollywood and Asian cinema style action thrillers, Sleeping Dogs is a gritty\nopen-world cop drama set in the vibrant city of Hong Kong. Sleeping Dogs catapults players into\nthe role of undercover cop Wei Shen, tasked with taking down one of the worlds most fearsome\ncriminal organizations from the inside... the Hong Kong Triads. As players explore the bustling\nand crowded Hong Kong island, through its neon-lit side streets and sprawling street markets, an\nincredible story unfolds of loyalty and betrayal where Wei begins to question his own motives as\nhe is sucked in deeper than he could ever imagine.\n\nFeatures:\n\nA mature and gritty undercover cop drama, set in a high tension underworld where every action is\na risk that could blow your cover.\n\nSeamless explosive action fueled by a mix of deadly martial arts, intense gunfights and brutal\ntakedowns.\n\nEpic high-speed thrills: Burn up the streets as you ram other cars and drive recklessly while\nshooting your way through the narrow streets of Hong Kong.\n\nHong Kong is your playground: Enter illegal races, gamble on cock fights, or kick back with some\nkaraoke. There are countless ways to explore the varied districts of the city.\n\nPlatform: XBOX360\nRegion: Region Free\nFormat: XGD3\nSize: 1 DVD\nLanguage: English","torrent":{"xt":"urn:btih:421c87494412710dc94b0048bf4a84bb9b076325","amp;dn":"Sleeping+Dogs+XBOX360-SWAG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"421c87494412710dc94b0048bf4a84bb9b076325","infoHashBuffer":{"type":"Buffer","data":[66,28,135,73,68,18,113,13,201,75,0,72,191,74,132,187,155,7,99,37]},"announce":[],"urlList":[]}}