{"title":"Total Commnder v7.57a","uid":7092431,"size":3281740,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:434a6ce137990553550f0d9c61ee095f244cb873&amp;dn=Total+Commnder+v7.57a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pe001","files":1,"time":1331411208,"description":" Total Commander (former Wincmd) is a file manager for Windows similar to the Windows Explorer. But Total Commander uses a different approach: it has two fixed windows side by side like a well-known file manager for DOS.\n\n Total Commander (formerly know as Wincmd) is an file manager replacement for the Windows Explorer. This is the 32 bit version for Windows 95/98/ME and Windows NT/2000/XP. A 16 bit version is also available.\n\n Total Commander handles archives like subdirectories. It supports ZIP/ARJ/LHA/RAR/UC2/TAR/GZ/CAB/ACE archives, and has an internal ZIP-compatible packer. The search function allows to search for files\n inside archives, even for text.\n\n\n A command line helps starting programs with parameters, and a fully configurable button bar allows to launch programs and internal commands. The built-in viewer can show files in text, hex, binary, image and multimedia format.\n\n The 32 bit version supports Drag&amp;Drop from and to explorer/desktop, delete to the recycle bin, and Explorer style context menus/property sheets. FTP servers on the Internet can be accessed like local drives.\n\n A configurable directory hotlist (bookmarks) and history list make directory navigation easier.\n\n The sync function allows to synchronize two complete directory trees, and the compare function shows the difference of two binary or text files highlighted side by side. The new parallel port connection works between any combination of Windows 95/98/ME, Windows NT 4, Windows 2000/XP, Windows 3.1 and even DOS through a separate server.\t\t\n\n","torrent":{"xt":"urn:btih:434a6ce137990553550f0d9c61ee095f244cb873","amp;dn":"Total+Commnder+v7.57a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"434a6ce137990553550f0d9c61ee095f244cb873","infoHashBuffer":{"type":"Buffer","data":[67,74,108,225,55,153,5,83,85,15,13,156,97,238,9,95,36,76,184,115]},"announce":[],"urlList":[]}}