{"title":"Avira A/V System Rescue - 2010kaiser","uid":7454823,"size":261483813,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:449edfcdd4131fef4193cd5a9b0a383cbed44358&amp;dn=Avira+A%2FV+System+Rescue+-+2010kaiser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2010kaiser","files":-1,"time":1342637222,"description":"\nAvira AntiVir Rescue System is a Linux-based boot disc that will detect and remove malware from a damaged PC.\n\nIf a virus attack has affected your PC to the point where it will no longer start, then the Rescue System may help restore normal operations. And if you think your PC is infected by something, but your regular antivirus tool can't find it, then this could be a useful way to get a second opinion. Booting from a separate CD means that stealthy malware like rootkits will find it more difficult to hide, and you'll have a much better chance of detecting and removing them.\n\nIt's easy to create the boot disc: just  run the application, place a blank CD in your drive and the program will burn the boot disc for you (no other burning software is required).\n\nLaunch your PC from the Rescue System and choose option #1 to load it with the default settings. Initially the display will be in German, but click the Union Jack flag at the bottom of the screen if you'd prefer English.\n\nClick the Update button and the Rescue System will update itself with the latest antivirus definitions, if it can find an internet connection.\n\nThen use the Virus Scanner option, and the Rescue System will check your PC for malware, informing you of anything it discovers, removing the virus and hopefully restoring your PC to its normal working order.\n","torrent":{"xt":"urn:btih:449edfcdd4131fef4193cd5a9b0a383cbed44358","amp;dn":"Avira+A%2FV+System+Rescue+-+2010kaiser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"449edfcdd4131fef4193cd5a9b0a383cbed44358","infoHashBuffer":{"type":"Buffer","data":[68,158,223,205,212,19,31,239,65,147,205,90,155,10,56,60,190,212,67,88]},"announce":[],"urlList":[]}}