{"title":"Wet Food 3","uid":7095311,"size":8391940096,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:46ee4eb95452e54ebc28f89b6cdc90d7aa08d42f&amp;dn=Wet+Food+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ammarbay","files":15,"time":1331547475,"description":" &lt;a href=&quot;http://84.16.228.146/~sharezo1/view.php?filename=84821Bald.Beavers.2xxx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://84.16.228.146/~sharezo1/view.php?filename=84821Bald.Beavers.2xxx.jpg&lt;/a&gt;\n\n\nJonni Darkko's Wet Food 3 makes one hell of a big splash! His popular 'blow bang' series always showcases gorgeous women getting relentlessly face-fucked by multiple guys, with cum facials galore, sperm drinking, stringy drool and nasty gag spit cascading all over the place. For this special 'Deep Throat Edition,' Jonni has cast five of the hottest XXX throat queens, mouth-watering girls who love gagging on cock and widening their windpipes with extreme oral stunts.\nEvery chick gets smeared and splattered with spunk! Super-sexy brunette Juelz Ventura uses her talented gullet on a team of eight men, slathering their huge cocks with dripping saliva until they each spray her mouth with a mess of sloppy cum. Buxom, submissive blonde Nikki Sexx licks smelly scrotums and chokes on hard dicks, and sultry slut Chanel Preston takes care of her guys in a spit-soaked, gurgling performance that leaves her pretty face coated with ball slime.\nSuperwhore Sea J Raw (with some help from newcummer Lucky Starr) satisfies 10 guys at once, drooling loads of semen into a goblet and slurping it up again! Latina cutie Vicki Chase uses a vibrating wand to stimulate her pussy while her sensuous mouth gets used as a public accommodation. Another fine mess Jonni Darkko has gotten us into!","torrent":{"xt":"urn:btih:46ee4eb95452e54ebc28f89b6cdc90d7aa08d42f","amp;dn":"Wet+Food+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46ee4eb95452e54ebc28f89b6cdc90d7aa08d42f","infoHashBuffer":{"type":"Buffer","data":[70,238,78,185,84,82,229,78,188,40,248,155,108,220,144,215,170,8,212,47]},"announce":[],"urlList":[]}}