{"title":"Aleo Flash Intro Banner Maker v3.8 Including Crack with Key [iah","uid":7533371,"size":17782987,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:472944cdf877918776a04a90a0ceef640e7fe5f5&amp;dn=Aleo+Flash+Intro+Banner+Maker+v3.8+Including+Crack+with+Key+%5Biah&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TorDigger","files":4,"time":1344991562,"description":"Aleo Flash Intro Banner Maker v3.8\n \nCreate Flash Intros, Flash banners, Flash slideshows and ecards in just a few clicks!\n \nFlash Intro and Banner Maker is a Flash authoring tool to help you create Flash intros, AD banners and ecards with ease. There is no need for knowledge of Flash development studio and Actionscripts, all you need is to input texts and select from premade customizable background effects and text animation effects. The properties of texts are customizable, including font style, size, width and height scale, transparency, rotation, border, fill style etc. \n\nKey Features\n \n* Wizard style user interface, extremely easy to use; \n* Customize width, height, frame rate of Flash movie; \n* Add border to Flash movie; \n* Add MP3 or WAV file to Flash movie as background sound effect; \n* Add preloader to Flash movie; \n* Add multiple images or Flash movies to background; \n* Lots of background effects to select from, all of them are customizable; \n* Add multiple background effects to Flash movie; \n* Set background of Flash movie as transparent, solid color, linear gradient color, radial gradient color; \n* Display images as dynamic effects, or display as static images on background;\n * Display texts as dynamic effects, or display as static texts on background;\n * Display animated texts and images one by another, or set up incoming time and duration time of each text or image respectively.\n * Unlimited stages of animated text and image effects;\n * Unlimited lines of text effect in one stage; \n* Customize font style, size, width and height scale, transparency, rotation, border of text, set fill style of text as solid color, linear gradient color and radial gradient color; \n* Set different font style of texts in one line; \n* Lots of text animation effects to select from, all of them are customizable; \n* Set web link of texts; \n* Customize timing of text effect; \n* Open web page when Flash movie stops or when user clicks on Flash movie; \n* Publish Movie as Flash SWF, GIF image and AVI video. \n* Generate HTML code to include Flash movie in your web page. \n\nRequirements\n \nOS: Microsoft Windows 98/98SE/Me, Microsoft Windows NT 4.0, \nMicrosoft Windows 2000, 2003, Microsoft Windows XP, Microsoft Windows Vista, Microsoft Windows 7;\n Adobe Flash Player 8.0 and Above\n \nHomepage: http://www.aleosoft.com/index.html\n \nInstallation Instructions:\n \n1. Install Program.\n 2. Copy content from crack folder and paste into default installation directory.\n 3. Use any name any given serial to register application.\n 4. Done, Enjoy.\n ","torrent":{"xt":"urn:btih:472944cdf877918776a04a90a0ceef640e7fe5f5","amp;dn":"Aleo+Flash+Intro+Banner+Maker+v3.8+Including+Crack+with+Key+%5Biah","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"472944cdf877918776a04a90a0ceef640e7fe5f5","infoHashBuffer":{"type":"Buffer","data":[71,41,68,205,248,119,145,135,118,160,74,144,160,206,239,100,14,127,229,245]},"announce":[],"urlList":[]}}