{"title":"RPM: Gymkhana Racing ipad.ipod.iphone","uid":7430950,"size":118530048,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:49b166cc9b7a680e450b15e8ebd410bfea7ebd64&amp;dn=RPM%3A+Gymkhana+Racing+ipad.ipod.iphone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cad40","files":1,"time":1341941247,"description":"Description\nRace around the world doing burnouts, destroying stuff and drifting like a pro. RPM: Gymkhana Racing is an Acrobatic Racing game inspired by the gymkhana motorsport.\n\nFeaturesUSE YOUR DRIVING SKILLS IN AN ENTIRELY NEW WAY\nRPM focuses heavily on drift control, near misses (or hits) and the ability to deal with multiple curves and chicanes in one fast, controlled swipe. Losing grip and wiping out is your only adversary here.\n\nLEAVE TIRE TRACKS ALL OVER THE GLOBE\nZip around 5 fully detailed environments like New York, Dubai, Rural China, Tokyo and Paris.\n\n25 UNIQUE TRACKS\nRace around 25 courses filled with obstacles and detail. Drift around the cramped training tracks of Japan all the way to the gigantic courses of the Louvre Museum.\n\nMULTIPLE OBJECTIVES PER TRACK\nSmash priceless art, do burnouts around meditating monks, splatter walls with paint, pose for the cameras and lots more. Each contains up to 7 objectives.\n\nNON-LINEAR RACING\nThere is a start and a finish to every race, but it's up to the player to explore the tracks and find how to accomplish each goal. Going straight ahead is almost never the best way in RPM.\n\nHD READY\nRPM: Gymkhana Racing is fully optimized to show off the full potential of the newest iOS hardware.","torrent":{"xt":"urn:btih:49b166cc9b7a680e450b15e8ebd410bfea7ebd64","amp;dn":"RPM%3A+Gymkhana+Racing+ipad.ipod.iphone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49b166cc9b7a680e450b15e8ebd410bfea7ebd64","infoHashBuffer":{"type":"Buffer","data":[73,177,102,204,155,122,104,14,69,11,21,232,235,212,16,191,234,126,189,100]},"announce":[],"urlList":[]}}