{"title":"FCleaner - 2010kaiser","uid":7450363,"size":1225190,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4ecb486da67c4d48b766bf0fd1366268814c7196&amp;dn=FCleaner+-+2010kaiser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2010kaiser","files":-1,"time":1342486200,"description":"\nFCleaner is a freeware all-in-one Windows disk and registry cleaning and optimization tool. It removes unused files and invalid registry entries that are eating up your disk space and slowing your system down, tweaks your system and allows your Windows to run faster.\n\nFCleaner can also protect your privacy such as Internet History, the Cookies that websites leave behind. You can erase all the traces of your online activities in just one click with the help of FCleaner. NO Experience Or Computer Skills Necessary! FCleaner is free, but it does not contain any Spyware or Adware.\n\nFor Windows System\nRecycle Bin, Clipboard, Windows Memory Dumps, Chkdsk File Fragments, Windows Temporary Files, Windows Log Files, Recent Documents, Run Histories, Windows XP Old Prefetch Data, Other Explorer MRUs, Menu Order Cache, more.\n\nFor Web Browsers\n\n    Internet Explorer - Internet Cache, Internet Cookies, Internet History, Auto Saved Form Information, Download Folder, Typed URLs, Index.dat\n    Firefox/Mozilla - Internet Cache, Internet Cookies, Internet History, Saved Form Information, Saved PassWord\n    Opera - Internet Cache, Internet Cookies, Internet History, Typed URLs\n    Safari - Internet Cache, Internet Cookies, Internet History, Auto Saved Form Information\n    Google Chrome - Internet Cache, Internet Cookies, Internet History, Saved PassWord \n\nFor Applications\nWindows Media Player, Real Player, Quicktime Player, SWiSH, Paint Shop Pro, Adobe Flash Player, Axialis IconWorkshop, Media Player Classic, VirtualDub, Yahoo Toolbar, Google Toolbar, eMule, Sound Forge, Windows Live Messenger, Sun Java, GetRight, Download Accelerator Plus, ZoneAlarm (Logs), CuteFTP, Adobe Acrobat, Adobe ImageReady, Adobe Photoshop, Office 2007, Fireworks, Dreamweaver, Nero Burning ROM, Microsoft Visual Studio, Paint.NET, OpenOffice, ImgBurn, UltraEdit, Symantec AntiVirus, Ad-Aware SE, Webroot SpySweeper, Driver Cleaner Pro, WinISO, WinZip, WinRAR, 7-Zip, Alcohol 120%, CA Anti-Virus, Microsoft AntiSpyware, Ewido Anti-Malware (Log), Windows Defender, IZArc, Inno Setup, more.\n\nAdditional Features:\n\n    Uninstaller A full featured Â´UninstallerÂ´ for you to uninstall, repair and update softwares\n    Startup Manager With the help of Â´Startup ManagerÂ´ you can enable or disable the applications which run when Windows startup \n\nWhatÂ´s New in version 1.3.1.621:\n\n    New feature Â´Clean up deleted items from Windows Recycle Bin according to days automaticallyÂ´\n    New feature to show detailed analyzing/cleaning report of Windows Recycle Bin\n    Improved the cleaners for Windows Recycle Bin\n    Add new entries Â´lbl_RecycleBinÂ´, Â´lbl_RecycleBin2Â´ and Â´msg_RecycleBinExÂ´ to language file\n    Some other small tweaks \n\n","torrent":{"xt":"urn:btih:4ecb486da67c4d48b766bf0fd1366268814c7196","amp;dn":"FCleaner+-+2010kaiser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ecb486da67c4d48b766bf0fd1366268814c7196","infoHashBuffer":{"type":"Buffer","data":[78,203,72,109,166,124,77,72,183,102,191,15,209,54,98,104,129,76,113,150]},"announce":[],"urlList":[]}}