{"title":"Fiebre (1972) VHSRip Isabel Sarli","uid":7478753,"size":762899402,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4f45d623017ce6d107a4f9d53f795282866b122b&amp;dn=Fiebre+%281972%29+VHSRip+Isabel+Sarli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"etheryus","files":-1,"time":1343364474,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0065719/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0065719/&lt;/a&gt;\n\n\nArmando Bo was an Argentinian actor and sportsman who started producing directing in the fifties. He was a good director but nothing special, until he met Isabel Sarli who was Miss Argentina of 1954. Their first movie together &quot;El trueno entre las hojas&quot; had an amazing success mostly because Isabel came out naked. Bo, who at the time was already Sarli's lover, made her his partner in production and started a long series of movies with Isabel getting naked in an each time more abstract frame. In 1968 and 1969, the duo gets their best (something like Sgt. pepper era for the Beatles) and produced their three masterpieces: &quot;Carne&quot;, &quot;Fuego&quot; y &quot;Fiebre&quot;, three films that are unique in the world, three films that influenced John Waters big time and were a clear precedent to his revolutionary work, three film that are, to me, the closer that Argentinian cinema got to a national cinema style, but in Argentina Bo was forbidden and imprisoned many times for obscenity. &quot;Fiebre&quot; is an amazing piece of experimental film-making. The idea is &quot;Isabel (or her character, its the same) falls in love with a horse&quot;. An so we see shots of her touching her breast over imposed with shots of the horse's organ for an hour nd a half. It sounds boring. It's not. It sounds cheap. Maybe, but Armando Bo's movies have an atmosphere of strangeness, he created new strange worlds in his movies and it's time to give him (and her) the place that they deserve in film history.","torrent":{"xt":"urn:btih:4f45d623017ce6d107a4f9d53f795282866b122b","amp;dn":"Fiebre+%281972%29+VHSRip+Isabel+Sarli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f45d623017ce6d107a4f9d53f795282866b122b","infoHashBuffer":{"type":"Buffer","data":[79,69,214,35,1,124,230,209,7,164,249,213,63,121,82,130,134,107,18,43]},"announce":[],"urlList":[]}}