{"title":"HISTORY OF POP AND ROCK MUSIC - part 399","uid":7506913,"size":564135658,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:52c18c7d8441c381f9d0d9cce866ea952556c384&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+399&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pupovaczlatko","files":-1,"time":1344204329,"description":"   \n\n\n                    PART  399\n\n\n          ABSOLUTE  - Sebastian (2007)\n          MARINA AND THE DIAMONDS - Primadonna (2012)\n          MARINA AND THE DIAMONDS - Primadonna (2012)   (Acoustic version)\n              \n\n\n\n\n     &quot;Sebastian&quot; is a song written and performed by Steve Harley &amp; Cockney Rebel, originally released as a single in November 1973. It was an immediate success in Europe, although it failed to score in the UK Singles Chart. Absolute performed a cover of the song (2007)\n\n\n    &quot;Primadonna&quot; is a song by Welsh singer-songwriter Marina and the Diamonds from her second studio album, &quot;Electra Heart&quot; (2012). It was released as the album's official lead single on 20 March 2012.  On 22 April 2012, &quot;Primadonna&quot; debuted at number eleven on the UK Singles Chart, selling 25,337 copies, giving Diamandis her highest-charting single in the UK to date. The following week it slipped to number thirteen but in its third week the single climbed to number eleven, its second week at that position. &quot;Primadonna&quot; became Diamandis's first single to spend five consecutive weeks inside the UK top twenty. In its third week on the Irish Singles Chart, &quot;Primadonna&quot; rose to a new peak of number three, becoming Diamandis's highest-charting single in Ireland as well. The song has peaked at number four in New Zealand, her first single to chart in the country.\n       The music video was directed by Casper Balslev and shot in Copenhagen.The video premiered on 12 March 2012, the same day as the song's release to UK radio. On 20 April 2012, Diamandis offered for download an acoustic version of &quot;Primadonna&quot; and two other acoustic song versions, packaged as a digital EP.","torrent":{"xt":"urn:btih:52c18c7d8441c381f9d0d9cce866ea952556c384","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+399","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52c18c7d8441c381f9d0d9cce866ea952556c384","infoHashBuffer":{"type":"Buffer","data":[82,193,140,125,132,65,195,129,249,208,217,204,232,102,234,149,37,86,195,132]},"announce":[],"urlList":[]}}