{"title":"Alcohol120% 2.0.2.3931 Final By bobiras2009","uid":7599261,"size":10728191,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:53b77367ac982108324317bb1dbdbd9bfefca56e&amp;dn=Alcohol120%25+2.0.2.3931+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346769074,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nAlcohol 120% is the CD &amp; DVD emulation and recording program that will allow users to easily copy a visible and an invisible disc.\n\nAlcohol 120% enables users to create 31 virtual CD &amp; DVD-ROM to play discs without needing a physical disc, it also enables users to copy CD &amp; DVD to CD-R / CD-RW / DVD-R / DVD-RW / DVD-RAM / DVD+RW. Alcohol 120% combines all functions of Alcohol 52% (CD &amp; DVD emulation software).\n\nAlcohol brings a new meaning to the word multimedia! It is without a doubt a leader in its class, bringing the ability to emulate and record CDs and DVDs together into one amazingly easy to use software program.\n\nUsing the latest technology the program is constantly being developed and improved to add new features, allowing it to maintain it's position as a leading software package.\n\nImagine being able to store your most used CDs as images on your computer and just call them up at the click of a button! And then run them at 200x the speed of some CD drives and without requiring the CD itself! How about being able to make a backup of that CD onto another CD either using the CD itself or just using the image you have created? This is what Alcohol allows you to do and much more.\n\n\n\nSystem Requirements\n\nÂ· Intel/AMD based PC\nÂ· Windows 95 or Windows NT users, please pay attention as follows:\nÂ· Must install Internet Explorer 5.0 or later version\nÂ· Window NT 4.0 must update to Service Pack 5 or later version\nÂ· Windows 95 must be OSR2 or later version\nÂ· 32MB (or more) of RAM\nÂ· Internet connection\nÂ· 10GB (or more) hard disk (a 74 minute CD image requires 650-700MB)\nÂ· One or more bus-mastering SCSI and/or ATAPI buses\nÂ· One or more CD-ROM/DVD-ROM drives. You can use a CD/DVD recorder as a reader with sufficient hard disk space.\nÂ· One or more CD recorders (if you install more than 2 CD recorders, 700MHz CPU and 128MB RAM is recommended).\nÂ· One or more DVD recorders (if you want to burn DVD format)\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:53b77367ac982108324317bb1dbdbd9bfefca56e","amp;dn":"Alcohol120%25+2.0.2.3931+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53b77367ac982108324317bb1dbdbd9bfefca56e","infoHashBuffer":{"type":"Buffer","data":[83,183,115,103,172,152,33,8,50,67,23,187,29,189,189,155,254,252,165,110]},"announce":[],"urlList":[]}}