{"title":"The Battle for Wesnoth v1.10.3 for Mac OSX","uid":7479365,"size":343218971,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:553ce5979727b25c3e80354808a2ac9f9c923e0f&amp;dn=The+Battle+for+Wesnoth+v1.10.3+for+Mac+OSX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CCnOSnBT","files":-1,"time":1343386692,"description":"The Battle for Wesnoth is a turn-based tactical strategy game with a high fantasy theme.\n\nBuild up a great army, gradually turning raw recruits into hardened veterans. In later games, recall your toughest warriors and form a deadly host against whom none can stand! Choose units from a large pool of specialists, and hand-pick a force with the right strengths to fight well on different terrains against all manner of opposition.\n\nWesnoth has many different sagas waiting to be played out. Fight to regain the throne of Wesnoth, of which you are the legitimate heir... step into the boots of a young officer sent to guard a not-so-sleepy frontier outpost... vanquish a horde of undead warriors unleashed by a foul necromancer, who also happens to have taken your brother hostage... guide a band of elvish survivors in an epic quest to find a new home.\n\n200+ unit types. 16 races. 6 major factions. Hundreds of years of history. The world of Wesnoth is absolutely huge and limited only by your creativity - make your own custom units, compose your own maps, and write your own scenarios or even full-blown campaigns. You can also challenge up to 8 friends - or strangers - and fight in epic multi-player fantasy battles. \n   &lt;a href=&quot;\nhttp://www.wesnoth.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.wesnoth.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:553ce5979727b25c3e80354808a2ac9f9c923e0f","amp;dn":"The+Battle+for+Wesnoth+v1.10.3+for+Mac+OSX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"553ce5979727b25c3e80354808a2ac9f9c923e0f","infoHashBuffer":{"type":"Buffer","data":[85,60,229,151,151,39,178,92,62,128,53,72,8,162,172,159,156,146,62,15]},"announce":[],"urlList":[]}}