{"title":"POtHS - Prophetic Times - 82 - Is God Great","uid":7575089,"size":2925573066,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:55b0906ff76f1b77cb3da390528bd1cab166d1eb&amp;dn=POtHS+-+Prophetic+Times+-+82+-+Is+God+Great&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":-1,"time":1346094556,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Prophetic Times - 82 - Is God Great - Debate\n\nPOtHS Comments on This one: Seems that Yahweh wins again in this debate.\n\nIs God Great? A Debate film Product Description\n\nIs God Great A Debate review Christopher Hitchens, who made his opinion clear on this topic in 2007 with his book &quot;God Is Not Great,&quot; maintains not only that God fails to be great, but also denies his existence entirely. Is God Great A Debate DVD Professor Lennox, a convinced Christian and scientist, respectfully disagrees This event features a unique blend of both planned remarks and fast-paced dialogue that tackles these issues in a refreshing and informative light. Is God Great A Debate movie It is sure to offer insights to all. Is God Great A Debate video\n\nIn this informative program, two scholars with opposing views on the existence and nature of God square off against one another for an intense spiritual debate. Is God Great A Debate film Defending atheism is journalist Christopher Hitchens, author of the 2007 tome GOD IS NOT GREAT, while John Lennox - a professor and scientist at Oxford University in England - respectfully refutes Hitchens's points, defending Christian theology and faith.\n\n\nShorts\nSigns of the Times\nSIN-ister Clips\nThe Holy Spirit\n\nThis is dedicated to my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\n\nThe Entire Collection can be found here: \n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\n","torrent":{"xt":"urn:btih:55b0906ff76f1b77cb3da390528bd1cab166d1eb","amp;dn":"POtHS+-+Prophetic+Times+-+82+-+Is+God+Great","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55b0906ff76f1b77cb3da390528bd1cab166d1eb","infoHashBuffer":{"type":"Buffer","data":[85,176,144,111,247,111,27,119,203,61,163,144,82,139,209,202,177,102,209,235]},"announce":[],"urlList":[]}}