{"title":"ACTV Windows 8 Activation Customization Pack By bobiras2009","uid":7599014,"size":26809759,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:577708bcb38074b532c3e2ec5409e815209371e6&amp;dn=ACTV+Windows+8+Activation+Customization+Pack+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346719929,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\n\nThis Pack contains new applications for Offline Activation, Unlocking the (personalization) feature, Dozens of Customization's such as adding the start menu and button, large MAK Keys list, Pro and Enterprise Keys, Watermark and Notification removal and much more. Most of the application were created after August 21st and are only available in this Pack. For those of you waiting on a KMS server to go online before Oct. 26th, may find this Pack very useful.\n\nThese applications will work for Windows 8 RTM Build 9200 both Core and Pro, Windows Enterprise, and Both older builds. This Pack and all of it's contents have been checked for Virus's, Malware, Trojans, and Third Party Apps and are found to be 100% clean and safe. Please keep in mind, due to the way some Activation Apps are written, certain Anti-Virus software will alert, or try to stop them from running even though they are safe.\n\nIt is recommended that you make any exception needed to use any application when this happen's [ignore any warning from your antivirus].\n\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:577708bcb38074b532c3e2ec5409e815209371e6","amp;dn":"ACTV+Windows+8+Activation+Customization+Pack+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"577708bcb38074b532c3e2ec5409e815209371e6","infoHashBuffer":{"type":"Buffer","data":[87,119,8,188,179,128,116,181,50,195,226,236,84,9,232,21,32,147,113,230]},"announce":[],"urlList":[]}}