{"title":"A Convergence of Birds by Jonathan Safran Foer (Editor)","uid":7583159,"size":1396336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58325a3d5479856459950f398274a5644bc642fd&amp;dn=A+Convergence+of+Birds+by+Jonathan+Safran+Foer+%28Editor%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1346340895,"description":"A Convergence of Birds: Original Fiction and Poetry Inspired by Joseph Cornell (Kindle Edition)\n\nPublication Date: June 28, 2001\n\nJonathan Safran Foer, acclaimed young author of Everything is Illuminated, fell in love with the work of Joseph Cornell while still a student at Princeton University and embarked on an ambitious project: to interest some of America's best-known writers to create original fiction and poetry inspired by the boxed collages of this beloved artist. Beautifully designed and produced--with over 20 tipped-on color plates, some of which are reproduced here for the first time--this original literary anthology will please readers and art lovers alike.\n\nConvergence of Birds_ Original Fiction and Poetry Inspired by the Work of Joseph Cornell, A - Jonathan Safran Foer (Editor).mobi\n\nJonathan Safran Foer has long had a passion for the work of the twentieth-century American assemblage artist Joseph Cornell. Inspired by Cornell s avian-themed boxes, and suspecting that they would be similarly inspiring to others, Foer began to write letters.\n\nThe responses he received from luminaries of American writing were nothing short of astounding. Twenty writers generously contributed pieces of prose and poetry that are as eclectic as they are imaginative, and the result is a unique collaborative project and one of the most significant engagements of literature with art for many years.","torrent":{"xt":"urn:btih:58325a3d5479856459950f398274a5644bc642fd","amp;dn":"A+Convergence+of+Birds+by+Jonathan+Safran+Foer+%28Editor%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58325a3d5479856459950f398274a5644bc642fd","infoHashBuffer":{"type":"Buffer","data":[88,50,90,61,84,121,133,100,89,149,15,57,130,116,165,100,75,198,66,253]},"announce":[],"urlList":[]}}