{"title":"Astro Flash Creator v2.02  Including Crack [iahq76]","uid":7571168,"size":9592574,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5872180870aef8056fb545c158ee30a3bc387ef7&amp;dn=Astro+Flash+Creator+v2.02++Including+Crack+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TorDigger","files":3,"time":1345995288,"description":"ASTRO Flash Creator\n \nWelcome to ASTRO Flash Creator\n \nASTRO Flash Creator (AFC) is a creation by Patrick Jansen Design and Goldshell Digital Media. What can ASTRO Flash Creator do for you? ASTRO Flash Creator creates real-time awesome Flash text effects, which you then can use in your Adobe/Macromedia Flash work, or use directly on your web site. \n\nYour text effect can be further spiced up by adding Flash background and foreground effects. There's a choice from more than 450 (!!) or more than 1350 WITH PJ plugin for AFC and SUPREME4 plugin for AFC and Elite plugin for AFC text effects and over 80 other Flash effects. There is no other Flash text effects program which can offer you such a large number of effects!\n \nMoreover, ASTRO Flash Creator can add background pictures and sound effects to your Flash file.\n \nASTRO Flash CreatorÂ´s simple interface turns the creation of professional Flash text effects and banners into a very simple task. And with a choice of hundreds of text, foreground and background effects, ASTRO Flash Creator will never let you dissatisfied! \n\nThe text effects themselves can be altered by adjusting the effect parameters. Each effect can be altered in a limitless amount of ways. If you are very satisfied with your altered effect, you can &quot;bookmark&quot; it, thereby adding this as an additional effect to the ASTRO Flash Creator program. Bookmarks can be saved and even exchanged with other ASTRO Flash Creator users.\n \nOn top of being able to alter the effect according to your own creativity, ASTRO Flash Creator supports the use of plugins, which can be bought, or are sometimes given away free. These plugins can add more Flash effects, more images and more sound files to ASTRO Flash Creator\n \nASTRO Flash Creator is a creation by Patrick Jansen Design, programmed by Goldshell Digital Media. \n\nWhat can Astro do for you? Astro creates real-time awesome Flash text effects, which you then can use in your Adobe Flash work, or use directly on your web site.\n \nYour text effect can be further spiced up by adding Flash background and foreground effects. There's a choice from more than 450 (!!) text effects and over 80 other Flash effects. \n\nSupported OS:\n \nWindows 7/vista/xp\n \nInstallation Instructions:\n \n1. Install Program.\n2. Copy content from crack folder and paste into default installation directory.\n3. Done, Enjoy.\n ","torrent":{"xt":"urn:btih:5872180870aef8056fb545c158ee30a3bc387ef7","amp;dn":"Astro+Flash+Creator+v2.02++Including+Crack+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5872180870aef8056fb545c158ee30a3bc387ef7","infoHashBuffer":{"type":"Buffer","data":[88,114,24,8,112,174,248,5,111,181,69,193,88,238,48,163,188,56,126,247]},"announce":[],"urlList":[]}}