{"title":"Advanced Calculator APK","uid":7490241,"size":332973,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:58cf2740f243d4d0d17026017172471b0b9dde6a&amp;dn=Advanced+Calculator+APK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lolipity","files":1,"time":1343710557,"description":"This torrent contains a calculator application that the following features. You can get it from the market place as well \nplay.google.com/store/apps/details?id=com.prasana.pkg.calculator\nFor the benefit of torrent users, I'm uploading this here as well. Please comment after you give it a try !!\n\nFEATURES\n\n- calc in deg or rad \n- sin, cos, tan, abs, pow, e^x, sqr, cube, cbrt, sqrt\n- Customization keyboards ( Yeah this is a right hand world. That why this calculator features a left hand , left hand ergonomic keyboards (Total 6 keyboard types to try from)\n- while it is advisable not to disable stretching for tablets, it is highly recommended for 4.7&quot; screens\n- you can send me a mail directly from the app by pressing the feedback button. (Needs a mail program to be already installed in your phone/tablet)\n- Okay I saved this for the last. It features a new function called &quot;history&quot;. The application will remember all the calculation you have performed since the start of the session. But fear not. If it eats up your memory, you can always clear up using the clear cache button in the settings. (although you should consider buying a new phone if it can't even sustain a calc application !! )\n- Feature updates and constant development. \n- haptic feedback enabled buttons and keys. \n- keeps count of number of ( opened so that you can produce a correct query 10/10\n- customizable settings with a dedicated settings page \n- contains in built UNOBTRUSIVE ads. They are placed on top where your fingers will never reach accidentally.\n- Most importantly, new and improved button animations and haptic feedback provides the user with a classic feel.","torrent":{"xt":"urn:btih:58cf2740f243d4d0d17026017172471b0b9dde6a","amp;dn":"Advanced+Calculator+APK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58cf2740f243d4d0d17026017172471b0b9dde6a","infoHashBuffer":{"type":"Buffer","data":[88,207,39,64,242,67,212,208,209,112,38,1,113,114,71,27,11,157,222,106]},"announce":[],"urlList":[]}}