{"title":"Prototype 2 - FLT [ Crack Only ][ Www.EliteDescargas.Com ]","uid":7481677,"size":17424646,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5a98e749ed488076b3f3bba97458c3e0c78a4bd6&amp;dn=Prototype+2+-+FLT+%5B+Crack+Only+%5D%5B+Www.EliteDescargas.Com+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"elitedesc","files":4,"time":1343449589,"description":"In Their 26th Year Of Glory, FairLight Released #1038\n\nPrototype 2 (c) Activision Blizzard\n\n:  Supplied by: FAIRLIGHT            : : Release Date: 28/07/2012\nCracked by:  FAIRLIGHT              Game Type:    Action\nPackaged by: FAIRLIGHT              Image Format: ISO\n-----\nDISCS: 2 DVDs                      Protection: Steam\n\nSystem Requirements : (S)-1-phenylpropan-2-amine\n\nGame information\n=================\n\nThe sequel to Radical Entertainment's best-selling open-world  action  game\nof 2009,  PROTOTYPE  2  takes  the  unsurpassed  carnage  of  the  original\nPROTOTYPE  and  continues  the  experience  of  becoming  the  ultimate\nshape-shifting weapon. You are Sgt James Heller, husband to a deceased wife\nand child and a soldier left simply to die\n\nAs the games all-new infected protagonist,  players  will  experience  Sgt\nJames Heller cutting a bloody swathe through the wastelands  of  post-viral\nNew York Zero. Equipped with unparalleled new shapeshifting powers, players\nwill gradually build a  vast  genetic  arsenal  of  deadly  new  biological\nweapons and abilities as they hunt, kill and consume their way  toward  the\nultimate goal - to kill.. Alex..Mercer Are you ready to murder your maker\n\nFeatures\n\nThe Power of Tendrils: Prepare to unleash the ultimate form of shape\nshifting devastation. The incredible new Tendril power lets you lift\nand tear apart cars and military vehicles, ensnare powerful infected\nbeasts and even rip large groups of enemies to shreds\nCustomise your Killer: Prototype 2 delivers the raw power of character\ncustomisation back into your hands, allowing you to creatively mi n\nmatch a devastating range of mutation perks into their ultimate\nPrototype.\nHunt-Kill-Become: Imagine having the power to track down any enemy by\nunleashing a powerful sonar-pulse from your body Disguise yourself\nas a soldier, scientist or anyone at all whilst absorbing their\nmemories and acquiring new abilities\nBring Down the Devil: Gamers will experience the epic story or Sgt\nJames Heller attempting to take down the devil himself..Alex\nMercer. Unravelled against the explosive backdrop of New\nYork Zero and it various factions warring for control\nover the infection, Prototype 2 sets the stage for\nthe ultimate showdown &quot;event&quot; videogame of 2012\nSize Does Matter: Prototype 2 will redefine gamers expectation\nof over the top open world action. Witness the building size\ninfected behemoths bull rushing entire streets, whilst\ngliding and parkouring across swarms of highly trained\nBlackwatch soldiers\n\nInstallation Information\n=========================\n\nBurn or mount\nInstall the game using our installer in Fairlight on Disc 1\nCopy the crack manually from Disc 2 or autoapply it at\nthe end of the setup\nPlay the game\n\nNOTE: As usual, block the game exe in your firewall\n\n/TEAM FAiRLIGHT\n\n------------------------------\nIs only the crack, an update is also needed, will be up soon.\nFull iso will be uploaded asap.","torrent":{"xt":"urn:btih:5a98e749ed488076b3f3bba97458c3e0c78a4bd6","amp;dn":"Prototype+2+-+FLT+%5B+Crack+Only+%5D%5B+Www.EliteDescargas.Com+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a98e749ed488076b3f3bba97458c3e0c78a4bd6","infoHashBuffer":{"type":"Buffer","data":[90,152,231,73,237,72,128,118,179,243,187,169,116,88,195,224,199,138,75,214]},"announce":[],"urlList":[]}}