{"title":"Wargame European Escalation (2012) [PCDVD][MULTi7]","uid":7431487,"size":8001652138,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5bf00b5c70853b1232fa84fdb9e671f6e51bb67b&amp;dn=Wargame+European+Escalation+%282012%29+%5BPCDVD%5D%5BMULTi7%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":2,"time":1341958395,"description":"Wargame European Escalation (2012) [PCDVD][MULTi7]\n &lt;a href=&quot;\nhttp://www.3djuegos.com/11324/wargame-european-escalation/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.3djuegos.com/11324/wargame-european-escalation/&lt;/a&gt;\n\nYear: 2012\nGenre: Strategy (Real-time) / 3D\nDeveloper: Eugen Systems\nPublisher: Focus Home Interactive\nPlatform: PC\n\nPublication Type: License\nLanguage: Russian (RUS), English (ENG), German (DE), French (FR), Italian (IT), Spanish (IS)\nLanguage: English (ENG), German (DE), French (FR)\nTablet: Is present (RELOADED)\nSize: 7,11 GB\n\nDescription: Events Wargame: European Escalation develop in the period from 1975 to 1985. The two opposing sides are the NATO (the U.S. and Western Europe) and the Warsaw Pact (the Soviet Union and Eastern Europe). Fictional battles showing the possible course of events. Since both sides know that the beginning of the nuclear bombing would lead to the inevitable retaliation, and environmental catastrophe, being fierce fighting in Europe. It is these battles, and are the basis of single-player campaign.\n\nWargame: European Escalation is a real-time strategy with the use of IRISZOOM, which allows you at any time to display on the screen almost all of the battlefield, or to bring the camera to the ground so close that it will be possible to consider the shadows of the foliage on the tanks. Besides startling detail graphics, Wargame: European Escalation used in virtually all services EugenNet, which adds a wide range of networking opportunities.\n\nFeatures:\n- Large-scale strategy of the recognized masters of the genre, studio Eugen Systems, which gave players the famous Act of War: Direct Action, and RUSE\n- Huge photorealistic maps for large-scale battles involving hundreds of different units - from the infantry and heavy armored tanks to helicopters and airplanes.\n- The deep strategic component that takes into account the mass of various factors - such as the type of ammunition the soldiers, supplies of fuel for military vehicles, military supply routes, weather conditions, topography.\n- System IRISZOOM, allowing instant overview of the battlefield to change - with a global view of the map to a demonstration of what is happening at any point from close range.\n- An exciting campaign is based on the realities of the Cold War and at the same time offering direct the course of history in a different channel.\nMultiplayer mode with a maximum capacity up to 8 players, supports many features of network service EugenNet.\n\nSystem requirements:\nOperating System: Microsoft Windows XP (SP3) / Windows Vista (SP1) / Windows 7\nProcessor: Intel Pentium Core 2 Duo 2.4 GHz or AMD Athlon X2 2.8 GHz\nMemory: 1 GB\nVideo Card: 256 MB of video memory and support for Shader 3.0\nSound Card: DirectX 9.0c compatible\nFree space on hard disk: 8 GB\n\nInstalling the game:\nA. Establish\nTwo. Copy the contents of Crack folder from the disk image to a folder with a game\nThree. Start the game\n4. Click &quot;Manual activation&quot; and &quot;Back&quot;\nFive. In an open keygens click on &quot;Generate&quot; and copy the generated activation key\n6. Expand the activation window, click on &quot;Manual activation&quot; and use the activation code generated from the keygen to complete the activation process\n7. Play","torrent":{"xt":"urn:btih:5bf00b5c70853b1232fa84fdb9e671f6e51bb67b","amp;dn":"Wargame+European+Escalation+%282012%29+%5BPCDVD%5D%5BMULTi7%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bf00b5c70853b1232fa84fdb9e671f6e51bb67b","infoHashBuffer":{"type":"Buffer","data":[91,240,11,92,112,133,59,18,50,250,132,253,185,230,113,246,229,27,182,123]},"announce":[],"urlList":[]}}