{"title":"(Dragon Ball Z IN Hebrew ( 291","uid":7531704,"size":60197733788,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5c77e92a198abf28d4e92373b2b73b45efb38157&amp;dn=%28Dragon+Ball+Z+IN+Hebrew+%28+291&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"akonsharon9","files":291,"time":1344944709,"description":"Earth's defender Goku learns that he is from another planet. Now Goku and his allies must defend the planet from an onslaught of new extraterrestrial enemies.\n\n\nThe series begins with a young monkey-tailed boy named Goku befriending a teenage girl named Bulma. Together they go on a quest to find the seven Dragon Balls, which grant the user any wish they desire. Goku later undergoes rigorous training regimes under the martial artist Master Roshi in order to fight in the World Martial Arts Tournament, a competition that attracts the most powerful fighters in the world. During his training with Roshi, he meets a Shaolin monk named Krillin, who starts out as Goku's rival classmate; however, they soon become best friends. Outside the tournaments, Goku faces diverse villains such as Emperor Pilaf, the Red Ribbon Army, and King Piccolo. Several of the enemies and rivals Goku encounters eventually become his allies, including the desert bandit Yamcha, the assassin Tien Shinhan, the samurai Yajirobe, and King Piccolo's offspring/reincarnation Piccolo Jr.\nAs a young adult, Goku meets his older brother Raditz, who reveals to him that they are members of a nearly extinct extraterrestrial race called the Saiyans. The Saiyans had sent Goku (originally named &quot;Kakarot&quot;) to Earth as an infant to conquer the planet for them, but he suffered a severe head injury soon after his arrival and lost all memory of his mission, as well as his blood-thirsty Saiyan nature. Goku refuses to help Raditz continue the mission, and is soon killed along with Raditz in battle; however, he is revived a year later by the Dragon Balls. He then begins to encounter other enemies from space, most notably the Saiyan prince Vegeta, who becomes his rival and eventually another ally. Goku also encounters Frieza, the galactic tyrant responsible for the destruction of almost the entire Saiyan race, whose actions cause Goku to transform into a legendary Super Saiyan. After a protracted battle on the planet Namek, Goku defeats Frieza, avenging the lives of billions across the galaxy.\nSome time later, a group of androids from the former Red Ribbon Army appear, seeking revenge against Goku. During this time, an evil life form called Cell emerges and, after absorbing two of the androids to achieve his &quot;perfect form,&quot; holds his own fighting tournament to decide the fate of the Earth entitled the Cell Games. However, Cell is eventually defeated by Goku's son Gohan in a desperate Kamehameha wave struggle. Seven years later, Goku and his allies are drawn into yet another battle for the universe against a magical being named Majin Buu. After numerous battles, Goku destroys Buu with his ultimate attack; the Spirit Bomb. Ten years later, at another World Martial Arts Tournament, Goku meets Buu's human reincarnation, Uub. Leaving the match between the two of them unfinished, Goku takes Uub away on a journey to train him.\n","torrent":{"xt":"urn:btih:5c77e92a198abf28d4e92373b2b73b45efb38157","amp;dn":"%28Dragon+Ball+Z+IN+Hebrew+%28+291","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c77e92a198abf28d4e92373b2b73b45efb38157","infoHashBuffer":{"type":"Buffer","data":[92,119,233,42,25,138,191,40,212,233,35,115,178,183,59,69,239,179,129,87]},"announce":[],"urlList":[]}}