{"title":"Espionage 3.0.2 + Crack","uid":7589439,"size":3470339,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:5d1742189366fd777e3b8a12803caae955a1482f&amp;dn=Espionage+3.0.2+%2B+Crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"downloaditfreenow","files":1,"time":1346457847,"description":"Espionage 3.0.2 + Crack.\n\n\nDescription \n\nEspionage: state of the art data security for everyone.\nMore than just encryption, Espionage 3 has been rewritten from the ground-up to combine folder encryption with layers of plausible deniability through a redesigned and simplified user interface. We've taken all the lessons that we've learned from previous versions to bring Espionage 3 to a new level. Read more...\n\nEncryption is nice, but what happens if you're forced to give up your password? Espionage 3 protects you even in this situation, by giving you the ability to have multiple master passwords, each protecting a unique set of folders.\n \nEncrypt Folders\n\nProtect individual folders and easily access them from the menubar.\n \nFolder Settings\n\nSettings like auto-lock and maintainence of the encrypted data at your fingertips.\n \nPlausible Deniability\n\nAs many master passwords as you want, each protecting a unique set of folders.\n \nDisk Image Size Control\n\nEasy control over the size of disk images on the hard drive.\nMaximum Data Protection\nEspionage uses scrypt and works in harmony with FileVault for maximum data protection.\nSpotlight Integration\nBuilt to work great with Spotlight search.\nWorks with your favorite backup and synchronization software\nDesigned to work efficiently with third-party backup services like Time Machine and online-backup services like Dropbox.\nARC and Grand Central Dispatch\nMakes use of latest OS X technologies like ARC and Grand Central Dispatch.\nAES-256 Bit Encryption + Scrypt\nEspionage uses powerful AES-256 encryption to protect your files. Even the National Security Agency (NSA) has stated that it can be used to protect TOP SECRET classified information. In addition, it also makes use of the incredibly powerful scrypt internally instead of relying on OS X's weak keychain.\n\n\nNew Features\n\nVersion 3.0.2 (7/07/12)\nChanges since 3.0.1\nIMPROVED: Signed with Developer ID for Mountain Lion compatibility\nFIXED: Crash in autounlock\nFIXED: Spanish translation in english language\n","torrent":{"xt":"urn:btih:5d1742189366fd777e3b8a12803caae955a1482f","amp;dn":"Espionage+3.0.2+%2B+Crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d1742189366fd777e3b8a12803caae955a1482f","infoHashBuffer":{"type":"Buffer","data":[93,23,66,24,147,102,253,119,126,59,138,18,128,60,170,233,85,161,72,47]},"announce":[],"urlList":[]}}