{"title":"hare","uid":7459061,"size":1511784,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5de28aa08650dc7f32024cb939c1097be3529d1f&amp;dn=hare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cowboy1966","files":-1,"time":1342750534,"description":"Hare 1.5.1 : the best acceleration utility for PC.\n\nWith Hare, accelerate any computer up to 300% simply install Hare and be accelerated.\n\n\n--------------------------------------------------------------------------------\n\nAccelerate your computer automatically\nHare doesn't use &quot;classic&quot; acceleration methods, such as a few registry tweaks, and few modified settings. Hare will improve performance no matter what software you use, thanks to a revolutionary compact 88-bit Kernel, which accelerates common system instructions. In addition to that, Hare has a very complete CPU Tasking technology designed to fit your needs; Hare determines automatically what program you use, and how much CPU it must allocate to it.\n\n\nMem Doubler or intelligent RAM management\nThere are dozens of RAM defragmentation software for PC; forget them all. Mem Doubler has a unique function which is able to determine when your RAM needs to be defragmented! Just tick a checkbox, and Mem Doubler will adapt to your computing style.\n\n\nAutomatic RAM preservation\nHow can you run over thirty heavy programs such as Adobe Photoshop or Macromedia Dreamweaver with only 128Mb of RAM? With Hare, and its &quot;Automatic RAM preservation&quot; function: it distributes RAM to programs when they need it, not when they want it. [Example]\n\n\nAccelerate games \nWith a set of pre-programmed instructions compatible with nearly all PC games, GameZap will increase your game's frames per second by near 10% in most cases. And GameZap is compatible with OpenGL!\n\n\nEasy to use\nHare features a state-of-art interface, extremely easy to use. Our interface fully respects Microsoft's guidelines and is very intuitive. Most of the time, you won't have to configure Hare, since it works in background, but if you want for example to check out how much free memory you have, or if you feel like fine-tweaking Hare, you'll be delighted by its ease of use, eye-candy icons and comprehensive wizards.\n\n\nAnd much more \nHare features other great functions, such as WinOptimize, a wizard that automatically cleans and optimizes Windows! It is impossible to list all of Hare's functions on a single webpage, so why don't you get it now and find out what it feels to have a really fast computer?\n &lt;a href=&quot;\nhttp://www.dachshundsoftware.com/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dachshundsoftware.com/index.html&lt;/a&gt;\n\nPlease seed and share","torrent":{"xt":"urn:btih:5de28aa08650dc7f32024cb939c1097be3529d1f","amp;dn":"hare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5de28aa08650dc7f32024cb939c1097be3529d1f","infoHashBuffer":{"type":"Buffer","data":[93,226,138,160,134,80,220,127,50,2,76,185,57,193,9,123,227,82,157,31]},"announce":[],"urlList":[]}}