{"title":"How Muslim Spies and Subversives have Penetrated Washington.epub","uid":7572976,"size":2709440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ecd0ddf874de7b8835bc02f60483f5356c50fdf&amp;dn=How+Muslim+Spies+and+Subversives+have+Penetrated+Washington.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cowboy1966","files":-1,"time":1346040988,"description":"Paul Sperry, \n\n\n&quot;Infiltration: How Muslim Spies and Subversives have Penetrated Washington&quot; \n\n\nTh.mas N.lson | 2008 | ISBN: 1595552480, 1595550038 | 384 pages | epub, mobi | 2,6 + 1,5 MB \n\nAs Americans continue to worship at the altar of cultural diversity and endorse religious tolerance for tolerance sake, Muslims masquerading as &quot;moderates&quot; have insinuated themselves into the very fabric of American society, taking advantage of our blind trust and gaining footholds in our education system, government, workplace, law enforcement, and military. In this startling book, investigative journalist Paul Sperry uses revealing new interviews and classified documents to courageously explain how, for the past thirty years, these Islamist extremists have been covertly working to destroy our constitutional government and the Judeo-Christian ethics on which our nation was built. Their goal, according to Sperry, is to replace the U.S. Constitution with the Quran and turn America into an Islamic state. And, as Sperry details point-by-point, they have been unwittingly aided in their sinister aims by the politically correct media, government, and citizens, who don't fully understand the dangers of the Muslim faith.\n \nInfiltration explodes the facade of moderation and patriotism that Muslim scholars, imams, clerics, businessmen, and other leaders in the burgeoning Muslim community in America have conveyed in the wake of the 9/11 terrorist attacks. In reality, the Muslim establishment that publicly decries the radical fringe-represented by al-Qaida's brand of Islam known as Wahhabism, the official religion of Saudi Arabia-is actually a part of it. The only difference is that they use words and money instead of bombs to accomplish their goals. \nNow, thanks to Sperry's peerless research, piquant prose, and forthright presentation, their cover is blown. He will not only make readers forget nearly everything they've been told about these &quot;moderate&quot; and &quot;mainstream&quot; leaders, he will expose the true agenda of these &quot;moderate&quot; and &quot;mainstream&quot; leaders, and he will explain the full scope of the dangerous threat of Islam in America.\n \nWith everyone still on edge after 9/11, this book will garner wide interest, appealing specifically to people interested in current events and/or religion. Additionally, the book will appeal strongly to women whose roles, values, and rights are greatly threatened by fundamentalist Islam.\n ","torrent":{"xt":"urn:btih:5ecd0ddf874de7b8835bc02f60483f5356c50fdf","amp;dn":"How+Muslim+Spies+and+Subversives+have+Penetrated+Washington.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ecd0ddf874de7b8835bc02f60483f5356c50fdf","infoHashBuffer":{"type":"Buffer","data":[94,205,13,223,135,77,231,184,131,91,192,47,96,72,63,83,86,197,15,223]},"announce":[],"urlList":[]}}