{"title":"Dare.Dorm.12.XXX.DVDRip.XviD-XCiTE","uid":7503074,"size":2200506368,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5f777b3c3be76221bb618ffeabde749c2f4d86d6&amp;dn=Dare.Dorm.12.XXX.DVDRip.XviD-XCiTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":3,"time":1344040239,"description":"Dare Dorm 12 XXX DVDRip XviD - XCiTE\n\nCategory\tAll Sex, Legal Teen, Amateur, Reality, College Girls, Orgies, Dare Dorm's Dare Dorm Series\n \nThis latest Dare Dorm starts with a bunch of hot ass girls getting cute and stuff in the bathroom preparing for the party. These girls are hot and horny. Once in the dorm room, they start getting all crazy and sexy, so they decide to call the boys for some more interesting situations. 3 hot cuties blowing you in a room full of hotties is the mother of all pajama parties.Next up is a couple that really knows what to do, `specially the girl. This chick has a tremendous body and a pair of tits that don`t quit. Her ass is amazing, and she`s horny as fuck. Well, she gets horny as fuck once her boyfriend wakes her up super early in the morning to fuck.Real pimps and hoes! These college kids decided to throw a pimps and hoes party. These hoes were hot as hell and down to fuck whenever. After a few drinks and a few spanks in the ass, the girls were down for anything. I love college, and this party definitely makes me go back to school.In this latest submission we got a couple of college dude\n\nShocking College Sex Parties! The Hottest College Girls Having Wild Sex Parties In Their Dorms! We Don't Need No Stinking Books! Crazy College Times! Pimps And Hoes Party! Measure Up - This latest dare dorm starts with a bunch of hot ass girls getting cute and stuff in the bathroom preparing for the party. These girls are hot and horny. Once in the dorm room, they start getting all crazy and sexy, so they decide to call the boys for some more interesting situations. 3 hot cuties blowing you in a room full of hotties is the mother of all pajama parties! Just You - This couple really knows what to do, specially the girl. This chick has a tremendous body and a pair of tits that don't quit. Her ass is amazing, and she's horny as fuck. Well, she gets horny as fuck once her boyfriend wakes her up super early in the morning to fuck! Straight Pimpin - Real Pimps and Hoes! These college guys decided to throw a pimps and hoes Party. These hoes were hot as hell and down to fuck whenever. After a few drinks and a few spanks in the ass, the girls were down for anything. I love college, and this party definitely makes me go back to school! Going Down On It - In this latest submission we got a couple of college dudes planning to hook up with these two girls. One guy has a girlfriend and she's got a friend. The friend is not cute and that's where the roommate steps in and takes one for the team. At least the other roommate has big, juicy tits and that's what it's all about! \n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=u71crals5p6hwvcft5pv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=u71crals5p6hwvcft5pv.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=0r07gwzf81s1yod8deiv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=0r07gwzf81s1yod8deiv.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=c3feijz25w81fmnxpg7p.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=c3feijz25w81fmnxpg7p.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=7p6uvrwm6x0s6rp5fs3m.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=7p6uvrwm6x0s6rp5fs3m.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:5f777b3c3be76221bb618ffeabde749c2f4d86d6","amp;dn":"Dare.Dorm.12.XXX.DVDRip.XviD-XCiTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f777b3c3be76221bb618ffeabde749c2f4d86d6","infoHashBuffer":{"type":"Buffer","data":[95,119,123,60,59,231,98,33,187,97,143,254,171,222,116,156,47,77,134,214]},"announce":[],"urlList":[]}}