{"title":"Beyond Survival w/ Les Stroud (complete) DVDrip MP4","uid":7538376,"size":4042333543,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6051e1c553439708d7ad76a867a1e3c62aba534b&amp;dn=Beyond+Survival+w%2F+Les+Stroud+%28complete%29+DVDrip+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vgy12","files":-1,"time":1345152205,"description":"free streaming: http://www.ovguide.com/tv_season/beyond-survival-with-les-stroud-season-1-183741\n\nCanada's wilderness expert Les Stroud lived with ten tribes performing their daily tasks, reporting their rites &amp; rituals, explaining their beliefs, and documenting their age-old sustainable existence - before Civilization assimilates or annihilates them.\n\nSomeone nicely uploaded seven episodes in AVI format; thought I'd make these as MP4s for smaller file sizes and iPod-portability.\n\nThis show is viewable streaming on Netflix, but not available on disc, and it's $50 on Les's website (where I got it) but even pricier on Amazon.\n\nI hope you enjoy this program; these people don't deserve to fall victim to Civilized culture's insanity.\n  &lt;a href=&quot;\nhttp://lesstroud.ca/tv/les-stroud-beyond-survival&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://lesstroud.ca/tv/les-stroud-beyond-survival&lt;/a&gt;\n\n----------------\n\nDVD 1 has episodes 1-5\nDVD 2 has episodes 6-10 + extra feature \n\n----------------\n\n\n1. THE DEVIL DANCERS OF SRI LANKA\n43:57 (378mb)\nAugust 27, 2010\n&quot;Survivorman&quot; Les Stroud journeys to Sri Lanka to survive alongside men once believed to be half-human, half demon, and exorcises dark forces in a rarely-seen ritual.\n\n2. THE SEA GYPSIES OF MALAYSIA\n43:56 (378mb)\nSeptember 3, 2010\n&quot;Survivorman&quot; Les Stroud heads into open waters with the Sea Gypsies of Malaysia to spearfish in the shark-filled deep, and survive in a world of water, where storms and tsunamis threaten to wipe out the tribe, forever.\n\n3. THE SAN - BUSHMEN OF THE KALAHARI\n43:55 (378mb)\nSeptember 10, 2010\n&quot;Survivorman&quot; Les Stroud treks across the Sahara, deep into the Kalahari desert to hunt and survive with the San, a tribe that may have descended from our most ancient human ancestors, the original masters of survival.\n\n4. THE HEWA OF PAPUA NEW GUINEA\n43:53 (378mb)\nSeptember 17, 2010\n&quot;Survivorman&quot; Les Stroud journeys deep into the jungles of Papua New Guinea to raise the dead in a rarely-seen and long-forbidden ritual.\n\n5. MADAGASCAR\n43:56 (378mb)\nSeptember 24, 2010\n&quot;Survivorman&quot; Les Stroud joins remote tribes of Madagascar to fish on open waters, hunt for wild boar deep in dark forests, and participate in a sacred rite that transports him to a world far beyond our own.\n\n6. THE ARCTIC CIRCLE\n43:56 (378mb)\nOctober 1, 2010\n&quot;Survivorman&quot; Les Stroud journeys above the Arctic Circle to track game across the treacherous, icy expanse with Inuit hunters, and join the tribe in a feast of raw seal eyeball and other local &quot;delicacies.&quot;\n\n7. THE HUACHARIA OF THE AMAZON\n43:55 (378mb)\nOctober 8, 2010\n&quot;Survivorman&quot; Les Stroud journeys deep into the Amazon jungle to join the remote Huacharia tribe, learn their centuries-old survival techniques, and experience a sacred rite that tests the limits of mental endurance.\n\n8. THE ZULU OF SOUTH AFRICA\n43:55 (378mb)\nOctober 15, 2010\n&quot;Survivorman&quot; Les Stroud travels to South Africa to join the Zulu, one of the most legendary tribes in Africa and among the world's greatest masters of survival.\n\n9. Q'ERO, DESCENDANTS OF THE INKAN HIGH PRIESTS\n43:56 (378mb)\nOctober 22, 2010\n&quot;Survivorman&quot; Les Stroud climbs 17,000 up the Andes Mountains to glacial summit, where he'll become the first Westerner to witness the secret, ancient rites of the Inka.\n\n10. MENTAWAI SHAMANS OF INDONESIA\n43:56 (378mb)\nOctober 29, 2010?\n&quot;Survivorman&quot; Les Stroud journeys to the remote jungles of Borneo to learn the secrets of the Mentawai, and survive in an extreme environment where almost every form of life can kill, and even caterpillars pack a deadly bite.\n\n11. extras \n8:19 (72mb)\nunaired","torrent":{"xt":"urn:btih:6051e1c553439708d7ad76a867a1e3c62aba534b","amp;dn":"Beyond+Survival+w%2F+Les+Stroud+%28complete%29+DVDrip+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6051e1c553439708d7ad76a867a1e3c62aba534b","infoHashBuffer":{"type":"Buffer","data":[96,81,225,197,83,67,151,8,215,173,118,168,103,161,227,198,42,186,83,75]},"announce":[],"urlList":[]}}