{"title":"Pawn.Stars.S05E56.HDTV.x264-EVOLVE.avi","uid":7579238,"size":201523200,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:60cff4b955d5d9d1437e2191f9a58b869354f031&amp;dn=Pawn.Stars.S05E56.HDTV.x264-EVOLVE.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1346198523,"description":"Famous Vegas Pawn Shop &amp; their escapedes\n\n-----------------\n\nIs MP4 the new BetaMax in a VHS world?\nIs AVI a &quot;horse &amp; buggy&quot; in the automotive age?\nNow you too can be both kinds of snob!\n\nComing completely clean about two things I'm currently doing.\n\n1) You already know and trust me as MP4SUX, encoder of XVID AVI.\n\n2) I've recently begun offering x264.MP3 AVI files because ...\n\nThere is this SourceForge project - MP4Cam2AVI - Current version 2.98\n\nIt is a completely LossLess conversion process.\nI call it CC2AVI - Container Conversion To AVI.\nAs it is a description - feel free to use it as a universal moniker.\nIt allows you to &quot;pour&quot; X264 MP4 encodes into an AVI container.\nYou can choose to keep the AAC audio in the conversion.\nHowever, among others, VLC doesn't recognize AAC audio in an AVI container.\nSo I convert the audio to MP3 for universal compatibility.\n\nConversion takes about a minute, depending on file size.\nThe only flaw is if the source has a glitch, so will your AVI.\nGarbage in, Garbage out.\n\nHave all those MP4 files and an old tablet that can't play them?\nWant to use your favorite AVI editing tools?\nWish you could back up frame by frame in Media Player Classic?\nNow you too can turn (almost) any MP4 encode into your favorite AVI.\nAbout 5% of MP4 files won't work (divide by zero error), but the rest will.\n\nWhich is why MP4SUX will continue to offer some AVI XVID encodes.\nMore if requested, but people don't seem to do that here.\n\nI choose to remain (mostly) anonymous because we are being watched.\n... OK, because I'm paranoid ... that doesn't mean we're not being watched.\nI don't do movies (MPAA) or music (RIAA), but I'm still not sure if it's safe.\nSo, I sacrifice any chance of &quot;trusted&quot; status on TPB.\nA small price to pay to offer something that has proven value.\nYou don't need to know me - you only need to know my work.\n\nI NEVER claim an x264 encoding credit. I GIVE proper credit where due.\nI toyed with the idea of replacing the file's moniker with &quot;CC2AVI&quot;.\nBut that would be wrong ... for me at least.\n\nMy offerings are clearly identifiable:\nuse search term &quot;MP4SUX&quot;\nuse search term &quot;x264.MP3*.avi&quot;\nWithout quotes for TPB.\nWith quotes for Google.\n\nTPB is very good at removing fakes - dozens comment and then it's removed.\nRemember, if you see &quot;it's a fake&quot; and it's not removed - it's NOT a fake.\nBut have some compassion - comments cannot be removed once made on TPB.\nYou should click on the handle of such comments and see if THEY offer anything.\nSo far (fingers crossed) I have had nothing removed from TPB.\n\nThis is MY labor of love.\nI make no money, I seek no credit &amp; I am NOT affiliated with anyone but you.\nAnonymous or not, I have a growing track record of doing my bit responsibly.\nCompetition and choice are my watchwords in cyberspace.\nAnything I can do - you can do better!\nI would love nothing more than for you to go into competition with me.\n\nMP4SUX","torrent":{"xt":"urn:btih:60cff4b955d5d9d1437e2191f9a58b869354f031","amp;dn":"Pawn.Stars.S05E56.HDTV.x264-EVOLVE.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60cff4b955d5d9d1437e2191f9a58b869354f031","infoHashBuffer":{"type":"Buffer","data":[96,207,244,185,85,213,217,209,67,126,33,145,249,165,139,134,147,84,240,49]},"announce":[],"urlList":[]}}