{"title":"The Ed Show 8-3-12.mp4","uid":7504948,"size":184314516,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:617a0481c111351fb3c08a1e20d4c2f4e648af9b&amp;dn=The+Ed+Show+8-3-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1344139372,"description":"The Ed Show; August 3, 2012. Guest host Michael Eric Dyson. \n\n95 days before the 2012 election and Senate Democratic Leader Harry Reid is still punching Mitt Romney over his hidden tax returns.\n\nTonight, Rep. George Miller (D-CA) looks at Romney's ongoing tax problem, including the new questions about his massive IRA account.\n\nSome good news on jobs leaves Republicans scrambling. Steve Benen (contributing writer at Washington Monthly, The Rachel Maddow Show) breaks down Friday (8/3/12)'s report.\n\nWind creates energy and it creates jobs, but Mitt Romney wants to end tax credits for it. Van Jones (President and Co-Founder of the Rebuild the Dream), explains why Romney has a whole lot of Republicans lining up against him.\n\nThe Big Panel Patricia Murphy (Editor of Citizen Jane Politics and Daily Beast contributor), Michael Medved (nationally syndicated talk show host), and John Rowley (Democratic Strategist and President at Fletcher Rowley, Inc.) tackled retired porn superstar Jenna Jameson saying she's endorsing Mitt Romney because &quot;when you're rich, you want a Republican in office.&quot; .\n\nAnd rap legend Nas has the hottest new album in the country, appropriately titled Life is Good. Hip hop's premier poet joins guest host Michael Eric Dyson for an exclusive interview!","torrent":{"xt":"urn:btih:617a0481c111351fb3c08a1e20d4c2f4e648af9b","amp;dn":"The+Ed+Show+8-3-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"617a0481c111351fb3c08a1e20d4c2f4e648af9b","infoHashBuffer":{"type":"Buffer","data":[97,122,4,129,193,17,53,31,179,192,138,30,32,212,194,244,230,72,175,155]},"announce":[],"urlList":[]}}