{"title":"Ayad Akhtar - American Dervish","uid":7538767,"size":550470751,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:627e61bb99f5945aa8ed52e94fd9c620f6f90b79&amp;dn=Ayad+Akhtar+-+American+Dervish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alinaclyn","files":95,"time":1345159399,"description":"Hayat Shah is a young American in love for the first time. His normal life of school, baseball, and video games had previously been distinguished only by his Pakistani heritage and by the frequent chill between his parents, who fight over things he is too young to understand. Then Mina arrives, and everything changes.\n\nMina is Hayat's mother's oldest friend from Pakistan. She is independent, beautiful and intelligent, and arrives on the Shah's doorstep when her disastrous marriage in Pakistan disintegrates. Even Hayat's skeptical father can't deny the liveliness and happiness that accompanies Mina into their home. Her deep spirituality brings the family's Muslim faith to life in a way that resonates with Hayat as nothing has before. Studying the Quran by Mina's side and basking in the glow of her attention, he feels an entirely new purpose mingled with a growing infatuation for his teacher.\n\nWhen Mina meets and begins dating a man, Hayat is confused by his feelings of betrayal. His growing passions, both spiritual and romantic, force him to question all that he has come to believe is true. Just as Mina finds happiness, Hayat is compelled to act -- with devastating consequences for all those he loves most.\n\nAmerican Dervish is a brilliantly written, nuanced, and emotionally forceful look inside the interplay of religion and modern life. Ayad Akhtar was raised in the Midwest himself, and through Hayat Shah he shows readers vividly the powerful forces at work on young men and women growing up Muslim in America. This is an intimate, personal first novel that will stay with readers long after they turn the last page.\n","torrent":{"xt":"urn:btih:627e61bb99f5945aa8ed52e94fd9c620f6f90b79","amp;dn":"Ayad+Akhtar+-+American+Dervish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"627e61bb99f5945aa8ed52e94fd9c620f6f90b79","infoHashBuffer":{"type":"Buffer","data":[98,126,97,187,153,245,148,90,168,237,82,233,79,217,198,32,246,249,11,121]},"announce":[],"urlList":[]}}