{"title":"Snow.White.and.the.Huntsman.2012.EXTENDED.BluRay.720p.H264","uid":7587366,"size":948607821,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:630b03beb4ba53b0734ce64eeb8355e35ce7eb3e&amp;dn=Snow.White.and.the.Huntsman.2012.EXTENDED.BluRay.720p.H264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"twentyforty","files":4,"time":1346442133,"description":"In a twist to the fairy tale, the Huntsman ordered to take Snow White into the woods to be killed winds up becoming her protector and mentor in a quest to vanquish the Evil Queen. \n\nDirected by Rupert Sanders. \n\nStarring Kristen Stewart, Chris Hemsworth and Charlize Theron.\n\n******************************* \n\nSaid gazillion times, but worth repeating:\n\n&quot;For ones with/in doubts, &quot;inner&quot; questions and voyeur tendencies:\n\nGet proper, good torrent-program\nwith MediaInfo plug-in, NFO viewer plug-in\nand STOP asking for things already present.\nOr get hell out of my torrents and choose ones you need.\n\nSo - here is no waste of dozens KB in page content just to\nrepeat content of NFO file.\n\nIt is not needed anymore.\nIt's archaic and obsolete.\nDoing right-click in your torrent client is easier:\nView MediaInfo:   &lt;a href=&quot;\nhttp://bayimg.com/jAbiDaAef&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/jAbiDaAef&lt;/a&gt;\nView NFO:   &lt;a href=&quot;\nhttp://bayimg.com/JaBiKAAeF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/JaBiKAAeF&lt;/a&gt;\n\n...and...\n\n&quot;Requests must contain IMDB link. Request must contain valid reason Why do you ask for it and do not go someplace else.\nRe-seed requests must contain link to specific torrent.\nAny type of Requests should be posted in [COMMENTS] section of newest torrents.\nRe-seed request should contain exact time and time-zone you're in. Google. My Time Zone is CET, so do the math before.\nRe-seed time-window is 1 day. If you have slow connection meaning, you cannot finish download in that time-frame, just forget about re-seeding and especially loading of old, dead torrents.\nRe-seed chances are good for single torrents within one year of original day of upload.\nChances for re-seed of Pack-torrents and single TV episodes are slim to none.\nIn short - if I have something (and is physically present) - I would definitely re-seed.\nYou should just ask - nicely, in civilized and aforementioned manner, of course.\nIf you've done something wrong on my torrents - ever - do not bother to ask.\n\nDo NOT bother requesting easily available titles. If I haven't encoded something new and current - I have my reasons for that.\n\nDo NOT request movies which have IMDB score lower than 4.4.\n\nDo NOT request inclusion of TV shows in my uploads; that's my call. The removal of some show and movies (both from consideration and seeding) depends on many factors, however, be sure that shows would be dropped if I spot lack of interest, hungry hard-fisting crowd or too high a number of Hit and Runs or evil or stupid comments. These decisions are my own.&quot;\n\n\nNOTE: Before making fool of yourself (as lately many did) click  on &quot;Files&quot; (up there, not hidden)  and look what is in the torrent. If you want to see NFO or screen-shots - they are in the torrent. So, either get torrent program or plug-in for one you use with IMG and NFO viewer or - download .jpg and .nfo first and knock yourself out.\n\nOLD or DEAD torrents:\n\nFollow my rules to make nice and proper Re-seed Request, as explained above.\nIn case of old torrents, trackers might be dead by now - then simply load one new torrent of mine and from Properties of that new torrent copy and then paste all trackers in Properties of old torrent.\n\n*******************************\n\nNote: 428 MB 360p comes two hours from now.","torrent":{"xt":"urn:btih:630b03beb4ba53b0734ce64eeb8355e35ce7eb3e","amp;dn":"Snow.White.and.the.Huntsman.2012.EXTENDED.BluRay.720p.H264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"630b03beb4ba53b0734ce64eeb8355e35ce7eb3e","infoHashBuffer":{"type":"Buffer","data":[99,11,3,190,180,186,83,176,115,76,230,78,235,131,85,227,92,231,235,62]},"announce":[],"urlList":[]}}