{"title":"Hitman.Sniper.Challenge.Crackfix-SKIDROW","uid":7569239,"size":33630719,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:632419fe66c5614d466b0a0657959300d9429eb7&amp;dn=Hitman.Sniper.Challenge.Crackfix-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Gh0stNet","files":6,"time":1345943290,"description":"S  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nHitman Sniper Challenge Crackfix\n\n26-08-2012....Release Date &lt;-&gt; Protection....Steam + CEG + Custom\nAction...........Game Type &lt;-&gt; Disk(s)...................CRACKFIX\n\nCRACKFIX NOTES\n\nNot so much to say, rather than we're so sorry for the last days of\nrampage and troubles our latest cracks have caused. This should fix it!\n\nRELEASE NOTES\n\nGet ready to pull the trigger on a completely new chapter in the\naward-winning Hitman series. Be the ultimate assassin in the Hitman\nSniper Challenge by testing your reactions, focus and skill in a\nstand-alone hit available only for Hitman Absolution pre-purchases.\nUnlock weapons and upgrades that can be carried over into HITMAN:\nABSOLUTION and compare your scores with other players around the globe\nusing online leaderboards.\n\nHITMAN: SNIPER CHALLENGE has been created as a standalone experience\nto reward fans who pre-purchase HITMAN: ABSOLUTION.\n\nFrom a balcony overlooking a roof-top party, you are tasked with taking\nout Richard Strong, Jr., CEO of Stallion Armaments, along with his\nentire staff of bodyguards. Skilled players will capitalize on score\nmultipliers, discover secret extras, unlock equipment upgrades, and\nmarvel at the many creative ways to discretely dispose of a body while\nthey work to fulfil their contract in the most efficient way possible.\n\nFeatures:\n\nThe high-powered Kazo TRG sniper rifle and a host of other upgrades can\nbe unlocked and carried over into HITMAN: ABSOLUTION.\n\nOnline leaderboards will allow players to compare their sniping\nabilities with players around the world, separated into global,\nnational and friends lists.\n\nGet a permanent score boost by completing 14 in-game challenges that\ncome with a score modifier.\n\nEarn the coveted Silent Assassin rating and double your score\n\nINSTALL NOTES\n\n1. Mount or burn image (Game Not Included)\n2. Install\n3. Copy everything from the SKIDROW folder into the game installation\n4. Play the game\n5. Support the companies, which software you actually enjoy!\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups!\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix + irokos\ntitan artdivision\t\t","torrent":{"xt":"urn:btih:632419fe66c5614d466b0a0657959300d9429eb7","amp;dn":"Hitman.Sniper.Challenge.Crackfix-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"632419fe66c5614d466b0a0657959300d9429eb7","infoHashBuffer":{"type":"Buffer","data":[99,36,25,254,102,197,97,77,70,107,10,6,87,149,147,0,217,66,158,183]},"announce":[],"urlList":[]}}