{"title":"Hsu and Chan (Slave Labor Graphics)","uid":7608501,"size":131685732,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:667f776ff96725945f463159867bb4a60da04c94&amp;dn=Hsu+and+Chan+%28Slave+Labor+Graphics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1347003764,"description":"Issues 1-6 of 'Hsu and Chan'\n\nSlave Labor Graphics, 2003-2004\n\nWritten and Illustrated by Jeremy 'Norm' Scott\n\n\nHsu and Chan is a comic strip created by Jeremy 'Norm' Scott that appeared in the video game magazine Electronic Gaming Monthly from October 1999 until the September 2008 issue. The strip has appeared at 1UP.com until September 30, 2009 when the blog ended and Norm promised to continue the comic at spookingtons.com. Full-length comic books of Hsu and Chan have also been published by Slave Labor Graphics, as well as a trade paperback collecting the first five issues of the comic.\n\nHsu and Chan follows the misadventures of the brothers Hsu and Chan Tanaka, who own and operate a company called 'Tanaka Bros. Game Development' that specializes in knock-offs of popular titles. For example Bad Milage 2000, a knock-off of Gran Turismo appears in the strip 'Hsu and Chan in - Chan Turismo!'\n\nTanaka Bros. Game Development has other, less seen employees, including Arnie, a ground squirrel bearing a striking resemblance to Sonic the Hedgehog, Gila Mobster, the brutish Charmander parody who can be seen wearing a black Fedora with a lighter grasped in the end of his tail, and Chernobyl, the radioactive chipmunk who is a take on Pikachu.\n\nThe name Dirk appears frequently as a replacement for a random name (Ledger of Zelda) or for anagrams and codenames (Pocket Morons - Platinum, Sonic Boobs). Many comics also make references to Cheez-its, usually with characters noticing crumbs (This was also done in The Otters - The Survivors). Many references are made to the Tomb Raider series, usually referring to the newer games as crimes against humanity.\n\nThe first comic to spin off from Hsu and Chan was Game Critter Super-Squad!, which ran in EGM's now-defunct sister magazine, GameNOW.\n\nAfter three years with EGM, Scott contacted Slave Labor Graphics about making a standalone, full-length Hsu and Chan comic book. Slave Labor agreed, with eight issues of the comic published between 2003 and 2009. A collection of these first five along with extra bonus material was released in 2004 and titled Hsu and Chan - Too Much Adventure.\n\nSince the EGM strips are typically one page long, they are self-contained stories that parody a specific video game, usually the title on that month's cover of EGM. The Slave Labor comics, on the other hand, are considerably longer and more reliant on plot. The Slave Labor comics are also less video game-centric and feature Hsu and Chan battling supernatural foes and their arch-rivals at the competing video game company, Yamamoto Games, Inc.\n\nNorm's naturally wordy dialogue is slightly toned down for the EGM strip, a necessary compromise given the single page nature of the strip. In the Slave Labor comic, the characters are more verbose.\n\nDespite the separate focuses of the two different strips, they exist within the same universe. In the Slave Labor comics Hsu's right hand is severed and replaced with a prosthetic appliance; the change was reflected in the EGM strip.","torrent":{"xt":"urn:btih:667f776ff96725945f463159867bb4a60da04c94","amp;dn":"Hsu+and+Chan+%28Slave+Labor+Graphics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"667f776ff96725945f463159867bb4a60da04c94","infoHashBuffer":{"type":"Buffer","data":[102,127,119,111,249,103,37,148,95,70,49,89,134,123,180,166,13,160,76,148]},"announce":[],"urlList":[]}}