{"title":"The_Sims_3_Store-July_2012_Update-admz0r (.sim3pack/.package)","uid":7509190,"size":431351795,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:689d1b34049d29447b7b554d1ac00473357a02cb&amp;dn=The_Sims_3_Store-July_2012_Update-admz0r+%28.sim3pack%2F.package%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"admz0r","files":12,"time":1344263446,"description":"Here's the complete July update, and as many of you like in .package, I also included the June package too in this torrent (I will do in this way from now, so you can find both format in the same torrent file!) .sim3pack included too, you can find them in seperate folders. The .sim3pack's decrapified, and rigfixed, of course.\nIt's a month set, not like shits on TPB (missing items, previous month items,etc), if you want to get ALL the updates released in current month, always take mine. \n\nSo there's a FiXER_v3 folder in the torrent (which fixes the new bugged items), you have to use the .packages inside to get work some new items, which got fucked up, because of the decrapifier. If you do this right, everything is going to work. (see below)\n\n******WARNING!!*******\nTHERE ARE NEW FIX FILES, SO IF YOU GOT FIXER_V1 OR 2 FROM MY PREVIOUS PACKS, YOU _MUST_ DELETE THIS FILE FROM YOUR OVERRIDES OR PACKAGES FOLDER **(KT_StoreFix_Awesome.package)**  AND OVERWRITE THE OTHER FILES, IF ASKED!!!!! THIS IS IMPORTANT!!! DO THIS BEFORE YOU START COPYING THE NEW FIX FILES!\n**************************\n\niNSTRUCTiONS FOR FiXER_v3:\n---------------------------\n-ccmerged_decrapped.package (Replace the previous one.)\n-KT_StoreFix_DecrapFixes.package\n-KT_StoreFix_Fixes_decrapped.package\n-KT_StoreFix_UnAwesome.package (Replace the previous one.)(Use it only if you DON'T have Awesomemod!)\n\n*!!!!If you use packages make sure to put these in your overrides folder, if you use the .sim3pack's put these in your packages folder!!!!*\n\n-ccmerged.package  -&gt; This file goes to C:-Users-Documents-Electronic Arts-The Sims 3-DCBackup folder (Replace the previous one.)\n\n-ContentPatch.package  -&gt; This file goes to C:-Users-Documents-Electronic Arts-The Sims 3-ContentPatch folder (Replace the previous one.)\n\nFiXES THE FOLLOWiNG:\n---------------------\nKT_StoreFix_DecrapFixes:\n\nNo ladle for decrapped Lord Vladimir's Magic Cauldron\nNo needle for decrapped Malleable Mimic Voodoo Doll\nNo fruit for decrapped Tree of Prosperity\nNo food for decrapped Sizzle Baby Pro Deep Fryer and Frost-Bite Pro Ice Cream Machine\nNo handset for the decrapped Vintage Rotary Phone\nNo cards and chips for decrapped Hit 'em Harder Blackjack Table\nNo coins for decrapped Wishing Well\nGambling Skill Icon fixed for decrapped Casino\n+ Moar Gambling Skill Icons fixed for decrapped Casino\n+ Fixed meshes for the AF Vintage Baseball outfit\n+ No acc. for Aims Co. Choc-O-Falls Fountain\n\nKT_StoreFix_Fixes:\n\nRouting issue with Banquett Fan\nWall cut-outs for the Modernism Window, Not-So-Private Study Door, Nega-Door, Gothique Window and the Muntin Window\nFixed middle slots on the Vineyard Vittles Dining Table\nFixed morphs and bow for Katy Perry Romper from the collectors edition of Showtime\nFixed diagonal wall cut outs for Transparent Window by BahHaus, Concrete Boarder Window and The Insulator\n[Fixed Clearstory Rectangular window to be CAStable and wall cut outs for both Clearstory windows\nPet store now sells limited edition content\n\nKT_StoreFix_UnAwesome:\n\nThe Ultimate Career Bundle unlocked\nWorking Pet Register\n\nCCMerged_Decrapped:\n\nBuff conflicts with the following items: Sharper Sim's Super Sleeper, MultiTab 6000, The Hypnotizer, Malleable Mimic Voodoo Doll, Lord Vladimir's Magic Cauldron, Frost-Bite Pro Ice Cream Machine, Sizzle Baby Pro Deep Fryer, Leon's Fountain of Youth, Hit 'em Harder Blackjack Table, Triple Riches Slots O'Jackpots Slot Machine, +Wishing Well, +Aims Co. Choc-O-Falls Fountain\n\nReset bug with Lady Ravendancer Goth's Book o' Spells \n\n(&quot;+&quot; means, these are the new fixes in the v3)\n\nWRITE ONLY USERS PLEASE STOP IRRATING. EVERYTHING IS IN THE DESCRIPTION/IN THE FIRST COMMENT.\n\n-admz0r-","torrent":{"xt":"urn:btih:689d1b34049d29447b7b554d1ac00473357a02cb","amp;dn":"The_Sims_3_Store-July_2012_Update-admz0r+%28.sim3pack%2F.package%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"689d1b34049d29447b7b554d1ac00473357a02cb","infoHashBuffer":{"type":"Buffer","data":[104,157,27,52,4,157,41,68,123,123,85,77,26,192,4,115,53,122,2,203]},"announce":[],"urlList":[]}}