{"title":"Prince Of Persia 2008 Snyper","uid":7522927,"size":3664804222,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6930367c7a29d185c7dc2f8ad8bde92db5e8e7c3&amp;dn=Prince+Of+Persia+2008+Snyper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Arjun609","files":18,"time":1344686118,"description":"Prince of Persia (2008)\nPublisher: Ubisoft\nDeveloper: Ubisoft\n\nMinimum System Requirements\nOS: Windows XP/Vista/windows 7\nProcessor: Pentium D @ 2.6 GHz or AMD Athlon 64 X2 3800+\nMemory: 1 GB for XP/2 GB for Vista\nHard Drive: 8 GB Free\nVideo Memory: 256 MB (Shader Model 3.0+)\nSound Card: DirectX Compatible\nDirectX: 9.0c\nKeyboard &amp; Mouse\nDVD Rom Drive\n\nRecommended System Requirements\nOS: Windows XP/Vista/windows 7\nProcessor: Intel Core 2 DUO @ 2.2 GHz or AMD Athlon 64 X2 4400+\nMemory: 1 GB for XP/2 GB for Vista\nHard Drive: 8 GB Free\nVideo Memory: 256 MB (Shader Model 3.0+)\nSound Card: DirectX Compatible\nDirectX: 9.0c\nKeyboard &amp; Mouse\nDVD Rom Drive\n* Supported Video Cards at Time of Release:\nATI RADEON X1600*/1650*-1950/HD 2000/3000 series\nNVIDIA GeForce 6800*/7/8/9 series\n \n \n \n Set in a land rooted in ancient Persian mythology, the Prince finds himself caught in an epic battle between the primal forces of light and darkness: the God of Light, Ormazd versus his brother Ahriman, the destructive God of Darkness. The Prince arrives just in time to witness the destruction of the legendary Tree of Life, an act which threatens to plunge the entire world into eternal darkness. Manifested in the form of the Corruption, a dark substance that physically contaminates the land and the skies, the Prince must partner with Elika, a deadly companion, to heal the world from the evil Corruption.\n\n\n\nGame features include:\n\nA new hero emerges: Master the acrobatics, strategy and fighting tactics of the most agile warrior of all time. Grip fall down the face of a building, perform perfectly timed acrobatic combinations, swing over canyons, buildings and anything that is reachable. This new rogue warrior must utilize all of his new skills along with a whole new combat system to battle Ahriman's corrupted lieutenants to heal the land from the dark Corruption and restore the light.\n\nA new epic journey begins: Escape to experience the new fantasy world of ancient Persia. Masterful storytelling and sprawling environments will deliver to action-adventure fans an experience that rivals even the best Hollywood\n\nA new open world structure: A first for the Prince of Persia franchise ? now you have the freedom to determine how the game evolves in this non-linear adventure. Players will decide how they unfold the storyline by choosing their path in the open-ended world.\n\nEmergence of a deadly new ally: History's greatest ally is revealed in the form of Elika, a dynamic AI companion who joins the Prince in his fight to save the world. Gifted with magical powers, she interacts with the player in combat, acrobatics and puzzle-solving enabling the Prince to reach new heights of deadly high-flying artistry through special duo acrobatic moves or devastating fighting combo attacks.\n\nAll new for Next-Gen: The franchise's debut on next-generation consoles utilizes Ubisoft's proprietary Anvil engine, the same engine used to develop Assassins Creed.","torrent":{"xt":"urn:btih:6930367c7a29d185c7dc2f8ad8bde92db5e8e7c3","amp;dn":"Prince+Of+Persia+2008+Snyper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6930367c7a29d185c7dc2f8ad8bde92db5e8e7c3","infoHashBuffer":{"type":"Buffer","data":[105,48,54,124,122,41,209,133,199,220,47,138,216,189,233,45,181,232,231,195]},"announce":[],"urlList":[]}}