{"title":"Sandman Midnight Theatre - Neil Gaiman, Matt Wagner","uid":7561629,"size":24831259,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:69957c80904eef7d17a1fde6ec322374ebf6a9cc&amp;dn=Sandman+Midnight+Theatre+-+Neil+Gaiman%2C+Matt+Wagner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1345755211,"description":"Sandman Midnight Theater\nVertigo/DC Comics\nWritten by Neil Gaiman\nPlotted by Matt Wagner\nFrom a story by Neil Gaiman &amp; Matt Wagner\nPainted by Teddy Kristiansen\n\nSandman Midnight Theatre is the title of a comic book in which two DC comics characters called the Sandman, Dream and Wesley Dodds, encounter each other.\n\nIt was a one-shot, co-written by Sandman Mystery Theatre author Matt Wagner (co-plot) and Sandman author Neil Gaiman (co-plot/script), and featured painted artwork by Teddy Kristiansen and was lettered by Todd Klein.\n\nIt received the Comics Buyer's Guide Fan Award for Favorite Original Graphic Novel/Album for 1996.\n\nIt was published with a cover date of September 1995. The following issue of The Sandman's regular series was #72, in which Dodds appeared out of costume as an epilogue to the events in this book. (Chronologically, this issue appeared much later, as the story occurred during Dream's imprisonment.) In terms of Sandman Mystery Theatre, it occurs between issues #36 and #37, between the storylines &quot;The Python&quot; and &quot;The Mist&quot;.\n\nFollowing the events of &quot;The Python,&quot; Dian left New York City for London. Dodds uses a murder case as an excuse to follow her, and he finds her working at a church's soup kitchen. While Belmont deliberately avoids Dodds, both end up, for different reasons, at a party held by Roderick Burgess, the man who imprisoned Dream in his cellar.\n\nThe graphic novel was reprinted in the 1999 anthology, Neil Gaiman's Midnight Days.","torrent":{"xt":"urn:btih:69957c80904eef7d17a1fde6ec322374ebf6a9cc","amp;dn":"Sandman+Midnight+Theatre+-+Neil+Gaiman%2C+Matt+Wagner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69957c80904eef7d17a1fde6ec322374ebf6a9cc","infoHashBuffer":{"type":"Buffer","data":[105,149,124,128,144,78,239,125,23,161,253,230,236,50,35,116,235,246,169,204]},"announce":[],"urlList":[]}}