{"title":"Patch Liga Zon Sagres v4 by estica","uid":7563223,"size":6495772169,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6b41f6de7d1e7a8d631b429bc0dff94344d03c16&amp;dn=Patch+Liga+Zon+Sagres+v4+by+estica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Kizza_PT","files":10,"time":1345795454,"description":"THIS PATCH WAS CREATED BY ESTICA\nALL CREDITS AND MERIT GO TO HIM AND TUGA VICIOS TEAM\n\nATTENTION: \n-VIDEO IN PORTUGUESE BUT EASY TO FOLLOW STEP BY STEP\n-FOLLOW THE VIDEO EXACTLY DO EVERYTHING LIKE IN THE VIDEO\n- WHEN COMES THE PART YOU HAVE TO DELETE AL FILES AND FOLDERS FROM YOUR PES 2012 BE VERY CAREFULL DELETE EVERYTHING ECXEPT THE FOLDER IMG LIKE ITS SHOW ON THE VIDEO\n-YOU DONT NEED TO UNRAR NOTHING I JUST LEFT THE .RAR FILES BECAUSE I LIKE TO SAVE DE ORIGINAL FILES\n\n\n\n\nPATCH TOTALY TESTED BY ME AND WORKING 100%\nANY ERROR YOU MAY GET ITS BECAUSE YOU DID SOMETHING WRONG INSTALLING IT\n\nTHIS PATCH CONTAINS ALL LEAGUES TEAMS SUITS AND PLAYERS SO AS SOME SECUNDARY LEAGUES, LOTS OF BALLS AND BOOTS, TEAM CHANTICS AND LOT MORE\n\n\n\nINSTAL EVERY THING CAREFULY HOW ITS SHOW IN THE VIDEO AND YOU WILL GET IT 100% WORKING\n\n\nDONT FORGET TO SEED THANKS!\n\n\n\n\n\n\n\n\nPATCH CRIADO PELO ESTICA!!! \nTODOS SO CREDITOS VAO PARA ELE E PARA A EQUIPA DO TUGA VICIOS\n\nATENÃ‡AO:\n-VER O VIDEO E SEGUIR PASSO A PASSO TUDO COMO O ESTICA DIZ\n-QUANDO CHEGA A ALTURA DE APAGAR TUDO DENTRO DA PASTA DO VOSSO PES 2012 MUITA ATENÃ‡AO APAGUEM TUDO MAS DEIXEM A PASTA IMG VEJAM COMO ESTA NO VIDEO ELE DEIXA FICAR ESSA PASTA!\n-NAO PRECISAM DE DESCOMPACTAR NADA SO DEIXEI FICAR OS FICHEIROS .RAR PORQUE GOSTO DE GUARDAR OS FICHEIROS ORIGINAIS.\n\n\n\n\n\nPATCH TOTALMENTE TESTADO POR MIM E A FUNCIONAR 100%\nQUALQUER ERRO QUE VOS POSSA APARECER FOI POR QUE INSTALARAM ISSO MAL\n\nO PATCH CONTEM UPDATE DE TODAS AS LIGAS COM AS RESPECTIVAS EQUIPAS E EQUIPAMENTOS ASSIM COMO ALGUMAS LIGAS SECUNDARIAS (POR EXEMP. LIGA ORANGINA)\nCONTEM BOLAS E CHUTEIRAS ASSIM COMO CANTICOS DAS CLAQUES DAS RESPECTIVAS EQUIPAS VARIAS OPÃ‡OES MAS PODEM VER TUDO ISSO NO VIDEO.\n\nINSTALEM TUDO COM CALMA E EXACTAMENTE COMO MOSTRA O VIDEO E VAO TER O JOGO A CORRER A 100%\n\nNAO SE ESQUEÃ‡AM DE SEMEAR OBRIGADO!\n\n\n\n\n","torrent":{"xt":"urn:btih:6b41f6de7d1e7a8d631b429bc0dff94344d03c16","amp;dn":"Patch+Liga+Zon+Sagres+v4+by+estica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b41f6de7d1e7a8d631b429bc0dff94344d03c16","infoHashBuffer":{"type":"Buffer","data":[107,65,246,222,125,30,122,141,99,27,66,155,192,223,249,67,68,208,60,22]},"announce":[],"urlList":[]}}