{"title":"ExploitedCollegeGirls - Desiree ** October 19, 2011 **","uid":7608108,"size":1183172974,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6c6e69ff1ee191dbee13aab45370d2c7d97d2415&amp;dn=ExploitedCollegeGirls+-+Desiree+%2A%2A+October+19%2C+2011+%2A%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Xavier461","files":1,"time":1346991612,"description":"Screenshots\n &lt;a href=&quot;\nhttp://imgzilla.net/?p=150&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgzilla.net/?p=150&lt;/a&gt;\n\n\nSize: 1183172974 bytes (1.10 GiB), duration: 01:23:08, avg.bitrate: 1898 kb/s\nAudio: wmav2, 44100 Hz, stereo, 96 kb/s\nVideo: wmv3, yuv420p, 640x360, 1786 kb/s, 29.97 fps\n\n\nI dare you to not fall in love with Desiree within the first ten minutes of this video. You watch our sweet, self-professed nerd be transformed into a sex goddess, she's happy and talkative, and giddy about what's about to happen, and you wonder why the hell she'd ever want to do the nasty with a stranger on camera. But after a little while you realize our little angel has a strong sexual side that just screams to be unleashed. She literally becomes a different person once her make-up is on and there is a cock she gets to play with. You'll see what I mean. She doesn't mind the attention both of us shower her with, and the more we steer our conversations to sex, the more Desiree gets excited. Every time she shows off her big D's and talks about naughty things, the sexual tension in the room gets thicker. Jay tries to hide his boner as he's exploring Desiree's tits and ass, and I have to admit even I am tempted to just ravage the girl right then and there.\nDesiree has the X-factor. When you are in the room with her your brain practically shuts down and all you want is to 'get with her'. Jay can't even wait until I'm done doing the photo shoot with her, but Desiree doesn't mind his advances and teases. After she picks out her outfit he talks her into blowing him. Still dressed, Desiree drops to her knees and demonstrates her cocksucking skills on him. I practically have to tear him away by his ears so we can keep going. There's still lots to do before he's allowed to fuck her.","torrent":{"xt":"urn:btih:6c6e69ff1ee191dbee13aab45370d2c7d97d2415","amp;dn":"ExploitedCollegeGirls+-+Desiree+%2A%2A+October+19%2C+2011+%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c6e69ff1ee191dbee13aab45370d2c7d97d2415","infoHashBuffer":{"type":"Buffer","data":[108,110,105,255,30,225,145,219,238,19,170,180,83,112,210,199,217,125,36,21]},"announce":[],"urlList":[]}}