{"title":"United States of Equanimity: Finding the Measure, 2012, mp3","uid":7592992,"size":193873849,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6d14693cf11402f1940ed4f58c413db958a8a54c&amp;dn=United+States+of+Equanimity%3A+Finding+the+Measure%2C+2012%2C+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rhlayer","files":-1,"time":1346608643,"description":"United States of Equanimity (USOE) is a platform for the creative expressions of Roy Layer, who was born in Toronto, Canada and currently lives in Ottawa. \n\nFinding the Measure was recorded during June 2012 and released in July.  The album includes a number of poems taken from &quot;The Spoken Arts Treasury&quot; that fortunately reside in the public domain.  The poems are ardently read by their authors and provide an inspiring context for the music.\n \nThe challenge of the artist is to tune in to what is inside and to depict it outside in the form of his/her own art, whatever form it takes. The new studio assembles a diverse pallet of sound colours and processing tools that enables USOE to sketch out sound paintings. These amateur home recordings are an attempt to become familiar and ultimately adept using these new implements* of realization.\n \nThese recordings are essentially live spontaneous manifestations laid down in pairs of stereo tracks. Most pieces represent two to three layers of these pairs. Pre-recording loops of simple motifs with the Kaossilator Pro and Kaos Pad, and having access to multiple instruments at arm's length allows the solo performer to establish a significant presence and versatility.\n \n*Implements of Realization: Korg Wavedrum, Korg Kaos Pad, Korg Kaossilator Pro, Korg R3, Nord Electro 3, Access Virus Indigo II, Alesis SR18, Tascam DP-02, 12 Channel Mixer, plus PC for post processing. \n","torrent":{"xt":"urn:btih:6d14693cf11402f1940ed4f58c413db958a8a54c","amp;dn":"United+States+of+Equanimity%3A+Finding+the+Measure%2C+2012%2C+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d14693cf11402f1940ed4f58c413db958a8a54c","infoHashBuffer":{"type":"Buffer","data":[109,20,105,60,241,20,2,241,148,14,212,245,140,65,61,185,88,168,165,76]},"announce":[],"urlList":[]}}