{"title":"Thiruvilayadal (1965) Tamil DVD Rip","uid":7493497,"size":1794120396,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6d4fe0a51d8288c6009ad8c47543ab58ea3ff33e&amp;dn=Thiruvilayadal+%281965%29+Tamil+DVD+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nrsadri","files":1,"time":1343815803,"description":"Thiruvilayadal covers four stories in the Thiruvilaiyadal Puranam which is originally composed of 64 stories. The plot revolves around the &quot;divine sport&quot; of Lord Shiva (Sivaji Ganesan) who has the habit of confounding his devotees in order to test their devotion. The story begins when the Lord gives the sacred fruit brought by sage Narada to his elder son, Ganesha. His younger son Muruga becomes angry and thus goes to a hill abode of Palani in the clothes of a hermit sage. Goddess Parvathi (known as Sakthi here) (Savitri) comes and narrates the Thiruvilayadalgal (&quot;Divine Sports&quot;) of Lord Shiva to Muruga, in order to calm him down. She narrates the story of when the Lord opened his third eye, an episode where Lord comes to the city of Madurai of the Pandya Kingdom in the form of a poet. That time, the King Shenbaga Pandian (R. Muthuraman) wants to find out the answer to an unsolved question, and announces a reward of lot of gold coins to anyone who finds out the answer. Poet Dharumi (Nagesh) wants this reward and Shiva (as the poet) gives him a poem containing the answer. Overjoyed, Dharumi takes it to the court and recites the poem, but the ego-filled poet of the Durbar, Great Tamil Poet Nakeeran (A. P. Nagarajan) claims it is incorrect. When Shiva hears this, he gets enraged and turns Nakeeran into ashes. Later, he revives Nakeeran who apologizes, and finally realizes himself.\nShe also narrates in another episode that the Lord marries Dhatchayini (Sakthi) against the will of Dhatchayini's father Dhatchan. Dhatchan also performs a Mahayagna without inviting son-in-law Lord Shiva. Sakthi asks permission to go but Shiva refuses. But Sakthi disobeys him and goes there, only to be insulted by Dhatchan. Sakthi curses him and returns back to the abode of Shiva. Shiva refuses to live with her and a war enrages. Shiva burns Sakthi to ashes and performs his 'Mahathandava' dance with great fury. But later he gives life to Sakthi and orders her to be born as a fisherman's daughter as a consequence for her actions.\nSakthi, now born as Kayarkanni, is the daughter of a fisherman. When playing with her friends, a strange fisherman (Shiva in his fisherman form) approaches and flirts with her, despite her disapproval. Later after he saves everyone from a shark, Kayarkanni accepts to marry him. She recites another time when the Lord took the form of a woodcutter and settled in a kingdom which was trying to be conquered by the great singer Hemanatha Bhagavathar (T. S. Balaiah). Shiva teaches a lesson to Bhagavathar, that pride even with the greatest talent is no good. Disappointed, the latter leaves and everyone in the kingdom rejoices.\nListening to all these stories, Muruga's rage finally subsides and he reconciles with his family. Subsequently, it is revealed that the name &quot;Palani&quot; is a portmanteau of the two Tamil language terms Palam (&quot;Fruit&quot;) and Nee (&quot;You&quot;), hence literally meaning (&quot;You are the Fruit&quot;), referring to Muruga.","torrent":{"xt":"urn:btih:6d4fe0a51d8288c6009ad8c47543ab58ea3ff33e","amp;dn":"Thiruvilayadal+%281965%29+Tamil+DVD+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d4fe0a51d8288c6009ad8c47543ab58ea3ff33e","infoHashBuffer":{"type":"Buffer","data":[109,79,224,165,29,130,136,198,0,154,216,196,117,67,171,88,234,63,243,62]},"announce":[],"urlList":[]}}