{"title":"Sacred Mushroom (the) - 1969 - The Sacred Mushroom (2002 Akarma)","uid":7098119,"size":237148924,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6d80e2cecc51bbd32115d45bdc737c5b4b181124&amp;dn=Sacred+Mushroom+%28the%29+-+1969+-+The+Sacred+Mushroom+%282002+Akarma%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":null,"files":-1,"time":1331624319,"description":"eac secure cue log scans\n\n2002 - Akarma Records / 192 / CD\n\nSacred Mushroom -- led by future Pure Prairie League member Larry Goshorn (guitar/vocals) and featuring brother Danny Goshorn (vocals) -- were a short-lived rock/blues quintet based in Cincinnati, OH. Their efforts coalesce on this, the band's self-titled debut (and only) long-player. The album contains a blend of proficient originals as well as a pair of well-chosen cover tunes, such as the blues standard &quot;Mean Old World&quot; and the Kinks' &quot;I'm Not Like Everybody Else.&quot; While their name conjures images of late-'60s psychedelic or acid rock, Sacred Mushroom's roots were decidedly more bluesy than trippy. Likewise, their harder-edged performance style is well served by the tight and somewhat pop-driven arrangements, resembling artists such as the Allman Joys, Kak, or the pre-Blue Ã–yster Cult Stalk-Forrest Group. A few of the Larry Goshorn-penned tunes are certifiably lost classics. These include the up-tempo rocker &quot;Catatonic Lover,&quot; which features some lyrical chord changes reminiscent of &quot;3/5's of a Mile in 10 Seconds&quot; by Jefferson Airplane, and the Chicago blues-style waltz &quot;All Good Things Must End.&quot; The latter is highlighted by some inspired harp playing from Rusty Work. The opening track, &quot;I Don't Like You,&quot; is a funky rocker spotlighting the Goshorn Brothers' tight harmonies as well as Larry's distinctive lead electric guitar licks. Another standout is their reworking of &quot;I'm Not Like Everybody Else.&quot; The track retains a timeless pop sensibility that incorporates interweaving acoustic and electric guitar lines. &quot;Lifeline,&quot; the most extended track on the disc, recalls the electric blues of seminal Fleetwood Mac or Stan Webb's Chicken Shack. Along the same lines is the blues boogie rendering of &quot;Mean Old World,&quot; which might easily be mistaken for an obscure version by a mid-'60s lineup of John Mayall's Bluesbreakers.\n\nTracklist:\n01 I Don't Like You (02:53)\n02 You Won't Be Sorry (02:19)\n03 Catatonic Lover (03:03)\n04 All Good Things Must Have An End (04:41)\n05 I'm Not Like Everybody Else (04:35)\n06 I Take Care (04:59)\n07 Mean Old World (04:38)\n08 Lifeline (06:35)\n\nLarry Goshorn - lead guitar and vocals.\nDanny Goshorn on vocals.\nJoe Steward on bass.\nFred Fogwell on rhythm guitar.\nDoug Hamilton on drums.","torrent":{"xt":"urn:btih:6d80e2cecc51bbd32115d45bdc737c5b4b181124","amp;dn":"Sacred+Mushroom+%28the%29+-+1969+-+The+Sacred+Mushroom+%282002+Akarma%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d80e2cecc51bbd32115d45bdc737c5b4b181124","infoHashBuffer":{"type":"Buffer","data":[109,128,226,206,204,81,187,211,33,21,212,91,220,115,124,91,75,24,17,36]},"announce":[],"urlList":[]}}