{"title":"North.of.60-All.Srasons.1-6+5TV.COMPLETE.[AVI-XviD.MPEG-4]","uid":7456367,"size":18613819465,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6db36ec4fde93a33c1f2e64efdaa858246d7b5a0&amp;dn=North.of.60-All.Srasons.1-6%2B5TV.COMPLETE.%5BAVI-XviD.MPEG-4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"movieboy_5280","files":-1,"time":1342675153,"description":"\n\nFirst I must state that these videos (not my rip) are of lower quality than usually seen here, but are a slight improvement to an similar upload posted that was missing 2 seasons. I had a different source.\nIf I were to be the critic rather than the contributor, I would rate them: Video=3, Audio=3.\n\nI guess the original creator felt that content trumped quality.\nNone the less, I had been searching for over a decade for this series and am grateful to all mentioned above for their efforts as it is more than I had before.\nI can also verify that it is complete as I saw the series finale when it was originally aired and it is a match to the one posted here.\n\nAdditional criticisim in the comments is of course welcome if it for the benefit of potentional downloaders but bear in mind any aimed at myself would be &quot;Preaching to the choir&quot;.\n\nPerhaps one day someone with enough to spend will buy the series and share it here.  Until then, this is what is available.\n\nThat said I make one request:\n\nI have recently learned that my time here is finite, thus so will be my ability to seed this torrent\n\nWhile I understand those with limited disk space may be only to download and seed only several seasons, but if you are able to seed complete please do so for as long as you can.\n\nThis also means I have not had the chance to review all of these episodes 100% so if there is one that is not complete, please let me know and I will do my best to correct it.\n\nI wish it were a different situation but that decision lies with the powers that be.\n\n~Movieboy","torrent":{"xt":"urn:btih:6db36ec4fde93a33c1f2e64efdaa858246d7b5a0","amp;dn":"North.of.60-All.Srasons.1-6%2B5TV.COMPLETE.%5BAVI-XviD.MPEG-4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6db36ec4fde93a33c1f2e64efdaa858246d7b5a0","infoHashBuffer":{"type":"Buffer","data":[109,179,110,196,253,233,58,51,193,242,230,78,253,170,133,130,70,215,181,160]},"announce":[],"urlList":[]}}