{"title":"Mister E (Vertigo)","uid":7575465,"size":24039842,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:706f856951d8991beeac51fba35c885a41171c85&amp;dn=Mister+E+%28Vertigo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1346102074,"description":"Issues 1-4 of 'Mister E'\n\nDC Comics (OK, so this wasn't on Vertigo, but only because Vertigo didn't exist yet. If they had, this would have been a Vertigo book.)\n\nWriter - K.W. Jeter\nPenciller -John K. Snyder, III\nInker - Jay Geldhof\n\n\nMister E is a fictional character that appears mainly in the Vertigo Comics universe, though he sometimes appears in the DC Comics universe. Created by Bob Rozakis and Jack C. Harris, the character first appeared in Secrets of Haunted House and was a recurring character for ten issues. He was then radically redesigned by Neil Gaiman for use in The Books of Magic, after which he appeared in his own mini-series.\n\nIn spite of Mister E's originally unexplained blindness, his major power was the ability to &quot;see&quot; evil. He often carried weapons for fighting supernatural creatures (silver bullets, wooden stakes, crucifixes, etc.). Hints of his psychological disturbance were implied when he justified the executions of the Salem Witch Trials.\n\nIn the Books of Magic storyline Mister E was blinded as a child, when his deranged father scooped out his eyeballs for gazing at a woman of low moral character (his mother). He still has the mystical ability to see &quot;what needs to be seen&quot;, but can now see the good and evil in the souls of others. He learned the ability to walk through time from his older self. Mister E also suffers from dissociative identity disorder (formerly known as multiple personality disorder), swinging from a mild personality to a psychotic fundamentalist Christian.","torrent":{"xt":"urn:btih:706f856951d8991beeac51fba35c885a41171c85","amp;dn":"Mister+E+%28Vertigo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"706f856951d8991beeac51fba35c885a41171c85","infoHashBuffer":{"type":"Buffer","data":[112,111,133,105,81,216,153,27,238,172,81,251,163,92,136,90,65,23,28,133]},"announce":[],"urlList":[]}}