{"title":"Dangerous HD v1.1.0 build 7 Final + SD Data By bobiras2009","uid":7476895,"size":895960,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:70e1b702892a788095c0c48e47be24b8a0be922a&amp;dn=Dangerous+HD+v1.1.0+build+7+Final+%2B+SD+Data+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bobiras2009","files":-1,"time":1343312870,"description":"Dangerous is an epic 3D open and living world space sandbox combat RPG with an engaging story. You have been awoken from cryo sleep a century later, and must discover the truth. Are you the feared war criminal who will destroy all life or the savior of the universe? \n\nGather your wingmen and travel the galaxy in search of answers. Along the way, you'll encounter a Universal AI, a shadow group pulling history's strings, a princess, a schizophrenic robot, a beautiful lieutenant of the Royal Navy, a fearsome mercenary, a suicidal slave, and a playboy fighter ace.\n\nFeatures:\n\n    3D real-time sandbox game built with Unity game engine \n    metallic shader, lighting, particle effects, lens flare, explosions, fx \n    space combat RPG with extensive skill tree \n    open and living universe where 600+ ships fly around autonomously \n    epic story with dialogue system that allows real choices \n    recruit 6 wingmen and 2 can fly with you at a time \n    even discover romance with another wing pilot \n    recruit 5 corporate pilots who can fly trade routes on your behalf \n    trade, fight, mine, pirate, scan for derelict ships and wormholes \n    many mission types: epic, freelance, dynamic, wingman acquisition, faction loyalty \n    deep combat mechanics, AI, and faction standings \n    20+ ships, 180+ modules, 33 solar systems with a unique follow-through-warp mechanic \n    15+ factions to vie favor or destroy \n    cinematic camera shows you the action when it happens \n    fly manually with or without Newtonian physics or use autopilots exclusively \n    22 track theatrical-quality award-winning soundtrack by renown composer, Sean Beeson\n\nNOTE: Dangerous uses a lot of memory during play, so if you have an older device, please close extraneous programs and reboot prior to playing. You may also turn on the low polygon-count space stations in the Systems menu inside of stations.\n\nWhat's in this version : (Updated : Jul 14, 2012)\n\n    cloud save (play your saved game from any desktop or mobile device)\n    new autosave slot and save your game to any slot\n    integrated autopilots: dock, warp, gate\n    graphical improvements\n    better missiles\n    revamped UI\n    radial autopilot and wingman control with a simple autopilot button\n    short-cuts wheel\n    pulsing arrow in the tutorials\n    scanner button\n    HD version has hi-resolution stars, planets, and moons with animated clouds for the Earth-like planets and animated star coronas.\n\nRequired Android O/S : 2.1+\n\n\nInstructions Included\n","torrent":{"xt":"urn:btih:70e1b702892a788095c0c48e47be24b8a0be922a","amp;dn":"Dangerous+HD+v1.1.0+build+7+Final+%2B+SD+Data+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70e1b702892a788095c0c48e47be24b8a0be922a","infoHashBuffer":{"type":"Buffer","data":[112,225,183,2,137,42,120,128,149,192,196,142,71,190,36,184,160,190,146,42]},"announce":[],"urlList":[]}}