{"title":"Magicians - Dan Fleshman - Restaurant Magic vol.1 - DVDRip Xvid","uid":7546989,"size":732619323,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:71230bac7c4345317ad3102c72b3059a8c54ed72&amp;dn=Magicians+-+Dan+Fleshman+-+Restaurant+Magic+vol.1+-+DVDRip+Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MagicManPC","files":4,"time":1345374335,"description":"\nDan Fleshman - Restaurant Magic vol.1 - DVDRip Xvid\n &lt;a href=&quot;\nhttp://www.llpub.com/zenshop/index.php?main_page=product_info&amp;cPath=27&amp;products_id=2031&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.llpub.com/zenshop/index.php?main_page=product_info&amp;cPath=27&amp;products_id=2031&lt;/a&gt;\n\nDan Fleshman has been a professional close-up entertainer for 20 years and performing magic in restaurants has always been at the core of his work. The magic presented here is all in Dan's active, working repertoire and all of it has been tempered in the white-hot fire of real-world performance. This is close-up magic that Dan kills lay audiences with night after night - and now it's yours!\n\nOn these three DVDs, Dan presents his showcase routines. For special tables, Dan reaches into his vast repertoire and performs one of these gems. All of them are closers and are capable of astounding even the most jaded audience.\n\nVolume 1 - Appetizers\n\nDan's Rope Routine - A great opening routine featuring elements of the most visual rope and ring &amp; rope magic ever created.\n\nReal-World Multiplying Rabbits - A classic of magic and a favorite of young and old.\n\nRing and String Flight - A borrowed finger ring almost visibly transforms into the performer's ring, which then penetrates on and off of a length of string in most mysterious ways. The routine comes full circle when the spectator's borrowed ring is found in the performer's key case.\n\nAce Production - In a dazzling display of skill, the four Aces appear to fly right from the center of a shuffled deck.\n\nEver Changing Aces - The red Aces change places with the black Aces under extremely fair circumstances. If you blink, you'll miss it!\n\nBullet For a Cowboy - The Aces all magically change into the Ace of Spades one at a time. For the stunning climax, the cards are turned over and now found to be the Kings.\n\nFour The Easy Way - Two Aces are produced from a shuffled deck. The third Ace is freely selected by a spectator. Another spectator selects one more card, which is found to not be an Ace. The magician makes good by magically turning this final card into the last Ace.\n\nMaxi Twist Twist - A spectator selects a card which is returned to the pack. The four Aces are displayed and each magically turns face down one at a time. The Ace that matches the suit of the selected card turns face up again and then magically turns into the selected card. The other cards are turned face up to reveal that they are no longer Aces but rather, now form a Royal Flush.\n\nThree Card Trick - A spectator counts three cards slowly and fairly into the performer's hand. However, when recounted, a fourth card is found. The extra card is discarded yet there are still four cards. This comedy of errors is repeated several times yet there are always four cards. For the humorous and amazing finish, these cards are shown to be the four Threes.\n\nMomma in My Wallet - A wonderful combination of the classic Card to Wallet with the Red Hot Momma concept. The back of a spectator's signed card changes color. The card is placed on the table and another card is selected. The tabled card turns into the second selection and the signed card is found in the performer's wallet that the spectator has been holding the entire time.\n\n----------------------------------------------\nYou can download the full DVDs and the rest \nof the series on Usenet at alt.binaries.magic \n(see the included pdf in this download).\n----------------------------------------------\n\nEnjoy!\n","torrent":{"xt":"urn:btih:71230bac7c4345317ad3102c72b3059a8c54ed72","amp;dn":"Magicians+-+Dan+Fleshman+-+Restaurant+Magic+vol.1+-+DVDRip+Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71230bac7c4345317ad3102c72b3059a8c54ed72","infoHashBuffer":{"type":"Buffer","data":[113,35,11,172,124,67,69,49,122,211,16,44,114,179,5,154,140,84,237,114]},"announce":[],"urlList":[]}}