{"title":"Up with Chris Hayes 9-2-12.mp4","uid":7595822,"size":383799235,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:73a4eb84e29fb3fa397325518c115beafc1a118e&amp;dn=Up+with+Chris+Hayes+9-2-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1346691995,"description":"Up with Chris Hayes; Sunday, September 2, 2012.\n\nChris and his panel previewed the upcoming Democratic National Convention by taking a close look at the state of the modern Democratic Party -- the voters, delegates, funders and interest groups that make up today's Democratic coalition. They examined the decline of organized labor and President Obama's relationship with Wall Street, and had a blockbuster panel of House and Senate candidates from across the country, who told what they are seeing in their battleground districts as they interact with voters.\n\nJoining Chris Sunday were:\n\nVan Jones (former special adviser for green jobs in the Obama White House and co-founder of Rebuild the Dream, Rose Aguilar (radio host of &quot;Your Call&quot; on KALW radio in San Francisco and op-ed contributor to Al Jazeera English,Neera Tanden (president of the Center for American Progress, John Nichols (Washington correspondent for The Nation and associate editor for The Capital Times in Madison, Wisconsin.)\n\nSaladin Muhammad (United Electrical Workers) joined via satellite to discuss union busting.\n\n\nRobert Wolf (former president of UBS Bank, member of President Obama's Council on Jobs and Competitiveness, and host of the weekly webcast &quot;Impact Players&quot; on the Reuters YouTube channel) replaced Rose Aguilar on the panel. The new panel discussed the loss of funding for Obama from Wall Street and who they are supporting.\n\nRob Zerban (Democratic candidate challenging Rep. Paul Ryan in Wisconsin's first congressional district), Cynthia Dill (state senator from Maine and Democratic candidate for the U.S. Senate seat being vacated by retiring Sen. Olympia Snowe), New York State Assemblyman Hakeem Jeffries (Democratic congressional candidate in New York's 8th district, Arizona State Senator Kyrsten Sinema (Democratic congressional candidate in Arizona's 9th district, Nate Shinagawa (vice chair of the Tompkins County Legislature in New York and Democratic congressional candidate in New York's 23rd district) replaced the entire panel.\n\nKysten Sinema (D-AZ) (US congressional candidate) joined Chris via satellite about bipartisanship.\n\n'You Should Know' the original panelists returned for the final segment.","torrent":{"xt":"urn:btih:73a4eb84e29fb3fa397325518c115beafc1a118e","amp;dn":"Up+with+Chris+Hayes+9-2-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73a4eb84e29fb3fa397325518c115beafc1a118e","infoHashBuffer":{"type":"Buffer","data":[115,164,235,132,226,159,179,250,57,115,37,81,140,17,91,234,252,26,17,142]},"announce":[],"urlList":[]}}