{"title":"The Ultimate Harry Potter and Philosophy: Hogwarts for Muggles","uid":7544321,"size":1250009,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76f1197cd65d0cd2e3be820fe4c2097564915f53&amp;dn=The+Ultimate+Harry+Potter+and+Philosophy%3A+Hogwarts+for+Muggles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"iradins","files":-1,"time":1345305706,"description":"The Ultimate Harry Potter and Philosophy: Hogwarts for Muggles (The Blackwell Philosophy and Pop Culture Series) [Paperback]\nWilliam Irwin (Editor), Gregory Bassham (Editor)\n\nPaperback: 304 pages\nPublisher: Wiley; 1 edition (September 14, 2010)\nLanguage: English\nFormat: epub, mobi\n\nA philosophical exploration of the entire seven-book Harry Potter series\n\nHarry Potter has been heralded as one of the most popular book series of all time and the philosophical nature of Harry, Hermione, and Ron's quest to rid the world of its ultimate evil is one of the many things that make this series special. The Ultimate Harry Potter and Philosophy covers all seven titles in J.K. Rowling's groundbreaking series and takes fans back to Godric's Hollow to discuss life after death, to consider what moral reasoning drove Harry to choose death, and to debate whether Sirius Black is a man or a dog.\n\nWith publication timed to coincide with the release of the movie Harry Potter and the Deathly Hallows (Part 1), this book will be the definitive guide for all fans looking to appreciate the series on a deeper level.\n\nCovers a range of intriguing topics such as the redemption of Severus Snape, the power of love, and destiny in the wizarding world\nGives you a new perspective on Harry Potter characters, plot lines, and themes\nMakes a perfect companion to the Harry Potter books and movies\nPacked with interesting ideas and insights, The Ultimate Harry Potter and Philosophy is an ideal companion for anyone interested in unraveling the subtext and exploring the greater issues at work in the story.","torrent":{"xt":"urn:btih:76f1197cd65d0cd2e3be820fe4c2097564915f53","amp;dn":"The+Ultimate+Harry+Potter+and+Philosophy%3A+Hogwarts+for+Muggles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76f1197cd65d0cd2e3be820fe4c2097564915f53","infoHashBuffer":{"type":"Buffer","data":[118,241,25,124,214,93,12,210,227,190,130,15,228,194,9,117,100,145,95,83]},"announce":[],"urlList":[]}}