{"title":"Inquisitor-SKIDROW","uid":7606101,"size":2011212032,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:798f7f550d95480d0fbb2ab9dc7f9e80ca758505&amp;dn=Inquisitor-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Gh0stNet","files":2,"time":1346950303,"description":"S K I D R O W\n\nthe leading force\n\nproudly presents\nInquisitor (c) Cinemax\n\n06-09-2012....Release Date &lt;-&gt; Protection.................Nothing\nRPG..............Game Type &lt;-&gt; Disk(s)......................1 DVD\n\nRELEASE NOTES\n\nUltherst was once a peaceful, God-fearing land until the Three Scourges\nof God came to pass as foretold by Saint Ezekiel, one of the twelve\nfollowers of the First Prophet. First came the famine that devasted the\npopulace. Next came the plague that added more unfortunate souls on\nDeath's abacus. Finally came the great rain of fire, and death fell\ndown on sinner and innocent alike, blood flooding the streets in place\nof water. The people, in their desperation, turned away from the Holy\nMother Church and delved deep into pagan decadence or succumbed to the\ntemptation of the Devil. You have been charged with the office of\nInquisitor. It is up to you to investigate crimes against the one true\nfaith and root out heresy--using any and all means necessary\n\nInquisitor is a unique blend of action-oriented combat with a deep and\ninvolving tale of betrayal, torture, madness, and infernal damnation\nPut your wits to the test as you collect evidence against possible\nheretics and put them to trial once they have been charged. Use the\nmight of the Inquisition to extract a confession from your subjects\nbut be warned, use your power wisely or you will face the consequences\n\nFeatures:\n\nThree character classes--Paladin, Priest, and Thief--each with his own\nunique and independent story\n\nWield the power of the Inquisition as you arrest heretics; use a\nvariety of tools-such as the iron maiden, suspension, and the rack-to\nextract confessions and burn the heretics!\n\nA wide, open-ended world for you to explore and exploit as you see fit\n\nMore than 200 weapons, 80 spells, and 7 schools of forbidden and\nallowed magic!\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Play the game\n5. Support the companies, which software you actually enjoy!\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups!\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix + irokos\ntitan artdivision","torrent":{"xt":"urn:btih:798f7f550d95480d0fbb2ab9dc7f9e80ca758505","amp;dn":"Inquisitor-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"798f7f550d95480d0fbb2ab9dc7f9e80ca758505","infoHashBuffer":{"type":"Buffer","data":[121,143,127,85,13,149,72,13,15,187,42,185,220,127,158,128,202,117,133,5]},"announce":[],"urlList":[]}}