{"title":"Counter Strike Source [No-Steam / ZM / Version: 1.0.0.72/22 4981","uid":7548291,"size":3256798253,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7b8dd01413d3241b67780fea0c1a14441ff9fbe1&amp;dn=Counter+Strike+Source+%5BNo-Steam+%2F+ZM+%2F+Version%3A+1.0.0.72%2F22+4981&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1345410660,"description":"Information\nTitle: Counter-Strike Source Zombie Mod\nGenre: Shuter / 1st Person\nDeveloper: VALVe, Turtle Rock Studios\nPublisher: VALVe, Beech\nYear: 2012\nMedicine: Built (No-Steam)\nVersion: 1.0.0.72\n\nSystem requirements:\n Operating system Windows 2000/XP/Vista/7\n 1,7 GHz processor or higher;\n RAM: 512 MB or more;\n Video card with DirectX 9;\n Internet connection\n\nDescription:\n In Counter-Strike Source Zombie's a little different than normal CSS. Early in the game, look like on pery as usual, but after just half a minute, and even before, you realize that you running side by side with his opponent only to come together to resist &quot;the forces of evil,&quot; and simply put Zombies! There is no difference between ST and T are all fighting together against zarazhonnyh and may even on some maps have one respawn (!) Yes, yes, do not be surprised, that's right! But after half a minute one of the total weight of the players infects\n\n Zombera task - infect as many players. For every infected player, he gets frag.\n\n The task of the people (now as we shall call those who are not infected) - not to do so vile bastards, huddled in groups and zabarikadirovavshis in the house, etc.\n Now the course is everything that comes their way, the doors and windows are flooded with wardrobes and sofas, zombies crawling everywhere, the game turns into the meat.\n\n You have to either hide in a small room and hit things, or taking what is the height, stay to the end. The gameplay is so addictive that come off quite problematic. But ... desirable to have a large number of people, that the game is not just dynamic, and the confrontation turns into laughing! In general, it is useless to talk, you just need to sit down and see it!\n\n Opportunities Zombies: night vision, infected cleaver, and physical advantages over people (speed, weight, life, jumps)\n Opportunities uninfected: at their disposal the whole arsenal of weapons, a lot of bullets and cases to fill up the passage.\n\n The purpose of the zombies infect everyone who is not infected, uninfected opposite goal - not to do so infected with rabies.\n\nInstallation:\n\n 1) Extract the files.\n 2) Run Run_CSS.bat (located in the folder with the game)\n\nRelease:","torrent":{"xt":"urn:btih:7b8dd01413d3241b67780fea0c1a14441ff9fbe1","amp;dn":"Counter+Strike+Source+%5BNo-Steam+%2F+ZM+%2F+Version%3A+1.0.0.72%2F22+4981","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b8dd01413d3241b67780fea0c1a14441ff9fbe1","infoHashBuffer":{"type":"Buffer","data":[123,141,208,20,19,211,36,27,103,120,15,234,12,26,20,68,31,249,251,225]},"announce":[],"urlList":[]}}