{"title":"American Swastika = Inside the White Power Movement.pdf","uid":7572852,"size":1277394,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c5e25aaa6edcd32d9959d0e01548d21bad2758a&amp;dn=American+Swastika+%3D+Inside+the+White+Power+Movement.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sakstroy","files":-1,"time":1346036574,"description":"America's white see themselves as an endangered minority, according to this book look at the white supremacist movement. Simi, an associate professor of criminology and criminal justice at the University of Nebraska, teams up with Futrell, an associate professor of sociology at the University of Nevada, to provide a panorama of the white power movement in its different regional and ideological iterations. With insight and clarity, the authors offer a detailed review of supremacist literature, as well as the role the Internet has played in strengthening the movement....\n\n\nThe book is indisputably a powerful and unnerving study of how parents indoctrinate their children to hate and fear minorities, and the role that activities as mundane as concerts, house parties and tattooing can play in the conversion of new recruits into these subcultures. Also helpful is the overview of groups ranging from the Ku Klux Klan to racist skinheads, each of whom have their own distinctive beliefs, social codes and agenda. (Publishers Weekly )\n\nPete Simi, an associate professor of criminal justice at the University of Nebraska at Omaha kept going back, kept trying to get deeper into the mind of the modern American white supremacist. And that's likely why his book, &quot;American Swastika,&quot; is such a fascinating read-an unusually lively read, really, considering it's also intended to be an academic look at the subject by an academic. His walk on the wild side not only enriched the sociological insights of the book, but inspired vivid, frightening narratives from his time spent walking with some of this country's most fanatically racist people. (Obama supporters)\n\n","torrent":{"xt":"urn:btih:7c5e25aaa6edcd32d9959d0e01548d21bad2758a","amp;dn":"American+Swastika+%3D+Inside+the+White+Power+Movement.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c5e25aaa6edcd32d9959d0e01548d21bad2758a","infoHashBuffer":{"type":"Buffer","data":[124,94,37,170,166,237,205,50,217,149,157,14,1,84,141,33,186,210,117,138]},"announce":[],"urlList":[]}}