{"title":"Raiou.2010.JAP.DVDRip.x264.AC3-zdzdz","uid":7450809,"size":1571108550,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7c7a6b1aad00d50b777376ddb871117fa786045d&amp;dn=Raiou.2010.JAP.DVDRip.x264.AC3-zdzdz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mfccorrea","files":2,"time":1342502747,"description":"Synopsis/ Plot:\nSet during the Edo Period, a young man from a noble family meets a young woman under a special tree called &quot;Raiou&quot; (the tree was struck by lightning at one time with the broken part eventually sprouting out cherry blossoms). The young woman lived freely in the mountains after she was abducted as a young child. The couple soon fall in love under the Raiou tree, but become acutely aware of their different social positions &amp; the ramifications it has on their relationship.\nNarimichi (Masaki Okada), born to the high ranking Tokugawa family, spends his sheltered days bored and lonely. One night, the family retainer, Sukejiro Seta (Keisuke Koide) tells Narimichi of a story involving Tenku, a monster who resides in the mountains near his hometown of Setamura. Narimichi is fascinated by the tale and heads off to Setamura with Sukejiro Seta.\nRai (Yu Aoi) lives on the mountains near Setamura. She lives with her foster father Riemon (Saburo Tokito). Twenty years ago Riemon refused orders to kill young Rai over disputes of water rights and since then has raised her as his own child. Rie often threatens villagers who come into the mountains to not damage the mountains.\nOn the way to Setamura, Narimichi decides to ride alone into the mountains to where the rumored Tenku lives. There he comes across Rai.\nNarimichi, now back in Setamura, tells Sukejiro of a female Tenku he came across in the mountains. Sukejiro responds that he is sure the woman he saw is his younger sister Yu - who was kidnapped 20 years ago.\nRie, who was told by her foster father to go live with her birth family, then comes to live in the village of Setamura as Yu. Narimichi and Yu meet once again near the lightning tree. Yu, having grown up alone in the mountains, knows nothing of the class system &amp; treats Narimichi in a frank, honest way. They are both attracted to each other ...\n\n\nFile/Video Technical Info\n\nVIDEO\nFile Type: mkv\nVideo Codec: x264\nVideo Format: 720x384\nAspect Ratio: 1.875\nVideo Bitrate: 1189 kbps\nVideo Frame Rate: 23.976 fps\nFile Source: DVD JAP\n\nAUDIO\nAudio Codec: AC3 (Ch. 6 - 48000Hz)\nAudio Bitrate: 384 kbps\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1572189/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1572189/&lt;/a&gt;\n\nJapanese audio; Japanese (in mkv) and english (srt) subtitles","torrent":{"xt":"urn:btih:7c7a6b1aad00d50b777376ddb871117fa786045d","amp;dn":"Raiou.2010.JAP.DVDRip.x264.AC3-zdzdz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c7a6b1aad00d50b777376ddb871117fa786045d","infoHashBuffer":{"type":"Buffer","data":[124,122,107,26,173,0,213,11,119,115,118,221,184,113,17,127,167,134,4,93]},"announce":[],"urlList":[]}}