{"title":"Camera FV-5 v1.24 Final By bobiras2009","uid":7581589,"size":1301600,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:7cd24cd0115abe41166471dbd928c4ffa692f033&amp;dn=Camera+FV-5+v1.24+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346261625,"description":"                             By bobiras2009\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nTailored to enthusiast and professional photographers, with this camera application you can capture the best raw photographs so that you can post-process them later and get stunning results. The only limit is your imagination and creativity!\n\nFeatures :\n\n    All photographic parameters are adjustable and always at hand: exposure compensation, ISO, light metering mode, focus mode, white balance and program mode.\n    DSLR-like viewfinder display: see exposure time, aperture and stops display with EV and bracketing settings.\n    Full fledged exposure bracketing: from 3 to 7 frames, unlimited stops spacing, plus custom EV shifting.\n    Built-in intervalometer: make stunning timelapses (even bracketed/HDR timelapses) and time-controlled picture series.\n    Program and Speed-priority modes.\n    Long exposure support: take beautiful night photos and light trails with long exposure times up to 60 seconds*.\n    JPEG as well as RAW (PNG) image formats for lossless photo capturing, perfect for post-processing.\n    EXIF and XMP sidecar metadata support.\n    Self timer for delayed shooting.\n    Autofocus, macro, touch-to-focus** and infinity focus modes, plus a focus lock switch (AF-L).\n    In background photo developing and processing allows a smooth, uninterrupted camera operation.\n\nThis camera application completely avoids scene modes, instead you get full manual control over all photographic parameters, just like you do with a reflex camera, so you can ultimately control every aspect of the picture, and leave the post-processing to the computer. So after your DSLR, you will never miss a photo opportunity again, being able to capture it with the closer sensation to your DSLR as possible.\n\nWhat's in this version: (Updated : Aug 28, 2012)\n\n    New: grid overlays. Located under Settings &gt; Viewfinder, allows overlaying a rule of thirds, one quarter or crosshair grid over the camera viewfinder.\n    Fixed: XMP metadata writing revised.\n\nRequired Android O/S : 2.2+\n\n\n\n\n                             By bobiras2009\n","torrent":{"xt":"urn:btih:7cd24cd0115abe41166471dbd928c4ffa692f033","amp;dn":"Camera+FV-5+v1.24+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cd24cd0115abe41166471dbd928c4ffa692f033","infoHashBuffer":{"type":"Buffer","data":[124,210,76,208,17,90,190,65,22,100,113,219,217,40,196,255,166,146,240,51]},"announce":[],"urlList":[]}}