{"title":"Mushrooms PRO + SD Data v1.0 Final By bobiras2009","uid":7605174,"size":9662108,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:7d77dfc33a6994bae46c082b159d5042f7005f89&amp;dn=Mushrooms+PRO+%2B+SD+Data+v1.0+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346931634,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nRequirements: Android 1.6+\nOverview: Mushrooms PRO by NATURE MOBILE - 300 species, 2000 photos, easy Identify!\n\n\nHow often does it happen that you're out in the wild and you discover mushrooms that you would like to eat or learn more about?\n\nWith the full app, you will get the beauty and diversity of the mushroom flora onto your Smartphone or Tablet. You will get to know the most popular edible and common toxic mushrooms that can be found across the world. With the identification functions you will straightaway find the species you are looking for. The more characteristics you add, the more accurate your identification will be. Just give it a try!\n\nIn the App 300 common mushroom types are shown and described and there are more than 2000 color images. Specific types of appearance, but also variations are considered. Collectors and mushroom fans thus obtain an overview of the important edible or toxic mushrooms. Beyond that, rare or particularly interesting species are included.\n\nSimple identification keys and summaries help you navigate in the diverse world of mushrooms. Importance is placed on ensuring that all easily recognizable characteristics are included. Therefore, characteristics unrecognizable by the human eye were largely omitted. However, you should know that nature offers many more species (approx. 1 million), that without the aid of a microscope or other devices are in some cases unidentifiable. This is referred to in the descriptions every now and then.\n\n\nSEARCH AND IDENTIFY SPECIES BY\n\n* APPEARANCE AND SCENT\n- size, color, hat, gills, stem, etc.\n* EDIBILITY AND TASTE\n- toxic, edible, allergen, etc.\n* FRIUT BODY TYPE\n- belly mushrooms, gilled mushrooms, truffle, etc.\n* HABITAT\n- deciduous or coniferous forest floor, etc.\n* FAMILY\n- Agaricaceae, Boletaceae, Clathraceae, etc.\n* MEDICINAL BENEFIT AND POISON\n- antibiotic, Psilocybin, Muscarin, etc.\n\n\nNote:\nUse Lucky Patcher to remove license verification\n\n\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:7d77dfc33a6994bae46c082b159d5042f7005f89","amp;dn":"Mushrooms+PRO+%2B+SD+Data+v1.0+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d77dfc33a6994bae46c082b159d5042f7005f89","infoHashBuffer":{"type":"Buffer","data":[125,119,223,195,58,105,148,186,228,108,8,43,21,157,80,66,247,0,95,137]},"announce":[],"urlList":[]}}