{"title":"Sharpshooter 2.0.4","uid":7525278,"size":7692432,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:7ef01e8998c52ba03ab4d35c7fe47a32dc0ca9ee&amp;dn=Sharpshooter+2.0.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"openarena","files":-1,"time":1344762497,"description":"\nSharpshooter lets you rename your screenshots with pinpoint accuracy. Sharpshooter is a small utility which aids the management of screenshots.\n\nSharpshooter lets you manipulate and process the screenshot while it is still fresh on your mind.\n\nWhen you take a screenshot on Mac OS X with Command-Shift-3 (or with another variation) Sharpshooter will present a window where you can review the picture and choose what to do with it. You can either rename it from its default name to something more descriptive, move the screenshot to the Trash, or cancel the operation keeping the screenshot as it is.\n\nWhat's New\nVersion 2.0.4:\n\nCode signed with Developer ID for Gatekeeper compatibility.\nContains updates for Retina display Macs.\nStatus menu icon is now colored when screenshot monitoring is enabled.\nFixed an issue with new screenshot windows being placed in front of existing windows and interrupting your workflow.\nAdded a few more date and time auto-renaming tokens.\nNow asks to move Sharpshooter.app to the Applications folder. While not required, it's highly suggested that you keep the app in that folder. If you move Sharpshooter while it or its hidden background agent is running, the app won't function properly.\nFixed a possible mismatch between the file extension shown in the Name field and the Format popup.\nFixed issue where the app terminated before it finished moving some files to the Trash.\nFixed a problem with moving a screenshot to a folder if the folder no longer exists.\nFixed a Lion compatibility issue with the preferences window.\nMade the login item code more robust.\n\nRequirements\nIntel, Mac OS X 10.6.6 or later ","torrent":{"xt":"urn:btih:7ef01e8998c52ba03ab4d35c7fe47a32dc0ca9ee","amp;dn":"Sharpshooter+2.0.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ef01e8998c52ba03ab4d35c7fe47a32dc0ca9ee","infoHashBuffer":{"type":"Buffer","data":[126,240,30,137,152,197,43,160,58,180,211,92,127,228,122,50,220,12,169,238]},"announce":[],"urlList":[]}}