{"title":"Sexually Broken-------SB-Bondage Has Evolved Bitches  Felony  M","uid":7504027,"size":698353293,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:7f337cd3303877974ea820c9cd338e8eb3612493&amp;dn=Sexually+Broken%5C-------SB-Bondage+Has+Evolved+Bitches++Felony++M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"merzedes","files":-1,"time":1344109071,"description":"Bondage Has Evolved Bitches, Where's Your God Now | Felony | Matt Williams\n\n \n\nAugust 3, 2012    \n\nMP4 + Pics.\n\n \n\nWelcome Felony to Sexually Broken. This amazingly flexible MILF is one of the hottest 30 somethings you will ever see suffer extreme bondage. Come for the Category 5 suspension, stay for the gallon of squirt we rip out of her helpless body.\n\n \n\nYou know how you go to every other bondage sex site, and the girl is already tied up and stays in that one position the entire time, while some one walks around her and hits her with something? Well those days are over. Sexually Broken evolves bondage before your eyes. \n\n \n\nWhat starts as a spread position on the bed morphs into a beautiful &quot;Fuck Me&quot; position which morphs into an amazing Category Five suspension. So seriously, if you're looking for the best &quot;technical&quot; most creative bondage and sex on the net you're at it right now. And we don't have to hire male porn stars that know nothing about bondage to do the fucking.\n\n \n\nFelony starts bound spread and helpless. We start by cutting and trimming her unruly pussy hair, and depositing the trimmings into her mouth. Then it is time to make this MILF cum and cum hard. Her first orgasm is a squirt feist of biblical proportions. She didn't have permission to cum, so we cane her feet and bring the vibrator back again. Her second orgasm dwarfs her other in intensity and volume. You won't believe your eyes, seriously won't believe it. \n\n \n\nFelony is now a drooling, cum drunk mess, we pull her legs back and give her brutal rough fucking. She gets a professional dick down and cums multiple time while taking cock. Before she can understand what is even happening she is suspended in a catastrophic back arching suspension from hell that is truly beautiful to behold. Once up, we rip another screaming squirting orgasm out of our Hot MILF. Felony is done, all she can do is suffer in the extreme bondage and wait for for us to become interested in her again...  \n\n \n\nScreens\n &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_03felony2/SexuallyBroken-Felony-Matt-Williams-Where-is-Your-God-Now.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_03felony2/SexuallyBroken-Felony-Matt-Williams-Where-is-Your-God-Now.php&lt;/a&gt;\n\n \n\nAnd if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\n \n\nCheers  :-) \n","torrent":{"xt":"urn:btih:7f337cd3303877974ea820c9cd338e8eb3612493","amp;dn":"Sexually+Broken%5C-------SB-Bondage+Has+Evolved+Bitches++Felony++M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f337cd3303877974ea820c9cd338e8eb3612493","infoHashBuffer":{"type":"Buffer","data":[127,51,124,211,48,56,119,151,78,168,32,201,205,51,142,142,179,97,36,147]},"announce":[],"urlList":[]}}