{"title":"Guild Wars complete DirectSong music folder mp3 320Kb/s instead ","uid":7546260,"size":963780825,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:80e3ce0dcf0a4f08f81473c004818e20ddf38a89&amp;dn=Guild+Wars+complete+DirectSong+music+folder+mp3+320Kb%2Fs+instead+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DieDatagear","files":-1,"time":1345356225,"description":"This torrent contains the complete Guild Wars soundtrack excepting the Halloween theme, in mp3 format, 320Kb/s. \n\n\nIt's also ready to use with the game, replacing all wma files with the mp3, and allowing users who purchased the soundtrack to use it with their game even if DirectSong no longer supports the licenses in their wma files.\n\nJust save the entire folder into a desired location (e.g.: C:Users[Username]MusicDirectSong) without altering the directory structure, and run the RegisterDirectSongDirectory.exe file.\nIf you didn't alter the folder structure and didn't replace, alter or remove the GuildWars.ds file or removed the ds_GuildWars.dll file, Guild Wars will recognize the mp3s as additional music from music packs.\nYou can quickly try if it worked in the loading screen by pressing F11 and checking the Sound tab in the Options panel.\n\n\nIf you already have Guild Wars DirectSong files, you will have to replace your GuildWars.ds file with this one if you want to play the mp3 files instead the wma. If you want to keep a customized GuildWars.ds, just  open it with a text editor and do a &quot;Replace All&quot; search, replacing &quot;.wma&quot; with &quot;.mp3&quot;.\nIf you have no other DirectSong files other than Guild Wars' you can safely rename or remove the already existing DirectSong directory and replace it with this one.\n\n\nYou can also use the included Guild Wars Directsong Playlist Editor to edit the GuildWars.ds file, customizing its playlists, and even adding your own music.","torrent":{"xt":"urn:btih:80e3ce0dcf0a4f08f81473c004818e20ddf38a89","amp;dn":"Guild+Wars+complete+DirectSong+music+folder+mp3+320Kb%2Fs+instead+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80e3ce0dcf0a4f08f81473c004818e20ddf38a89","infoHashBuffer":{"type":"Buffer","data":[128,227,206,13,207,10,79,8,248,20,115,192,4,129,142,32,221,243,138,137]},"announce":[],"urlList":[]}}