{"title":"Darksiders II Save Games With Collection Sets + TRAINER &amp; ED","uid":7550077,"size":4518415,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:81489ffeb79f3487bd856290c1b76b80eaeb38fb&amp;dn=Darksiders+II+Save+Games+With+Collection+Sets+%2B+TRAINER+%26amp%3B+ED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"StepkeSD","files":-1,"time":1345461398,"description":"These Are Darksider II Game Saves With All Collections Sets &amp; Weapons Given As A Bonus At Start Of Darksiders Game And From His Post Compartment Put In His Inventory. Plus The Trainer With 14 Options Included(PS. Only NUMPAD1 Is GOLD It's Swiched With HEALTH On NUMPAD3).\n\n1. Copy Darksiders2 Folder From These Folders To: C:Users&quot;YOUR PROFILE FOLDER&quot;DocumentsMy Games\n2. Copy Same Saves From That Darksiders2 Folder With options.dopt File To: C:Users&quot;YOUR PROFILE&quot;AppDataLocal&quot;GAME PROFILE FOLDER&quot;&quot;PROFILE NUMBER&quot;Storage\n3. Optional: Start The Game Trainer As Administrator(For Windows Vista/7) &amp; Start A Game The Same Way And You Can Use Desired Trainer Options In A Game.\n4. Optional: Start Game EDITOR As Administrator Click Register When Done Click Login &amp; Change Game Stats.\n5. Have Lots Of FUN &amp; InJOY!\n\nTips: \n1. Want A New Weapons &amp; Stuff? Well In Trainer Set Unlimited Gold &amp; Coins, Than Go To Vulgim And Buy Trinkets To Get Best Of It &amp; Be Suprised.\n2. Want The Best Upgrade For Your Possesed Weapons Than Upgrade Your Weapon With Stuff Until It Almost Hits Upgraded LEVEL Than Buy Item With Talisman Icon That Is A Sucreficial Item with It Finnish Your Upgrade To The MAXIMUM.\n3. Best Experienc Is When You You Use TRAINERS Unlimited Options Just To Learn To Fight Bosses With Riddle How To Finish Them e.t.c.\n\nIMPORTANT: \n1. When Upgrading Skill LEVELS Don't Cross Over The LEVEL Of The Character Or You Will Ruin Many Skills Added. \n2. If You Set Skill Points To Unlimited You Can't Undue Your Skill TREE With Vulgrim's Trinket Until You Use Game EDITOR To Lower Your Skill Points Rate. There Also You Can Reset The TREE Manually.\n\nPS. On Torrent SEED People Please It Is A Small File Bat My Upload Is Low. Thank You Very Much Bros &amp; Sises.","torrent":{"xt":"urn:btih:81489ffeb79f3487bd856290c1b76b80eaeb38fb","amp;dn":"Darksiders+II+Save+Games+With+Collection+Sets+%2B+TRAINER+%26amp%3B+ED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81489ffeb79f3487bd856290c1b76b80eaeb38fb","infoHashBuffer":{"type":"Buffer","data":[129,72,159,254,183,159,52,135,189,133,98,144,193,183,107,128,234,235,56,251]},"announce":[],"urlList":[]}}