{"title":"The Tennors~Rock Steady Classics (Nighthawk) [FLAC] {MKOP}","uid":7565741,"size":264134870,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:837de321449492e8b193fe066ecb03b066e05787&amp;dn=The+Tennors%7ERock+Steady+Classics+%28Nighthawk%29+%5BFLAC%5D+%7BMKOP%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mudmashers","files":19,"time":1345858703,"description":"The Tennors~Rock Steady Classics (Nighthawk) [FLAC] {MKOP}\n\nThe Nighthawk label redresses a great injustice, shining the spotlight on the Tennors, one of Jamaica's finest vocal groups, with this crucial compilation. Formed in 1967 by veteran vocalist George ''Clive'' Murphy, the trio mashed up the island with their debut single, ''Pressure and Slide.'' Boasting innuendo-laced lyrics and a phenomenal Studio One rhythm that would go down in the annals of \nhistory, ''Pressure and Slide'' was the biggest-selling record of the year. The following year, Murphy launched his own label, Tennors, and inaugurated it with the self-produced ''Ride Yu Donkey,'' another smash single. During this period the Tennors underwent a couple of lineup changes that led to Ronnie Davis, later of Itals fame, taking over lead vocals. Across the rocksteady period the trio unleashed a stream of sublime songs, and as the reggae age dawned they continued successfully on their way. Lineup changes occurred sporadically, but the group's popularity never diminished. On a couple of occasions the Tennors also cut a handful of singles for Duke Reid and Sonia Pottinger to equal success. Their final single, ''Weather Report,'' overseen by the former, dates from 1973 -- by then Murphy had relocated to the States and the group folded. Contrary to its title, Rock Steady Classics encompasses the group's entire career, bundling up some of their biggest hits as well as B-sides and lesser-known numbers, with the sleeve notes providing an excellent overview of the band. The trio was a rarity for their day, a self-produced and self-releasing unit, but sadly this meant that they rarely turn up on compilations, which tend to be exclusively drawn from Studio One or Treasure Isle's archives. Thus, their profile has remained unfairly low abroad, but hopefully this compilation will change all that with these 18 classic cuts.~Jo-Ann Greene (Allmusic)\n\n01. Ride Yu Donkey\n02. Weather Report\n03. Another Scorcher\n04. Baby Come Home\n05. Want Everything\n06. Good News\n07. World Is A Stage\n08. Give Me Bread\n09. We Got Soul\n10. Pressure And Slide\n11. Grandpa\n12. Massi Massa\n13. Sufferer\n14. Run Come\n15. Hopeful Village\n16. Cleopatra\n17. Gee Whiz\n18. Traitor\n\nMusic Keep On Playing*Thank You Seeders","torrent":{"xt":"urn:btih:837de321449492e8b193fe066ecb03b066e05787","amp;dn":"The+Tennors%7ERock+Steady+Classics+%28Nighthawk%29+%5BFLAC%5D+%7BMKOP%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"837de321449492e8b193fe066ecb03b066e05787","infoHashBuffer":{"type":"Buffer","data":[131,125,227,33,68,148,146,232,177,147,254,6,110,203,3,176,102,224,87,135]},"announce":[],"urlList":[]}}