{"title":"I Am Alive-=AviaRa=-","uid":7610078,"size":2158647354,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:83ce02706d7b74021659c0fe7879f6dff7327142&amp;dn=I+Am+Alive-%3DAviaRa%3D-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aviara","files":-1,"time":1347040358,"description":"  One year after, a worldwide cataclysmic event that wiped most of the human \n  race, a man struggles for survival in a desolate city as he tries to reunite \n  with his long lost wife and daughter. In this post-apocalyptical tale, there \n  are no supernatural threats, just an everyman who faces a decaying and \n  hazardous world and humanity's darkest inclinations. Will you hang on to \n  your humanity and help strangers or are you ready to sacrifice others in \n  order to survive?\n  \n  The dead city of Haventon, immersive and treacherous\n  \n  Explore the destroyed, crumbling city across different atmospheric levels, \n  climbing your way to safety. Environments tell the story of the world as it \n  stood before and of what has happened to the city and its people.\n  \n  Unpredictable encounters\n\n  Survivors will adopt different behaviors and adapt to your actions. Some \n  are friendly and need assistance, some are scared and others are hostile \n  and will use group tactics to take you down. Will you go out of your way \n  and sacrifice your few precious resources to help those in need?\n  \n  Intimidation-based combat\n\n  Combat is deadly and ammo is scarce. Players will have to use deception to \n  deal with enemies. Cowards may bow down fast to the threat of an empty gun, \n  but aggressive enemies will put you to the test.\n  \n  Stamina and resource management\n\n  Every effort has its cost. Manage your stamina skillfully to gain access \n  to hidden. Look for resources and supplies scattered throughout the city: \n  water, food, gas, medicine, tools, climbing gears, weapons, ammo and \n  anything else that you can salvage from the destroyed city could prove \n  helpful in your quest.\n\n\nHow To:\n\n1.Install \n2.Play from desktop shortcut\n3.Support the software developers. If you like this game, BUY IT!\n\nYou don`t need any crack or serial\n\nMore info and support here: &lt;a href=&quot;\nhttp://www.aviara.ro/forum/index.php?topic=13339.0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.aviara.ro/forum/index.php?topic=13339.0&lt;/a&gt;\n\n\nIf you like this game seed it to others","torrent":{"xt":"urn:btih:83ce02706d7b74021659c0fe7879f6dff7327142","amp;dn":"I+Am+Alive-%3DAviaRa%3D-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83ce02706d7b74021659c0fe7879f6dff7327142","infoHashBuffer":{"type":"Buffer","data":[131,206,2,112,109,123,116,2,22,89,192,254,120,121,246,223,247,50,113,66]},"announce":[],"urlList":[]}}