{"title":"Sexually Broken--Bound, Throat Fucked,Left on the Floor  Lea Lex","uid":7578872,"size":881142342,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:85e58317386a897912789c706586fb6db49c3029&amp;dn=Sexually+Broken--Bound%2C+Throat+Fucked%2CLeft+on+the+Floor++Lea+Lex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1346186972,"description":"Former Romanian Gymnast, Bound, Throat Fucked and Left Helpless on the Floor | \nAugust 27, 2012\n\nMp4 + Pics\n\n\nWelcome back 5 time National Romanian Gymnast Champion Lea Lexis to Sexually Broken. This hard bodied, beautiful blond has the sexiest accent we have ever heard.\n\n Lea starts clothed in a hot skin tight dress; waiting in her high heels. A quick glance is all you need to see how strong and fit this girl is. Years and years of Gymnastics training has left Lea with an amazing body. We command her to come forward and get on her knees. She is told to close her eyes and open her mouth. \n\nWe can think of nothing hotter right this second then face fucking a 5 time National Romanian Gymnastics Champion We abuse her mouth with cock, she struggles to breath, and to swallow. We are relentless. Sexually Broken brings you the hottest, roughest bound blow jobs on the net. Breath play at it's best!\n\n After a surviving a brutal skull fucking, we strip our sexy gymnast to the waist and bind her perfect natural breast so tight. Little moans of pain whimper from Lea, as the breasts get wrapped tighter and tighter, making her huge nipple get massively erect! We clamp her big nipples and add heavy weights and face fuck her again, causing the weights to swing and sway.\n\n If you had a hard cock, and a helpless former Romanian Gymnast in front of you I think you would do the very next thing we did: pull her to her feet by her throat, turn her around, and fuck her till she cums from behind, while holding one of the tightest most perfect asses in the world. Once she is fucked to a few orgasms, we knock her to the ground, and bind her knees to her neck. \n\nJust to remind our sexy Romanian guest how helpless she really is, we vibrate her to a few more screaming orgasms. She tries to fight but, her body betrays her. Orgasm after orgasm is ripped out of her. We leave her on the floor, struggling, until we decide we want to abuse her again. She has no choice but to wait... \n\n\nScreens  &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_27lea/SexuallyBroken-lea-lexis-Matt-Williams-Former-Romanian-Gymnast-Bound-Throat-Fucked-and-Left-Helpless-on-the-Floor%20.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_27lea/SexuallyBroken-lea-lexis-Matt-Williams-Former-Romanian-Gymnast-Bound-Throat-Fucked-and-Left-Helpless-on-the-Floor%20.php&lt;/a&gt;\n\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n\nCheers  :-) \n\t","torrent":{"xt":"urn:btih:85e58317386a897912789c706586fb6db49c3029","amp;dn":"Sexually+Broken--Bound%2C+Throat+Fucked%2CLeft+on+the+Floor++Lea+Lex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85e58317386a897912789c706586fb6db49c3029","infoHashBuffer":{"type":"Buffer","data":[133,229,131,23,56,106,137,121,18,120,156,112,101,134,251,109,180,156,48,41]},"announce":[],"urlList":[]}}