{"title":"The World from Beginnings to 4000 BCE_0195333152.pdf","uid":7556656,"size":5494854,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:869d86b43d36676889ddaa0ab46288144f6b0da8&amp;dn=The+World+from+Beginnings+to+4000+BCE_0195333152.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"princerajgor","files":1,"time":1345634411,"description":"[b]The World from Beginnings to 4000 BCE by Ian Tattersall[/b]\n\n[b]Published January 1st 2008 by Oxford University Press, USA[/b]\n\n[img]http://images.betterworldbooks.com/019/The-World-from-Beginnings-to-4000-BCE-Tattersall-Ian-9780195167122.jpg[/img]\n\nTo be human is to be curious. And one of the things we are most curious about is how we came to be who we are--how we evolved over millions of years to become creatures capable of inquiring into our own evolution. \n In this lively and readable introduction, renowned anthropologist Ian Tattersall thoroughly examines both fossil and archaeological records to trace human evolution from the earliest beginnings of our zoological family, Hominidae, through the appearance of Homo sapiens to the Agricultural Revolution. He begins with an accessible overview of evolutionary theory and then explores the major turning points in human evolution: the emergence of the genus Homo, the advantages of bipedalism, the birth of the big brain and symbolic thinking, Paleolithic and Neolithic tool making, and finally the enormously consequential shift from hunter-gatherer to agricultural societies 10,000 years ago. Focusing particularly on the pattern of events and innovations in human biological and cultural evolution, Tattersall offers illuminating commentary on a wide range of topics, including the earliest known artistic expressions, ancient burial rites, the beginnings of language, the likely causes of Neanderthal extinction, the relationship between agriculture and Christianity, and the still unsolved mysteries of human consciousness. \n Complemented by a wealth of illustrations and written with the grace and accessibility for which Tattersall is widely admire, The World from Beginnings to 4000 BCE invites us to take a closer look at the strange and distant beings who, over the course of millions of years, would become us.\n\n[b]Format:[/b] PDF\n\n[b]Thanks[/b]\n[img]http://kastatic.com/i2/userpics/824bade088c9791153165b4ab65e1512.gif[/img] ","torrent":{"xt":"urn:btih:869d86b43d36676889ddaa0ab46288144f6b0da8","amp;dn":"The+World+from+Beginnings+to+4000+BCE_0195333152.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"869d86b43d36676889ddaa0ab46288144f6b0da8","infoHashBuffer":{"type":"Buffer","data":[134,157,134,180,61,54,103,104,137,221,170,10,180,98,136,20,79,107,13,168]},"announce":[],"urlList":[]}}