{"title":"Maurette Brown Clark Discography 2002-2011 (2 Releases)","uid":7590070,"size":247345046,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:86b0e6ce7628a955e228ab2016a6ebc392eeced8&amp;dn=Maurette+Brown+Clark+Discography+2002-2011+%282+Releases%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TorrentTracts","files":27,"time":1346515234,"description":"-------------------------------------------------------------------\nMAURETTE BROWN CLARK DISCOGRAPHY\n-------------------------------------------------------------------\n\nThis Maurette Brown Clark discography may or may not be complete.  It contains 2 releases...\n\n * 2002 - By His Grace\n * 2011 - The Sound Of Victory\n\nOriginally from Long Island, New York, Maurette began her singing career with her family group, The Brown Singers. Throughout her formative years, she continued singing with choirs, groups, as well as studying classical piano. Maurette's first CD, entitled 'How I Feel', was released in 1998 on Verity Records. This CD featured the radio friendly, &quot;Breaking of Day&quot;. For this work, she received the Stellar Award for Best New Artist in 1999. Her second CD, 'By His Grace', was released in 2002 on AIR Records, and featured her popular rendition of the praise and worship anthem, &quot;I Just Want To Praise You.&quot; This CD as well received a Gospel Music Workshop of America Gospel Excellence Award and two Stellar Award nominations. She was also nominated for a Dove Award for her part in a remake of the Donnie McClurkin classic, &quot;Stand&quot;, featuring Darryl Coley, Marvin Sapp and Helen Baylor. Maurette's latest CD, entitled 'The Dream' is due to be released in 2007 with great anticipation for its success. This is her first live concert recording and it truly captures the essence of her heart for God. You can hear Maurette's co-production work on the theme song, &quot;Down in the Hole&quot;, for HBO's The Wire (Season 4). She happily maintains her status as a member of Richard Smallwood's choir, Vision, who also have a project due to be released in the upcoming months. This singer/songwriter/producer/musician/wife/mom knows that with God, nothing is impossible and her life and music are a testimony to that fact.\n\nGod Bless,\nTorrentTracts - September 2012\n","torrent":{"xt":"urn:btih:86b0e6ce7628a955e228ab2016a6ebc392eeced8","amp;dn":"Maurette+Brown+Clark+Discography+2002-2011+%282+Releases%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86b0e6ce7628a955e228ab2016a6ebc392eeced8","infoHashBuffer":{"type":"Buffer","data":[134,176,230,206,118,40,169,85,226,40,171,32,22,166,235,195,146,238,206,216]},"announce":[],"urlList":[]}}