{"title":"Blood and Water (Vertigo) (Restored)","uid":7589044,"size":101094890,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:87ceb3b88cd6a924fb165475746b0075d28dcde2&amp;dn=Blood+and+Water+%28Vertigo%29+%28Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1346489862,"description":"Issues 1-5 of 'Blood and Water'\n\nVertigo/DC Comics, 2003\n\nWriter - Judd Winick\nArtist - Tomm Coker\nColors - Jason Wright and Digital Chameleon\nCovers - Brian Bolland\n\nBlood &amp; Water was a 2003 five-issue horror comic book limited series written by Judd Winick and illustrated by Tomm Coker, with covers by Brian Bolland. It was published by Vertigo Comics from March to July, 2003, with cover dates of May to September, 2003.\n\nIt stars Adam Heller, a young man with terminal illness whose friends offer to save his life, but through an unusual means that may come with a price.\n\nSan Francisco resident Adam Heller is a young man who had a bright future ahead of him. But a case of food poisoning when he was twenty gave him Hepatitis A, forcing him to drop out of college, and taking his once athletic body away from him. He has just been told of an inoperable hepatoma on his liver, and has not long to live.\n\nAdam's best friend of five years, Joshua, and his lover, Nicole, tell him that they are vampires, and want to turn him into one to save his life. Adam is frightened, but they explain that vampires are not villains who attack innocent humans, and only drink animal blood, because human blood turns vampires into irreversible psychotics that the vampire community must then &quot;take out&quot;. Although crosses and daylight are not fatal to them, they are sensitive to light, and wear sunblock and sunglasses regularly. They are immortal (Nicole is 278 years old), never become sick, and have five times the strength of humans, though they can die if they bleed to death or experience massive tissue loss.\n\nAdam agrees to become a vampire, and drinks some of their blood. After a painful transformation, he is born anew, the ills suffered from his body having disappeared. Adam enjoys his new life, the powers he has, and the sex that he hasnÎ“Ã‡Ã–t had in three years.\n\nRead more about Blood and Water here...\n  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Blood_%26_Water&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Blood_%26_Water&lt;/a&gt;\t\t","torrent":{"xt":"urn:btih:87ceb3b88cd6a924fb165475746b0075d28dcde2","amp;dn":"Blood+and+Water+%28Vertigo%29+%28Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87ceb3b88cd6a924fb165475746b0075d28dcde2","infoHashBuffer":{"type":"Buffer","data":[135,206,179,184,140,214,169,36,251,22,84,117,116,107,0,117,210,141,205,226]},"announce":[],"urlList":[]}}