{"title":"English Vocabulary Premium II v1 By bobiras2009","uid":7610212,"size":5393117,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:87f67c7a2700f673cb8ae00d6a6f974398d9ba83&amp;dn=English+Vocabulary+Premium+II+v1+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1347043509,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nRequirements: Android 1.6+\nOverview: PREMIUM VERSION WITHOUT PUBLICITY\n\n\nLearn English for free through graphics cards with vocabulary, find the words in English that the game says.\nThanks to this application to learn English, learn it as a game. This application is valid for adults and children with different levels also are updated the screens so you always have to learn new words.\n\nThis application serves to improve educational and learning advanced English vocabulary\n\nThis application is free and provides education to adults and children of all countries learn English: russia, north korea, south korea, germany, portugal, france, Spain, China, Denmark and any other country in the world speaks not English who want to learn the English language. It is valid for anyone, even adults because the vocabulary is varied, can use this tool toddlers to teenagers, even adults or the elderly. With this game you will learn vocabulary in a fun way like a mobile game.\n\nSoon this application will be available for Android tablet with high-resolution images. Currently only applies to mobile and tablet. You do not need wifi to play the educational application.\n\nIt supports note and tablet samsung galaxy medium resolution and high resolution tablets.\n\nWith voices to learn American English vocabulary and English of Britain\n\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:87f67c7a2700f673cb8ae00d6a6f974398d9ba83","amp;dn":"English+Vocabulary+Premium+II+v1+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87f67c7a2700f673cb8ae00d6a6f974398d9ba83","infoHashBuffer":{"type":"Buffer","data":[135,246,124,122,39,0,246,115,203,138,224,13,106,111,151,67,152,217,186,131]},"announce":[],"urlList":[]}}