{"title":"Anonymous Raub Government conspiracy ","uid":7551991,"size":33030355,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:88957e50120425153e9d4110be8f5e50dcdc6661&amp;dn=Anonymous+Raub+Government+conspiracy+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sevensixtwo","files":1,"time":1345505576,"description":"Hello Citizens of the world, We are Anonymous.  \n\n\tDear brothers and sisters. Now is the time to open your eyes and expose the truth! \n\nIt has come to our attention that the United states government has been producing a number of conspiracies in effort to destroy the foundation our founding fathers have created for the American people and to create mass civil unrest.  Your lies have been exposed and the ninety nine percent is sees your propaganda.  Anonymous sees how you are creating terrorism to put fear in the American people to influence the ninety nine percent to give up there liberty, freedoms and inalienable rights so that the one percent can control the masses with unconstitutional laws.  \n\nRecently Anonymous has discovered that the united states government may be creating a conspiracy by using former military man Brandon Raub to deceive the American people for false flag terrorism.  \n\nFormer Marine Brandon Raub Just been Taken by Feds for Facebook Posts.  In this operation to arrest Brandon he was not read his miranda rights and was not charged with any crime other then resisting arrest.  however Brandon has not resisted arrest as the ninety nine percent sees in the cell phone videos.   \n\nAnonymous has uncovered what seems to be a conspiracy to create dual fake  profile and both are very suspicious of government involvement.  The profiles are available for download for the the ninety nine percent.  Anonymous is watching and will expose truth.  \n\nThomas Jefferson once wrote: \n\n&quot;when the people fear their government there  is tyranny; when the government fears the people, there is liberty.&quot;\n\nThe ninety nine percent will not be the whores of the one percent.  We will not fear government.  We the people are the sovereign and our government will obey and submit to the will of the people.  \n  \nWe are anonymous. \n\nWe are Legion. \n\nWe do not forgive.\n\nWe do not forget.\n\nExpect us.\n","torrent":{"xt":"urn:btih:88957e50120425153e9d4110be8f5e50dcdc6661","amp;dn":"Anonymous+Raub+Government+conspiracy+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88957e50120425153e9d4110be8f5e50dcdc6661","infoHashBuffer":{"type":"Buffer","data":[136,149,126,80,18,4,37,21,62,157,65,16,190,143,94,80,220,220,102,97]},"announce":[],"urlList":[]}}