{"title":"Class War Comix (Underground - Restored)","uid":7612097,"size":41301225,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:89499a1900035e7d8bfff5539a67475621dd72b0&amp;dn=Class+War+Comix+%28Underground+-+Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1347095578,"description":"'Class War Comix'\n\nKitchen Sink, 1974 (1979)\n\nWritten and Illustrated by Cliff Harper (this is NOT the Skip Williamson comic)\n\nThe first chapter of a projected graphic novel by an English cartoonist and anarchist. Set in a post-&quot;revolution&quot; future, the book raises doubts about the viability of &quot;back to the land&quot; solutions to social problems.\n\n---------------------------------------------------------------------------------\n\nSometimes I just want to post things I find interesting, or that I think look good, or are just a cool read. This is all of the above. It's a real shame that it was never finished, because the story is good and the art is great (I love the way the interior of this book looks).\n\n---------------------------------------------------------------------------------\n\nPart of the 'Restoration' process is done to make it possible to enlarge these images. As such, after you have opened the files in a comic book reader you should actually shrink them down a bit to improve the image quality.\n\n-------------------------------------------------------\n\nAfter it was pointed out to me that people were getting a GonVisor popup, I am now creating these books in such a way as to have stopped that from happening. No GonVisor popup will appear on any 'Restorations' in the future.\n\n------------------------------------------------------\n\nI have almost 1500 Underground comic books in a digital format. I will be restoring and uploading many of my favorites over the coming months. Any requests, just say the word.\n\nSo what does 'Restored' mean? Well, with respect to all the work the scanners have done in order to make these books available, the pages were not yellow when first printed. Newsprint? Yes, often they were. Cheap paper? Yeah, that too. But not yellow.\n\nIn most cases, the changes make the books look better than they did when they were originally printed. By turning the newsprint or cheap paper they were printed on to a bright white, with crisp, clear greys and solid blacks on top, they look very much like a new b&amp;w comic you would buy right off the shelf today.\n\nThis is accomplished by running the b&amp;w pages through the PhotoScape Batch Editor. The Filters applied to the pages are; Grayscale (changes the image to greyscale); a 'Middle' of 'High' setting on Auto Level (greatly improves the blacks); a 'Low' or +1 Sharpen (barely noticeable, even if you watch the changes take place); 'Deepen' is used if there is bleed through from the image on the back of the page or to improve the overall look or color or b&amp;w pages. Occasionally 'Brighten' or 'Darken' are used if needed. Color covers, back or interior pages are 'Restored' on a page by page basis.\t\t","torrent":{"xt":"urn:btih:89499a1900035e7d8bfff5539a67475621dd72b0","amp;dn":"Class+War+Comix+%28Underground+-+Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89499a1900035e7d8bfff5539a67475621dd72b0","infoHashBuffer":{"type":"Buffer","data":[137,73,154,25,0,3,94,125,139,255,245,83,154,103,71,86,33,221,114,176]},"announce":[],"urlList":[]}}