{"title":"Room Arranger 7.0.5.289 Multilingual + Portable.rar","uid":7591039,"size":10010964,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8a62ad1344ff1a5876dce2aa9e623aecb155ac3f&amp;dn=Room+Arranger+7.0.5.289+Multilingual+%2B+Portable.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cowboy1966","files":-1,"time":1346541937,"description":"Room Arranger 7.0.5.289 Multilingual + Portable | 8.5/9.5 Mb\n\n Room Arranger is 3D room / apartment / floor planner with simple user interface. Once you get the basics, you can draw whatever you imagine. While having wide library of objects, you can easily create your own piece of furniture.\n \nFeatures\n \nEasy to Use\n Room Arranger is small and compact piece of software. Still it lets you design nearly anything you imagine. Once you understand the basics it's easy to bring it to next level.\n \nNearly all functions have keyboard shortcuts, so you can learn to be pretty fast in Room Arranger.\n \n3D Visualization\n 3D can give you a better impression of your design. Room Arranger will not only let you fly around the scene, but you can also walk through it like in reality.\n \nWide Object Library\n There are nearly 300 objects in the standard object library. Furniture, and other equipment. For each of them, you can modify their dimensions exactly as you need - you are not limited to what we think is the most common.\n \nAdditionally you can quickly and easily design all your special objects directly in Room Arranger, there is a set of 3D objects just for such needs. Some users contributed to our On-line object library and shared their work.\n \nMeasurement\n There is a measurement tool in Room Arranger that helps you to check if there is enough space left for other objects, or just visualize the dimensions in the project.\n \nThe software also measures the room areas, wall areas and other useful values. It will let you copy - paste them to Excel for further processing.\n \nPrint in Scale\n Printing is the integral part of designer's work. We try to make this output precisely and in high quality. Professional architects usually require printouts in exact 1:50 or 1:100 scale, which is possible in Room Arranger.\n \nIn case you have only small A4 printer, the software manages to print the project over more pages. You will just glue all sheets of paper together.\n \nBuild on Floor Plan Image\n Drawing walls can be quite time consuming for apartment or house design. So there is a way to make it easier in case you have an image or photo of the floor plan.\n \nJust load the image of the floor plan into the Wall Editor, calibrate it, and draw walls on top of it.\n \nHome Page - http://www.roomarranger.com/\n \n","torrent":{"xt":"urn:btih:8a62ad1344ff1a5876dce2aa9e623aecb155ac3f","amp;dn":"Room+Arranger+7.0.5.289+Multilingual+%2B+Portable.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a62ad1344ff1a5876dce2aa9e623aecb155ac3f","infoHashBuffer":{"type":"Buffer","data":[138,98,173,19,68,255,26,88,118,220,226,170,158,98,58,236,177,85,172,63]},"announce":[],"urlList":[]}}