{"title":"Simple_Money_Manager_1.9.3.2.rar","uid":7529002,"size":3788842,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8b145be48b97a84cefb330d614e4f2573b405c64&amp;dn=Simple_Money_Manager_1.9.3.2.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cowboy1966","files":-1,"time":1344877782,"description":"Simple Money Manager 1.9.3.2 | 3.6 Mb\n\nEvery pay period, you wonder how you managed to spend so much of your money, no matter how diligently you tried to keep track of your expenses. But the human brain can only process so much, and with all of the other stuff going on, it's frighteningly easy to blow your budget with just a few ill-timed purchases. The best way to keep track of your money is by leveraging the power of software, and today's discount software promotion fits your needs perfectly. It's Simple Money Manager!\n \nSimple Money Manager gives you a broad overview of your money situation, showing income, expenses, and running totals in an intuitive interface. With Simple Money Manager, you'll always know where you stand financially, thanks to an innovative &quot;financial temperature&quot; feature that matches color coding to your available funds. When combined with compelling pie and history charts showing your expenses by category, you'll find that Simple Money Manager is everything you need to take control of your finances.\n \nAs the amount of data in Simple Money Manager increases, you'll appreciate the ability to search through transactions quickly using text or numbers. Even better, your Simple Money Manager file is always safely backed up, automatically, so you'll never risk losing critical financial history.\n\nplease seed and share","torrent":{"xt":"urn:btih:8b145be48b97a84cefb330d614e4f2573b405c64","amp;dn":"Simple_Money_Manager_1.9.3.2.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b145be48b97a84cefb330d614e4f2573b405c64","infoHashBuffer":{"type":"Buffer","data":[139,20,91,228,139,151,168,76,239,179,48,214,20,228,242,87,59,64,92,100]},"announce":[],"urlList":[]}}