{"title":"HISTORY OF POP AND ROCK MUSIC - part 397","uid":7506118,"size":604243780,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8bba0fdb1c19f81fae9afa7883cc64a0b7f84e14&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+397&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pupovaczlatko","files":-1,"time":1344179792,"description":"  In 2004, US magazine Rolling Stone placed the song &quot;Like a Rolling Stone&quot; at number one on its list of &quot;The 500 Greatest Songs of All Time&quot;.\n            In 2011, Rolling Stone again placed &quot;Like a Rolling Stone&quot; at the top of their list of &quot;500 Greatest Songs Of All Time&quot;. \n            In 2006, Pitchfork Media placed it at number 4 on their list of &quot;The 200 Greatest Songs of the 1960s&quot;.\n\n\n\n\n\n                          PART  397\n\n\n            BOB DYLAN  -  Like a Rolling Stone  (1965)     \n            JIMI HENDRIX  -  Like A  Rolling Stones (1967) - Monterey,California\n\n\n\n\n         &quot;Like a Rolling Stone&quot; is a 1965 song by  Bob Dylan. Its confrontational lyrics originate in an extended piece of verse Dylan wrote in June 1965, when he returned from a grueling tour of England, exhausted. After the lyrics were heavily edited, &quot;Like a Rolling Stone&quot; was recorded a few weeks later as part of the sessions for the forthcoming album Highway 61 Revisited. During a difficult two-day preproduction, Dylan struggled to find the essence of the song, which was demoed without success in 3/4 time. A breakthrough was made when it was tried in a rock music format, and rookie session musician Al Kooper improvised the organ riff for which the track is known. However, Columbia Records was unhappy with both the song's length at over six minutes and its heavy electric sound, and was hesitant to release it. It was only when a month later a copy was leaked to a new popular music club and heard by influential DJs that the song was put out as a single. Although radio stations were reluctant to play such a long track, &quot;Like a Rolling Stone&quot; reached number two in the US charts and became a worldwide hit. The song has been covered by numerous artists, varying from The Jimi Hendrix Experience, The Rolling Stones, The Wailers to Green Day.\n","torrent":{"xt":"urn:btih:8bba0fdb1c19f81fae9afa7883cc64a0b7f84e14","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+397","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bba0fdb1c19f81fae9afa7883cc64a0b7f84e14","infoHashBuffer":{"type":"Buffer","data":[139,186,15,219,28,25,248,31,174,154,250,120,131,204,100,160,183,248,78,20]},"announce":[],"urlList":[]}}