{"title":"Myst IV Revelation Jtag/RGH","uid":7468818,"size":3725883167,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:8ccb54c255a762ec5a8d15d2598a33e81e7645f5&amp;dn=Myst+IV+Revelation+Jtag%2FRGH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ravendrow","files":4,"time":1343084010,"description":"Myst IV: Revelation is the fourth installment in the Myst computer game series, developed and published by Ubisoft. Revelation was the first game in the series released exclusively on a DVD-ROM format; a multiple CD-ROM version was not produced as it would have taken twelve compact discs to fit all the data.[1] Like Myst III: Exile, Revelation combines pre-rendered graphics with digital video, but also features real-time 3D effects for added realism.\nThe plot of Revelation ties up loose ends from the original Myst. The player is summoned by Atrus, a man who creates links to other worlds known as Ages by writing special linking books. Almost twenty years earlier, Atrus' two sons nearly destroyed all of his linking books and were imprisoned; Atrus now wishes to see if his sons' imprisonment has reformed them. The player ends up traveling to each brother's prison, in an effort to recover Atrus' daughter Yeesha from the brothers' plot.\nDevelopment of Revelation lasted more than three years; Ubisoft had as many as eighty employees working on the game. Musician Peter Gabriel lent his voice and a song to the game's audio; the original score was written by Exile's composer Jack Wall. Overall, reception to the game was positive; reviewers lauded the impressive visuals, sound, and puzzles. Publications such as Computer Gaming World took issue with the control scheme of the game. Revelation is the last game in the Myst series to use both prerendered backgrounds and full-motion video; the final game in the series, End of Ages, is rendered in real-time throughout.\n\nso as promised here is another hard to find XBOX1 Title\n\nto extract please use 7zip as winrar will say it is corrupt\n\nto play on your jtag/RGH 360 just burn the ISO to a DVD and play\n\nto install use FSD's copy DVD function\n\n*note* this could most likely be patched to work on LT firmware as i am pretty sure it is on the backward-compatibility list\n\nPLEASE SEED AS LONG AS POSSIBLE!!!\n\nnext on the list will be the last game in this series Myst V","torrent":{"xt":"urn:btih:8ccb54c255a762ec5a8d15d2598a33e81e7645f5","amp;dn":"Myst+IV+Revelation+Jtag%2FRGH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ccb54c255a762ec5a8d15d2598a33e81e7645f5","infoHashBuffer":{"type":"Buffer","data":[140,203,84,194,85,167,98,236,90,141,21,210,89,138,51,232,30,118,69,245]},"announce":[],"urlList":[]}}