{"title":"The Ed Show 8-13-12.mp4","uid":7531172,"size":195528658,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8d45cfe4b806d311c26c8e277be495f32f5f5bef&amp;dn=The+Ed+Show+8-13-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1344929614,"description":"The Ed Show; August 13, 2012.\n\n85 days to the election and Paul Ryan backlash began with hecklers in Iowa.\n\nAnd Vice President Joe Biden was on the attack. &quot;What's gutsy about giving millionaires another tax break?&quot; Biden said of Ryan's budget plan today in North Carolina. &quot;What's gutsy about gutting Medicare, Medicaid, education?&quot;\n\nThe extended coverage of the Ryan pick began with John Nichols (Washington Correspondent of The Nation), who told Ed exactly who Paul Ryan is.\n\nThen, Ed looked at President Obama's counter punch on the trail today as both he and Ryan campaigned in Iowa. Joan Walsh (Salon's Editor at Large), and E.J. Dionne (Senior Fellow at The Brookings Institution and Washington Post columnist), joined Ed for that.\n\nRomney's vice presidential pick won't help him with female voters. Ed took a look at Ryan's record on women's issues with Terry O'Neill, President of The National Organization for Women.\n\nWith Ryan on the ticket, the GOP also has a new leader in the war on the middle class. Larry Cohen (President of the Communications Workers of America) and James Hoffa (President of the International Brotherhood of Teamsters), have reacted to the Ryan pick.\n\nIn passing over Tim Pawlenty as his running mate, Romney humiliated the former Minnesota governor. Ed revealed who broke the bad news to T-Paw (as nobody calls him).\n\nAnd in the Big Finish, Ed debunked the Republican's $700 billion lie about Medicare funding. Who's really a danger to the program? Ed will ask Sen. Bernie Sanders (I-VT). ","torrent":{"xt":"urn:btih:8d45cfe4b806d311c26c8e277be495f32f5f5bef","amp;dn":"The+Ed+Show+8-13-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d45cfe4b806d311c26c8e277be495f32f5f5bef","infoHashBuffer":{"type":"Buffer","data":[141,69,207,228,184,6,211,17,194,108,142,39,123,228,149,243,47,95,91,239]},"announce":[],"urlList":[]}}