{"title":"Magicians - Bavli and Goldenberg - Between 2 Minds vol.1 - DVDRi","uid":7541911,"size":733569423,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8e24df1713589f458a601ded5856b775e0b310f3&amp;dn=Magicians+-+Bavli+and+Goldenberg+-+Between+2+Minds+vol.1+-+DVDRi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MagicManPC","files":4,"time":1345237868,"description":"Guy Bavli &amp; Haim Goldenberg - Between 2 Minds vol.1 - DVDRip Xvid\n &lt;a href=&quot;\nhttp://www.tannens.com/shop//cart.php?m=product_detail&amp;p=58&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tannens.com/shop//cart.php?m=product_detail&amp;p=58&lt;/a&gt;\n\nBetween 2 Minds 3-DVD Set\nby Guy Bavli and Haim Goldenberg\n\n15 effects that you can perform with ease to create sheer amazement. Actually, you can create more then a whole show, with the top-secret effects presented in the new sensational BETWEEN 2 MINDS (3 DVD set).\n\nEffects\n\nVideo rental\nYou ask a spectator to name a movie. You ask him to call your DVD rental store and ask which movie you reserved. It will be the movie they chose. No force ? No hints - No gimmicks.\n\nInforma-tech\nAn impromptu tool that enables you, the performer, to secretly transfer information and codes between two people (numbers, letters etc)\n\nExpert deck ? impromptu version.\nThe performer knows the location of a freely chosen card, after the spectator has shuffled the deck.\n\nStop Smoking\nThe performer causes a smoker from the audience to be repulsed from smoking on stage.\n\nEnvelope Prediction\nPerformer holds a prediction. He asks a few people in the audience to name numbers. Those numbers are added. The prediction is then opened, to reveal that the total number has been predicted. (No &quot;add a number&quot; gimmicks, no forces, free choice of numbers)\n\nMy Precious\nFour rings are mixed in a small bags. You then know which ring belongs to which person?and mentally describe in detailed the last ring!\n\nColor Detector\nSpectator is asked to freely draw 3 shapes in 3 different colors. You then predict it.\n\nMoney-Pulation\nSpectator hides a money bill in one of 10 envelopes. You then mentally know which envelope is the one with the money. Great gambling effect.\n\nSwitcher\nA switching tool that will help you create dozens of ideas and routines.\n\nSerial Contact\nThe performer predicts a serial number of a borrowed bill from the audience. No switching, the bill is random.\n\nTransparent Thoughts\nThe performer predicts a full description of a spectator, freely chosen by the audience. This secret will give you dozens of ideas and effects you can perform.\n\nIndex Picture Duplication\nA very clever way to duplicate a picture secretly drawn by a spectator. Perfect for close up!\n\nAnimated Magnet\nTelekinesis routine. You draw a magnet on your business card or a piece of paper. You then magnetize objects using your animated magnet.\n\nCoinci-Cube\nTwo Rubik Cubes are mixed by you and a spectator. You then show that both have been mixed in the exact same way. Perfect for Memory test, you become a genius in the audience?s eyes.\n\nGraphology\nSpectator writes few names on a piece of paper. You then can define which person he loves, hates, has no relationship with? and also reveal the last name! Perfect for cold reading, graphology test, or mind reading.\n\nVol.1 Running Time Approximately 80min\n\n----------------------------------------------\nYou can download the full DVDs and the rest \nof the series on Usenet at alt.binaries.magic \n(see the included pdf in this download).\n----------------------------------------------\n\nEnjoy","torrent":{"xt":"urn:btih:8e24df1713589f458a601ded5856b775e0b310f3","amp;dn":"Magicians+-+Bavli+and+Goldenberg+-+Between+2+Minds+vol.1+-+DVDRi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e24df1713589f458a601ded5856b775e0b310f3","infoHashBuffer":{"type":"Buffer","data":[142,36,223,23,19,88,159,69,138,96,29,237,88,86,183,117,224,179,16,243]},"announce":[],"urlList":[]}}