{"title":"SAVAGES xvid cam - GLOBE","uid":7454366,"size":1487778817,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f08b0a09655da0d30cf431beebe773655b4791c&amp;dn=SAVAGES+xvid+cam+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1342623786,"description":"* XVID CAM  * 02H00M59S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n\n* Premise :\n\nBest friends Chon (Taylor Kitsch) and Ben (Aaron Johnson) are marijuana growers living in California. Chon, a former soldier, smuggled the seeds for the plants out of Afghanistan. These seeds yielded a particularly potent strain of marijuana. The two share O (Blake Lively) as a girlfriend.\n\nWhile Ben is away, Chon and O receive a video from cartel enforcer Lado (Benicio del Toro), a man they do not know. The video shows several severed heads and a chainsaw, leading them to worry about Ben, who they fear is one of the victims.\n\nHowever, Ben returns home safely the next day, and Chon and Ben go to meet with the Mexican cartel. After refusing the cartel's offer for a partnership, Chon and Ben make plans with O to leave California for a year, not telling her that they are fleeing the cartel.\n\nChon and Ben speak to corrupt DEA agent Dennis (John Travolta) who urges them to partner with the cartel. O, meanwhile, is kidnapped by Lado and several members of the cartel. Chon and Ben are notified of O's kidnapping via a Skype from cartel leader Elena (Salma Hayek), who threatens to harm O before again urging the two to partner with the cartel.\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n*  GLOBE FILES 2012 ","torrent":{"xt":"urn:btih:8f08b0a09655da0d30cf431beebe773655b4791c","amp;dn":"SAVAGES+xvid+cam+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f08b0a09655da0d30cf431beebe773655b4791c","infoHashBuffer":{"type":"Buffer","data":[143,8,176,160,150,85,218,13,48,207,67,27,238,190,119,54,85,180,121,28]},"announce":[],"urlList":[]}}