{"title":"The Universal Network v1.5 DEMO","uid":7102647,"size":350994478,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8fe330aa224a7e956a62225ac0b1dd74fb984577&amp;dn=The+Universal+Network+v1.5+DEMO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dizzyinc","files":2,"time":1331747573,"description":" [IMG]http://i1186.photobucket.com/albums/z362/newphotobucketmanman/craigslistbanner.jpg[/IMG]\n\n\nPRESENTS\n\n[IMG]http://i1186.photobucket.com/albums/z362/newphotobucketmanman/UniversalNetworkBanner-1.png[/IMG]\n\nThe Universal Network v1.5 DEMO\n\nWebsite:\n\nShort promo video: \n\nCredit Roll for end of Demo:\n\nBreakdown Video: \n\nThird Eye expansion video:\n\nThe Message\n\nVideo games have been around for quiet some time, they have thrived since the day they were released and continue to do so long after the companies that made them disappear. The dilemma we find in the gaming community recently is that most games are made on one specific playing style, mostly shooting/killing/violent games that (yes it's true) effect our youth on many levels.\n\nWhen video games were first presented to the world they were not created for violent games, they were created for entertainment away from the real world. With the news, movies, TV, etc. spreading the word of violence and mass hysteria every day it seems harder and harder to bring the video game industry back to it's original cause.\n\nDizzy Media Inc. is one of the companies that wish to do so, that is why we have decided to create our own games and spread them to the world.\n\nDizzy Media Inc.'s games present: excitement, adventures, long quests, informational dialogue and hopefully helping the expansion of awareness that life has no limits. \n\nGame Plot: \n\n&quot;The Universal Network&quot; is a game that places you in the body of a young boy who's life at home is miserable, he decides to leave home and search far and wide for the answers to life.\n\nBefore he is able to leave his house a life form from another dimension/realm calls to him and shows him the universal network exists.\n\nThis life form transports him to another dimension and there his journey begins......\n\nAs the story unfolds he soon finds out that &quot;The Universal Network&quot; may be shutting down right when he begins to find the truth. Now he must embark on a journey to save life in every dimension/realm or else the secrets will disappear forever.\n\nTHIS IS MERELY A DEMO OF THE GAME, IT IS STILL TO BE COMPLETED, PLEASE LEAVE AMPLE FEEDBACK WITH YOUR GAMING EXPERIENCE! AND DON'T FORGET TO SEED!! THANKS!! ","torrent":{"xt":"urn:btih:8fe330aa224a7e956a62225ac0b1dd74fb984577","amp;dn":"The+Universal+Network+v1.5+DEMO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fe330aa224a7e956a62225ac0b1dd74fb984577","infoHashBuffer":{"type":"Buffer","data":[143,227,48,170,34,74,126,149,106,98,34,90,192,177,221,116,251,152,69,119]},"announce":[],"urlList":[]}}