{"title":"Orcs Must Die! 2 (DEMO) (2012) [MULTi9]","uid":7489406,"size":1092526008,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:912fd4cb75621fc058898defe2079adf50c01396&amp;dn=Orcs+Must+Die%21+2+%28DEMO%29+%282012%29+%5BMULTi9%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":-1,"time":1343686626,"description":"Orcs Must Die! 2 (DEMO) (2012) [MULTi9]\n\nYear of Manufacture: July 30, 2012\nGenre: Action / Strategy\nDeveloper: Robot Entertainment\nPublisher: Robot Entertainment\nPlatform: PC\n\nPublication Type: Demo\nLanguage: English, German, French, Italian, Spanish, Russian, Japanese, Polish, Brazilian Portuguese\nLanguage: English, German, French, Italian, Spanish, Russian, Japanese, Polish, Brazilian Portuguese\nLicense: Freeware\nSize: 1.02 GB\n\nAll information is: http://www.ag.ru/games/orcs_must_die_2\n\nDescription: You threw them in different directions, burned with fire, sliced ??... The account was in the thousands - but now need to redouble their efforts! In the second part of the &quot;Strategic games in 2011&quot; according to the AIAS from the studio Robot Entertainment you will be hacked through countless hordes of orcs for a couple with a friend! Once again plunge into the thick of battle, playing for the mighty battle mage or cunning sorceress. Protect the new fortresses and gnomes of the mine, to destroy thousands of orcs and other monsters - you have the most variety of weapons, spells, guards, traps and amulets. Come in a new campaign with a friend in cooperative play - or fight for survival in an endless mode! Open access to new and old means of defense, improve them and let it in - let the hordes of orcs grind in lush green stuffing!\n\nFeatures:\n- Cooperative game! - You have the two characters. Battle Mage throws himself fearlessly into danger, witch prefers to stay away from the enemy, holding them with magic spells and subordinating their will.\n- The plot of the campaign. - The story will continue from the place where the story ended at the end of the first part. To pass a new story campaign can be either alone or together in a mode of playing together!\n- New mode of an infinite game. - Playing alone or with a friend, check yourself for strength, reflecting one after another endless attacks formidable opponents.\n- Mode of &quot;Classics.&quot; - Members Steam, bought the original Orcs Must Die!, Will automatically have access to the 10 level for the first part of the co-op, where they will fight new enemies!\n- More than 20 dangerous enemies. - Give the new creepy creatures fight back, including the earth elementals, trolls, and bats. And along with them a visit and will visit all your old friends from the original Orcs Must Die!\n- More than 50 types of weapons, traps and guards. - You can choose anything from a huge arsenal of old and new means of defense, which includes a completely new set of magical amulets.\n- Extensive system improvements. - You can find more than 255 enhancements to the traps and weapons, so you can pick up an arsenal under his style of play.\n- Replay value. - With a variety of game modes, difficulty level, &quot;Nightmare&quot; and the system of ratings for the game you want to return again and again.\n- Scoring and a list leaders. - Compete with your friends, try to take the top spot on the list of leaders in both single and cooperative play!\n\nSystem requirements:\n- OS: Windows XP, Windows Vista, Windows 7\n- Processor: 2GHz Dual Core\n- Memory: 2 GB RAM\n- Graphics: NVIDIA GeForce 6800 or ATI Radeon x1950 or better with 256MB VRAM\n- DirectX Â®: 9.0c\n- Hard Drive: 9 GB HD space\n- Need to play Steam","torrent":{"xt":"urn:btih:912fd4cb75621fc058898defe2079adf50c01396","amp;dn":"Orcs+Must+Die%21+2+%28DEMO%29+%282012%29+%5BMULTi9%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"912fd4cb75621fc058898defe2079adf50c01396","infoHashBuffer":{"type":"Buffer","data":[145,47,212,203,117,98,31,192,88,137,141,239,226,7,154,223,80,192,19,150]},"announce":[],"urlList":[]}}