{"title":"Video Locker Pro v1.0.2 Final By bobiras2009","uid":7595730,"size":2518717,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:91f1c07330e569ba9f4d39898f926c2316378086&amp;dn=Video+Locker+Pro+v1.0.2+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346688755,"description":"                                    By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nRequirements: Android 2.2+\nOverview: Hide videos securely and conveniently in Video Locker Pro! - The ultimate app for hiding videos on Android. \n\nHide videos securely and conveniently in Video Locker Pro! - The ultimate app for hiding videos on Android.\n\nVideos from your Android gallery can be safely locked away inside Video Locker and accessible only via a secret PIN code.\n\nWhen Stealth Mode is turned on, the Video Locker app itself can be made invisible and accessible only by dialing your PIN code.\n\nWith Stealth Mode enabled, you can also access Video Locker Pro via a fully functional Calculator Widget. Key in your PIN code using the calculator widget and tap on the number display to access your Video Locker! This is useful if you wish to enable Stealth Mode for Video Locker Pro on a tablet (which has no calling capability).\n\nKey features of Video Locker Pro include:\n1)Encryption - hidden videos are not only moved to a secret location but are also encrypted using advanced 128bit AES encryption. This means that even if someone manage to steal your SD card and copy the video files, they will still be unable to view them.\n2)Removed from recent app list - Video Locker App will not appear in 'recent apps' list\n3)Lock on sleep - If you forgot to exit Video Locker, the app will lockout as soon as your device goes into sleep mode.\n4)Folder level locking - lock individual hidden albums\n5)Tablet optimized - Video Locker's UI has been designed with tablets in mind as well so as to provide the ultimate viewing pleasure on both Android smart phones and tablets\n6)User friendly operation - Easily hide videos via default gallery or from within Video Locker itself.\n7)Bulk hide - hide dozens of videos in seconds!\n8)PIN recovery - With the optional PIN recovery feature, you won't lose your precious video files even if you forgot your PIN code.\n9)Easy Un-hide - Un-hide videos just as easily as hiding them and you can decide where the un-hidden videos go.\n\n\n\n                                    By bobiras2009\t","torrent":{"xt":"urn:btih:91f1c07330e569ba9f4d39898f926c2316378086","amp;dn":"Video+Locker+Pro+v1.0.2+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91f1c07330e569ba9f4d39898f926c2316378086","infoHashBuffer":{"type":"Buffer","data":[145,241,192,115,48,229,105,186,159,77,57,137,143,146,108,35,22,55,128,134]},"announce":[],"urlList":[]}}