{"title":"PolitiFact Mobil App for Android","uid":7572479,"size":4850158,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:931927d8c4be1b494a60e9ba99ecb361f1708c7a&amp;dn=PolitiFact+Mobil+App+for+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ninja3870","files":1,"time":1346025811,"description":"Product Features\n\nGet the latest Truth-O-Meter rulings-ratings of how accurate politician's statements are\n    \nView the Truth-O-Meter report card records of politicians, political groups, and pundits\n    \nReceive updates on the campaign promises of President Obama and Republican leaders from the Obameter and GOP Pledge-O-Meter\n    \nMonitor the Truth Index--a daily index that shows the ups and downs of all Truth-O-Meter rulings\n    \nBrowse Truth-O-Meter rulings by subject and compare their tallies\n\nProduct Description\nDo you ever want to know if a politician is keeping his promises? Get the truth anytime, anywhere--whether you're checking claims by presidential candidates, or promises made by President Obama, find out who's telling the truth and who's stretching it with the PolitiFact Mobile for Android.\n\nPolitiFact Mobile makes it easier than ever to get the truth about American politics. It is produced by PolitiFact, the Pulitzer Prize-winning website, and includes the new Truth Index as well as mobile versions of the site's most popular features -- the Truth-O-Meter, the Flip-O-Meter, the Obameter, and the GOP Pledge-O-Meter. Politifact Mobile is the first and last app dedicated to fact checking.","torrent":{"xt":"urn:btih:931927d8c4be1b494a60e9ba99ecb361f1708c7a","amp;dn":"PolitiFact+Mobil+App+for+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"931927d8c4be1b494a60e9ba99ecb361f1708c7a","infoHashBuffer":{"type":"Buffer","data":[147,25,39,216,196,190,27,73,74,96,233,186,153,236,179,97,241,112,140,122]},"announce":[],"urlList":[]}}