{"title":"Native Tongue; Carl Hiaasen (Mobi, Epub)","uid":7593806,"size":862879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95934cc070a8ea4b5b9bd95fdf533298e73883d3&amp;dn=Native+Tongue%3B+Carl+Hiaasen+%28Mobi%2C+Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lynnrlou","files":1,"time":1346627021,"description":"Downloaded from another source on the internet. Just keeping it alive!!\n\nNow reissued--one of the most beloved novels by the &quot;New York Times&quot; bestselling author in which dedicated, if somewhat demented, environmentalists battle sleazy real estate developers in the Florida Keys.\n\nHiaasen's fourth Florida crime-farce--about an environmental- protection scam--is as manic as ever but lacks the crisp suspense that made Skin Tight a minor crime-classic. As usual, Hiaasen plunks a male Alice (reporter-turned-flak Joe Winder) into a tropical Wonderland (the Disney-rival theme park of the Amazing Kingdom of Thrills); but, again, he pushes slapstick black humor at the expense of thrills. It's a typically bizarre Hiaasen opening as the vacationing Whelper family panics when someone tosses a rat into their convertible--and the rat turns out to be one of only two blue-tongued mango voles left on earth, stolen, on orders of an eco-terrorist geriatric, by two bungling burglars who then mistook the voles for rats and threw them away. That's the last we see of the Whelpers--and the voles--although the geriatric and the thieves figure in the labyrinthine un-cover-up that follows as Joe deduces that the mango voles are just plain voles disguised to shake endangered-species' funds out of Uncle Sam: another venal venture by Joe's boss, Kingdom-owner and land- developer Francis X. Kingsbury, who, it transpires, is a mobster on the lam from John Gotti. In between losing his girlfriend to her new calling as a phone-sex scriptwriter and romancing a new love, Joe deduces that Orky the whale's choking to death on biologist Will Koocher was no accident but murder: Koocher knew too much about the voles. That sets Joe up as the next victim of Kingsbury and his steroid-pumped goon (who chews off his foot at the ankle when trapped beneath a car), but with some help from a Florida- governor-turned-swamp-rat (recycled from Double Whammy), Joe takes down the Kingdom and saves a wilderness in the process. Madcap and sometimes quite funny, but strained as well, with the action often so absurd as to leach realism and thus suspense. The problem may be that Hiaasen's tilled this particular crime- comic soil one time too many. \n\nKeep Seeding!!!","torrent":{"xt":"urn:btih:95934cc070a8ea4b5b9bd95fdf533298e73883d3","amp;dn":"Native+Tongue%3B+Carl+Hiaasen+%28Mobi%2C+Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95934cc070a8ea4b5b9bd95fdf533298e73883d3","infoHashBuffer":{"type":"Buffer","data":[149,147,76,192,112,168,234,75,91,155,217,95,223,83,50,152,231,56,131,211]},"announce":[],"urlList":[]}}