{"title":"No Ordinary Love &amp; Vince and Ramon","uid":7505350,"size":2628423398,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:96598e6adf658e5db12fac66c77ef8e884692032&amp;dn=No+Ordinary+Love+%26amp%3B+Vince+and+Ramon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"GWM_in_US","files":-1,"time":1344152286,"description":"NO ORDINARY LOVE\n1999\n\nPLOT:\nNo desire is forbidden in this twisted suspense-comedy about a group of 20-something, sexually ambivalent, promiscuous housemates living in the Hollywood Hills. \n\nREVIEW:\nI wasn't sure what to expect from this movie but I found it an enjoyable romp through the lives of disjointed housemates.\n\nThe movie is actually several movies rolled into one, with each story only receiving a portion of the total film. Each story suffers because of this intercutting, but at the same time you are drawn into each of the stories because of how they interrelate the characters with one another. This is very much the daytime drama (soap opera) approach, and as long as you are comfortable with the format, you should enjoy the film.\n\nAs an independent film, the acting and production values are not on par with big budget films, but there were no glaring issues that kept me from enjoying the movie (though the nebby mother's bad wig did stand out).\n\nThe best plot of the whole film was the burgeoning romance between the young college student and the gangbanger neighbor. It was touching and romantic, but also revealed the problems that some people face as they start to experiment.\n\nAll told though, this is a film that people will either really love or really hate. I for one loved it.\n\nACTORS:\nSrey Teang; Ericka Klein; Angel Ceja; Alaina P. Pepito; Randy Huiting; Susie Spear; Elizabeth Mehr; Randy Brown; Koing Kuoch; Marina Palmier; Fred Blanco; Kelly O'Brien; Mark Solum; Alejandro Patino; Alex Mercer; Jesus Covarrubias; Dan Frank; Lobo Sebastian; Mark Larson (II); Tymme Reitz\n\nDIRECTOR: Doug Witkins\n\nLANGUAGE:  English\nSUBTITLES:  French and Spanish","torrent":{"xt":"urn:btih:96598e6adf658e5db12fac66c77ef8e884692032","amp;dn":"No+Ordinary+Love+%26amp%3B+Vince+and+Ramon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96598e6adf658e5db12fac66c77ef8e884692032","infoHashBuffer":{"type":"Buffer","data":[150,89,142,106,223,101,142,93,177,47,172,102,199,126,248,232,132,105,32,50]},"announce":[],"urlList":[]}}