{"title":"Magicians - Steve Draun - Standing Room Only vol.2 DVDRip Xvid","uid":7561913,"size":733263051,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:96b2e28606296c9f1d74a4200dcaf5a18d62b3bd&amp;dn=Magicians+-+Steve+Draun+-+Standing+Room+Only+vol.2+DVDRip+Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MagicManPC","files":4,"time":1345761318,"description":"\nSteve Draun - Standing Room Only vol.2 DVDRip Xvid\n &lt;a href=&quot;\nhttp://www.penguinmagic.com/p/S8938&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.penguinmagic.com/p/S8938&lt;/a&gt;\n\nThough long acclaimed as a cardman, Steve Draun has approached dice, coins, linking rings and virtually all substrates of magic with equal passion and perseverance. It's for this great effort, and for his long-time experience, that such a high degree of bafflement permeates the magic of Steve Draun. This is also why his material is so greatly worthy of study and appreciation by anyone who seeks to better their own performance of magic.\n\nOUT OF THIS WORLD - If you could accomplish this classic effect by real magic, it might look very much like this - the clean-up is that good!\n\nFAN GLIMPSE - If you are not already familiar with this now-standard method of glimpsing a peeked card, you are in for a real treat. If you already use it, you'll find some interesting presentational ideas.\n\nFACE-UP ACES - A quick, surprising trick taught to Steve Draun by Ed Marlo. Some original ideas were added and what emerged impresses all who see it.\n\nTENKAI PENNIES - An impossible-looking technique is used to accomplish this standard, but still powerful, trick.\n\nMEMORY TRICK - A long-forgotten plot is updated and you're going to love the results!\n\nDECK VANISH - A stunning trick that features several new palming techniques. Also, a well-kept secret move for showing your pocket empty is revealed that you will use all of the time.\n\nWEB SHUFFLE - A great method for simultaneously culling and stacking using the riffle shuffle.\n\nUNEXPECTED LOCATION - The spectator is in control throughout. They shuffle, cut, remember a card, and then cut and shuffle some more. After all of that, the performer, after some amusing by-play, reveals the selection!\n\nBONUS TRICK: PORTENT ACES - One of Steve Draun's best items! An Ace-cutting trick par excellence! MASTER PASS CLASS WORKSHOP - Learn the moves that Steve Draun made his mark in the world of card magic with including his touches on the Classic Pass, the Table Pass, the Herrmann Turnover Pass, and his own remarkable Midnight Shift. You'll also learn Jack Sandwich, a strong trick that incorporates some of the powerful techniques taught in this special workshop. If you've ever wanted to learn, or improve, the Pass, you'll find this Workshop to be an invaluable resource.\n\nRunning Time Approximately 1Hr 15Min\n\n----------------------------------------------\nYou can download the full DVDs and the rest \nof the series on Usenet at alt.binaries.magic \n(see the included pdf in this download).\n----------------------------------------------\n\nEnjoy!\n","torrent":{"xt":"urn:btih:96b2e28606296c9f1d74a4200dcaf5a18d62b3bd","amp;dn":"Magicians+-+Steve+Draun+-+Standing+Room+Only+vol.2+DVDRip+Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96b2e28606296c9f1d74a4200dcaf5a18d62b3bd","infoHashBuffer":{"type":"Buffer","data":[150,178,226,134,6,41,108,159,29,116,164,32,13,202,245,161,141,98,179,189]},"announce":[],"urlList":[]}}