{"title":"Up with Chris Hayes 8-25-12.mp4","uid":7570561,"size":382956131,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:96eed48a94198c13486f14124334f69924121e4f&amp;dn=Up+with+Chris+Hayes+8-25-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1345974511,"description":"Up with Chris Hayes; Sunday, August 25, 2012.\n\nChris was joined by:  Katha Pollitt (columnist for The Nation). Esther Armah (author, playwright, and radio host of WBAI-FM's &quot;Wake Up Call&quot;). Michelle Goldberg (senior contributing writer for Newsweek/Daily Beast and author of &quot;The Means of Reproduction: Sex, Power and the Future of the World&quot;). W. Kamau Bell (comedian and host of FX's &quot;Totally Biased with W. Kamau Bell.&quot;)\n\n\nKristen Day (executive director of Democrats for Life) joined via satelitte a little later.\n\nThey examined the moral and political aspects of the controversy surrounding Missouri Republican Senatorial Candidate Rep. Todd Akin's abortion comments, and  the history of a spurious myth that has somehow persisted in many far-right circles: that women cannot become pregnant if they are &quot;legitimately&quot; raped. \n\nLater on:\n\nTa-Nehisi Coates (senior editor at The Atlantic and author of &quot;The Beautiful Struggle: A Father, Two Sons, and an Unlikely Road to Manhood&quot;) replaced Katha Pollitt. Melissa Harris-Perry (host of MSNBC's &quot;Melissa Harris-Perry&quot; and professor at Tulane University) took the spot of Michelle Goldberg. Jay Smooth (host of WBAI-FM's &quot;Underground Railroad&quot;) replaced Esther Armah.\n\nThey discussed racial politics with a blockbuster panel that included Ta-Nehisi Coates (author of the riveting new essay &quot;Fear of a Black President&quot; in The Atlantic).\n\nMichelle Goldberg came back for &quot;Now we know&quot; because MHP had a gig.\n","torrent":{"xt":"urn:btih:96eed48a94198c13486f14124334f69924121e4f","amp;dn":"Up+with+Chris+Hayes+8-25-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96eed48a94198c13486f14124334f69924121e4f","infoHashBuffer":{"type":"Buffer","data":[150,238,212,138,148,25,140,19,72,111,20,18,67,52,246,153,36,18,30,79]},"announce":[],"urlList":[]}}