{"title":"Party-x264.AAC.700 -DDR","uid":7097283,"size":744171967,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:972d4fb99b9a55360110f96e15f616e25e152f98&amp;dn=Party-x264.AAC.700+-DDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SaM","files":-1,"time":1331592768,"description":"\nDDR Presents\n\nParty (1984)\n(A film by Govind Nihalani)\n\nDVD Rip - 709MB (1-CD) - X.264\n\n\n\nTech Specifications:\n &lt;a href=&quot;\nhttp://img40.imageshack.us/img40/5284/partydata.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img40.imageshack.us/img40/5284/partydata.png&lt;/a&gt;\n\n\nSynopsis:\nDiwakar Barve (Manohar Singh) has won a literary award and Damayanti Rane (Vijaya Mehta) a rich widow and a patron of the arts throws a party in his honour. All the famous and the talented are there and the conversation flows. There is the serious discussion of literary works, catty asides, pseudo-intellectual cynicism, outrage - every nuance of human contact and emotions. And through it all, one man is at the centre of all conversation, even though he is not present. Amrit, the poet, who has decided that he must practice what he preaches and has gone out to work among the tribals. It is the invisble presence of Amrit that turns the conversation to the duality of an artist - his preception and his actions. Then the party is over and veryone goe home, and Amrit is shown in the world he has chosen to be... among the tribals and police brutality...\n\nComments:\nI have never been able todecide for myself whether I consider Party or Tamas as Govind Nihalani's greatest film. This is a deeply thought provoking film which is multidimensional. Initially we are attracted to the insights into the lives of the players, their foibles and their human weaknesses. Then as the party gets underway, we get engrossed in the discussions and the interplay of intellect and then it is Amrit and Amrit alone who takes over, even if he inn't there... A brilliant brilliant film that will hold you engrossed even though there is no action and no fast moving sequences.\n\nNihalani's camera flits about among the party guests, so much so that you start feeling that ou are there in the party itself. His concept is brought to life by some brilliant, out-of-this world acting. Watch Rohini Hattangadi as Mohini Barve (Best Supporting Actress -984 National Awards) or Vijaya Mehta as Damayanti Rane (Best Actress, Asia Pacific Film Fest) and you will know what I mean. And remember, this is a galaxy of the greatest actors in India. Each one is a household name. Superb editing by the late Renu Saluja keeps your interest flowing.\n\nI really cannot end this eulogy without a mention of the superb restoration work of pixion and put in a word of thanks to NFDC for releasing this gem.\n\nUploader's Notes:\nI thought tht there must be a dozen copies of this film floating around. To my surprise a search on DT did not show an earlier upload. Even on the internet, I could only find somevery poor specimens. So if you are a lover of good serious films, here is a rip that gives you the film in its full glory...\n\nI have enjoyed ripping this film. I hope you enjoy watching it as much as I did...\n\nIMDB Link:\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0248289/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0248289/&lt;/a&gt;\n\nScreens ~\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/f86ed6179447877&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/f86ed6179447877&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/70b678179447911&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/70b678179447911&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/c3f251179447963&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/c3f251179447963&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:972d4fb99b9a55360110f96e15f616e25e152f98","amp;dn":"Party-x264.AAC.700+-DDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"972d4fb99b9a55360110f96e15f616e25e152f98","infoHashBuffer":{"type":"Buffer","data":[151,45,79,185,155,154,85,54,1,16,249,110,21,246,22,226,94,21,47,152]},"announce":[],"urlList":[]}}