{"title":"Alex Jones Show - 2012 July 15 SU [sebaygo1]","uid":7447637,"size":42704587,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9800d230e0177f902b4ad9c512b9c3cfe86e6578&amp;dn=Alex+Jones+Show+-+2012+July+15+SU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":8,"time":1342416288,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nSunday, 15 July 2012\n\n\n[sebaygo1]\n\n\nThe 2 hour Sunday show is typically a review of the past week's news and a look forward to the coming week's events. The Infowars web site describes today's broadcast as follows.\n\nToday on this LIVE Sunday edition, Alex Jones takes aim at the United Nations Arms Trade Treaty, part of a larger effort to sabotage the 2nd Amendment with international firearms regulations. Alex plays a special report uncovering the UN's history of gun control, and how Fast &amp; Furious was staged to pass the UN Gun Treaty-- by blaming the flow of illicit guns south to Mexico. Meanwhile, American troops have been trained and acclimated to occupying the U.S. and seizing guns-- Hurricane Katrina remains a startling reminder that confiscation really can happen here. And as history shows, gun control has really paved the way for democide (death by governments) which has killed hundreds of millions. In other news, Alex has caught the Pentagon again in using sock puppets to deny photographic proof of military spray operations reported in the media. While CBS Miami had already covered the spraying of pesticides to kill mosquitoes over major cities in Florida, cyber-trolls working as part of a psyop do everything they can to counter discussion of the report. Alex also discusses the shutdown of taxpayer funded roads in Austin and other nearby public facilities that has been planned for the upcoming Formula One race in November.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n","torrent":{"xt":"urn:btih:9800d230e0177f902b4ad9c512b9c3cfe86e6578","amp;dn":"Alex+Jones+Show+-+2012+July+15+SU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9800d230e0177f902b4ad9c512b9c3cfe86e6578","infoHashBuffer":{"type":"Buffer","data":[152,0,210,48,224,23,127,144,43,74,217,197,18,185,195,207,232,110,101,120]},"announce":[],"urlList":[]}}