{"title":"Cory in the House All Star Edition - Full 5 Episodes","uid":7510358,"size":1779824680,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:989b8811dcc81a96ed74b16597267bf25fe46a4b&amp;dn=Cory+in+the+House+All+Star+Edition+-+Full+5+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sheikmast","files":4,"time":1344298886,"description":"Real Cory in The House DVD rip!!!! High Quality 480p MP4 Encode that all true Kyle Massey fans will enjoy. \n\nFrom Disney Channel's hit comedy THAT'S SO RAVEN comes its hilarious spin-off series CORY IN THE HOUSE -- on DVD for the first time ever! Laugh out loud at Cory's madcap adventures in four of your favorite episodes -- plus, the ALL-STAR EDITION DVD includes exclusive behind-the-scenes interviews with the star and celebrity guests Raven and The Rock (&quot;Never The Dwayne Shall Meet&quot;)! When Cory's dad gets a job as personal chef to the president of the United States, the Baxter boys move into the White House and take over. It doesn't take long before Cory is cooking up new schemes that get him into outrageously funny situations with the high-powered Washington, D.C., elite. Just when you think things can't get any more mixed up, Cory is sneaking on to Air Force One, making presentations incognito and doing everything he can to impress celebrity houseguests Raven, Dwayne &quot;The Rock&quot; Johnson and more! Get ready to laugh, it's Cory time!\n\nRipped from Sheikmaster the real bill fan.","torrent":{"xt":"urn:btih:989b8811dcc81a96ed74b16597267bf25fe46a4b","amp;dn":"Cory+in+the+House+All+Star+Edition+-+Full+5+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"989b8811dcc81a96ed74b16597267bf25fe46a4b","infoHashBuffer":{"type":"Buffer","data":[152,155,136,17,220,200,26,150,237,116,177,101,151,38,123,242,95,228,106,75]},"announce":[],"urlList":[]}}