{"title":"Mirillis Action! 1.9.1 + key by Senzati.rar","uid":7555193,"size":23453590,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:98a82f2b1eb26a2ffe0af588f3220641bfab8516&amp;dn=Mirillis+Action%21+1.9.1+%2B+key+by+Senzati.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BySenzati","files":1,"time":1345591124,"description":"Action! - Record everything! \n Action! allows real-time recording/capture of Windows Aero desktop in a superb HD video quality. With Action! you can record web player videos, your gameplay, display game framerates, add live audio commentary to create high quality tutorials, record music, capture screenshots... and more!\n\nRecord your gameplay in HD. Benchmark games performance.\n Action! outstanding performance and GPU utilization allows the smoothest real-time HD gameplay video recording ever! Display current and average game framerate (FPS) during gameplay and save your benchmark results.\n\nCapture screenshots \n With Action! you can capture multiple screenshots of your games or desktop. Just press a hotkey and screenshot will be saved directly to a file on your hard disk without interrupting your work or gameplay.\n\nRecord live audio commentary \n Action! allows to record additional live audio commentary during gameplay or dekstop recording making easy creation of tutorials and game walk-through videos. Microphone settings provide full control of microphone input volume and mixing level with system sounds.\n\nUpload to YouTubeâ„¢ or Facebook \n Export and upload your recordings to popular services and social networks like YouTubeâ„¢ and Facebook. Action! provides predefined exporting profiles for YouTubeâ„¢ and Facebook, just push a button to export and automatically upload your recordings\n to your favorite service fast and easy.\n\nReal-time web videos recording. Record what you see.\n Record videos from websites and other applications in real-time. Action! allows to record videos from defined display region, selected application window or in fullscreen mode. With Action! you can record videos from ANY web player, no matter which video service you are using!\n\nSmooth Windows Aero HD desktop recording, easy tutorial creation!\n Action! defines a new standard of performance \nand user experience for real-time desktop \nrecording software. Record smooth high framerate\n HD videos of your dekstop and applications activity,\n add microphone audio commentary and create great tutorials with ease!\n\nOPERATING SYSTEM\n Windows VistaÂ®, Windows 7 Windows 8\n (with Windows Aero enabled for dekstop recording)\nGRAPHICS CARD\n Direct3D 9.0 compatible with Pixel Shader 2.0 support\n ","torrent":{"xt":"urn:btih:98a82f2b1eb26a2ffe0af588f3220641bfab8516","amp;dn":"Mirillis+Action%21+1.9.1+%2B+key+by+Senzati.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98a82f2b1eb26a2ffe0af588f3220641bfab8516","infoHashBuffer":{"type":"Buffer","data":[152,168,47,43,30,178,106,47,254,10,245,136,243,34,6,65,191,171,133,22]},"announce":[],"urlList":[]}}