{"title":"POtHS 4 - Conspiracy Facts - Part 40 - Century of the Self","uid":7469375,"size":4377395842,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:98b94074537f82537c82ac045bf99158cd90bc61&amp;dn=POtHS+4+-+Conspiracy+Facts+-+Part+40+-+Century+of+the+Self&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":63,"time":1343101105,"description":"POtHS 4 - Conspiracy Facts - Part 40 - Century of the Self\n\nPOtHS Comments on This one: They are coming!!!\n\nDescription:\n\nTo many in both business and government, the triumph of the self is the ultimate expression of democracy, where power is truly moved into the hands of the people. Certainly the people may feel they are in charge, but are they really? The Century of the Self by Adam Curtis tells the untold and controversial story of the growth of the mass-consumer society. How is the all-consuming self created, by whom, and in whose interest?\n\nThe Freud dynasty is at the heart of this compelling social history. Sigmund Freud, founder of psychoanalysis; Edward Bernays, who invented public relations; Anna Freud, Sigmund's devoted daughter; and present-day PR guru and Sigmund's great grandson, Matthew Freud. Sigmund Freud's work into the bubbling and murky world of the subconscious changed the world. \n\nPart 1-Happiness Machines:\nPart one documents the story of the relationship between Sigmund Freud and his American nephew, Edward Bernays who invented 'Public Relations' in the 1920s, being the first person to take Freud's ideas to manipulate the masses. He showed American corporations how they could make people want things they didn't need by systematically linking mass-produced goods to their unconscious desires.\n\nPart 2-The Engineering of Consent:\nPart two explores how those in power in post-war America used Freud's ideas about the unconscious mind to try and control the masses.\n\nPart 3-There is a Policeman Inside All Our Heads, He Must Be Destroyed:\nIn the 1960s, a radical group of psychotherapists challenged the influence of Freudian ideas, which lead to the creation of a new political movement that sought to create 'new people', free of the psychological conformity that had been implanted in people's minds by business and politics. This episode shows how this idea rapidly developed in America through &quot;self-help movements&quot;, into the irresistible rise of the expressive self: the Me Generation.\n\nPart 4-Eight People Sipping Wine in Kettering:\nThis episode explains how politicians turned to the same techniques used by business in order to read and manipulate the inner desires of the masses.\n\nAlso included is:\nMike Hoggard - A Clear &amp; Present Danger\n\n","torrent":{"xt":"urn:btih:98b94074537f82537c82ac045bf99158cd90bc61","amp;dn":"POtHS+4+-+Conspiracy+Facts+-+Part+40+-+Century+of+the+Self","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98b94074537f82537c82ac045bf99158cd90bc61","infoHashBuffer":{"type":"Buffer","data":[152,185,64,116,83,127,130,83,124,130,172,4,91,249,145,88,205,144,188,97]},"announce":[],"urlList":[]}}