{"title":"Dr Suess The Lorax 1080p.mp4","uid":7469252,"size":1990322666,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:9a0848432d609259932e32661e0ea163b0ba089e&amp;dn=Dr+Suess+The+Lorax+1080p.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxDeepThinkerxx","files":-1,"time":1343098706,"description":"DR.SEUSS The Lorax(2012) 720-1080p \n\nThe Lorax (2012)\nAlternatieve titels:Dr. Seuss The Lorax \n\nLength:86 minutes\n\nA young boy residing in a polluted, grim world visits a strange creature called the Once-ler who lives in such seclusion that he never appears in full and only his limbs are shown. He pays the Once-ler fifteen cents, a nail, and the shell of a great-great-great grandfather snail to explain why the world is in such a run-down state. The Once-ler explains to the boy that he arrived in a beautiful, cheerful world containing happy, playful fauna that spent their days romping around blissfully among &quot;Truffula trees.&quot; The Once-ler begins to cut down the truffula trees, thinking they will help him craft &quot;Thneeds,&quot; his invention that he thinks everyone will need.\n \nThe Lorax, a small orange creature, appears from the stump of a truffula tree. He &quot;speaks for the trees, for the trees have no tongues&quot; and warns the Once-ler of the consequences of cutting down the truffula trees, but the Once-ler ignores him. Soon the once beautiful land becomes polluted and the fauna flee to find more hospitable habitats. Eventually the final Truffula tree is cut down, and without Truffulas the Once-ler cannot make any more Thneeds. This leads to the closure of Once-ler's factory and the disappearance of the Lorax. The Once-ler lingers on in his crumbling residence, living in seclusion and remorse, while pondering over a message the Lorax left behind: a stone slab etched with the word &quot;Unless&quot;. The Once-ler now realizes that the Lorax means that &quot;unless&quot; someone cares, the situation will not improve. The book then returns to the present, ending on an ambiguous yet optimistic note where the Once-ler gives the boy the last Truffula seed and encourages him to plant it so that Truffula trees can return as well as the fauna, and so would the Lorax\n\n\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1482459/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1482459/&lt;/a&gt;  &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/75497/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/75497/&lt;/a&gt;\n\n\n\n\nSource: The.Lorax.2012.1080p\nFormat: .mp4\nAudio: English(DD5.1)\nMenu: No\nDVD Cover: ","torrent":{"xt":"urn:btih:9a0848432d609259932e32661e0ea163b0ba089e","amp;dn":"Dr+Suess+The+Lorax+1080p.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a0848432d609259932e32661e0ea163b0ba089e","infoHashBuffer":{"type":"Buffer","data":[154,8,72,67,45,96,146,89,147,46,50,102,30,14,161,99,176,186,8,158]},"announce":[],"urlList":[]}}