{"title":"Dungeon Defenders 7.37","uid":7434247,"size":4574524198,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9abaa7bdfb68078f3b5fc153c3aac70df342cd18&amp;dn=Dungeon+Defenders+7.37&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Grafas119","files":1,"time":1342026969,"description":"There were originally four character classes available in-game; the Apprentice, Squire, Huntress, and Monk. Four new classes were introduced for the PC version on November 23, 2011 which were essentially &quot;gender-swapped&quot; versions of the original classes with the same towers but new abilities. These characters included the Adept, Countess, Ranger, and Initiate respectively.[12] Additional classes such as the Barbarian (with an Amazon female counterpart), the Series EV (with a Bounty Hunter male counterpart), and Summoner (with a Demoness female counterpart) were added to the game at a later date via DLC. It should be noted that all additional classes beyond the original four are exclusive to the PC version of the game and there are no plans to port this DLC to the console version of the game.[13] All classes possess unique &quot;towers&quot;, defenses that can be constructed on the map to stop advancing mobs, as well as utilize different skills and weapon types. The style of gameplay encourages multi-player and cooperation utilizing all the classes unique defenses. However, it is possible to play solo and switch between the different classes during a level in-between combat phases.\n\nThe characters are divided into skill levels, representing how a character handles as opposed to balance (which is intended to be equal), in order to better facilitate class choice for the player. The Apprentice is a mage based character focused on ranged combat and listed as a &quot;novice&quot; class in terms of handling. His towers focus primarily on ranged and elemental damage. The Squire is rated as a &quot;medium&quot; level class, and is primarily a melee based character whose towers are capable of large amounts of physical damage as well as barricading advancing mobs. The Huntress represents an &quot;advanced&quot; class and focuses on ranged combat, with the class' towers taking the form of &quot;traps&quot; which function for a limited amount of charges. Finally, the Monk is a support character, and a &quot;master&quot; level class capable of both ranged and melee attacks. His towers take the form of &quot;auras&quot;; constructed zones on the map capable of buffing allies or inflicting negative status and/or damage on incoming mobs.\n\nThe DLC generally offers more specialized game-play in comparison to the base classes. The Barbarian is a pure melee class. Unlike the Squire, the Barbarian lacks any tower defenses, but is capable of switching battle stances for a variety of effects. The Series EV is a female automaton character whose towers are represented as &quot;beams&quot; which increase in strength and cost depending on the closest corresponding beam &quot;node of the same type. Their effects offer a range of abilities similar to the towers of the primary classes (e.g. damage, defense, traps, and buffs). The Summoner allows the player to complete maps similar to a real-time strategy (RTS) game. The player is capable of switching to an overhead mode in order to better control the Summoner's &quot;minions&quot;.","torrent":{"xt":"urn:btih:9abaa7bdfb68078f3b5fc153c3aac70df342cd18","amp;dn":"Dungeon+Defenders+7.37","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9abaa7bdfb68078f3b5fc153c3aac70df342cd18","infoHashBuffer":{"type":"Buffer","data":[154,186,167,189,251,104,7,143,59,95,193,83,195,170,199,13,243,66,205,24]},"announce":[],"urlList":[]}}