{"title":"Sexually Broken-------Urban X Performer of the Year! Bound, Bro","uid":7570699,"size":1157069348,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:9c6b2fd28b31110747520db21fb3fd01f56a480a&amp;dn=Sexually+Broken%5C-------Urban+X+Performer+of+the+Year%21+Bound%2C+Bro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":-1,"time":1345980671,"description":"Sexually BrokenUrban X Performer of the Year! Bound, Broken, Sexually Destroyed Skin Diamond Matt Williams\n\n\nMp4 + Pics\n\n\nWelcome Skin Diamond to Sexually Broken. Skin was the winner of Best Performer of the Year for 2012 at the Urban X awards. Congratulations Skin.\n\n The very first thing you notice about Skin is her intelligence. She is smart, well spoken with a genuine love for bondage, sex and submission. \n\nThis is our meet and greet. Skin is dressed smartly in a beautiful top, stunning short black skirt and heels. We walk in and bind her on camera - first her elbows, then her elbows again, then wrists. With 3 quick ropes Skin is 100% helpless in our control. We add a latex blindfold, an evil tongue trap, and now Skin is ready to perform as needed. \n\nWith her arms trapped helpless behind her, we fuck Skin's sexy mouth. We fuck it deep and rough. Skin gags on the cock as we jam it deeper and deeper down her throat holding it there. We love breath play scenes here at Sexually Broken and the cock is the best tool for the job.\n\n The intense breath play and lack of air send Skin into subspace quickly.\n\n Giving her no time to catch her breath, she is manhandled to her feet, bent over like a common whore, and fucked deep and hard. The cock just slides into her wet, tight pussy. Bound and getting fucked makes Skin cum in seconds. We knock Skin to the floor and hogtie her before your eyes - it is a brutally tight tie. A vibrator from behind on her clit makes Skin scream as orgasm after orgasm is ripped from her helpless, sweating body. We leave Skin to struggle. She has one minute to free herself or we are going to get very angry...\n\n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_24skin/SexuallyBroken-Skin-Diamond-Matt-Williams-2012-Urban-X-Performer-of-the-Year-Bound-Broken-Sexually-Destroyed.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_24skin/SexuallyBroken-Skin-Diamond-Matt-Williams-2012-Urban-X-Performer-of-the-Year-Bound-Broken-Sexually-Destroyed.php&lt;/a&gt;\n\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n\nCheers  :-) \n","torrent":{"xt":"urn:btih:9c6b2fd28b31110747520db21fb3fd01f56a480a","amp;dn":"Sexually+Broken%5C-------Urban+X+Performer+of+the+Year%21+Bound%2C+Bro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c6b2fd28b31110747520db21fb3fd01f56a480a","infoHashBuffer":{"type":"Buffer","data":[156,107,47,210,139,49,17,7,71,82,13,178,31,179,253,1,245,106,72,10]},"announce":[],"urlList":[]}}