{"title":"Easy Language Trainer Full v1.2.2 Final By bobiras2009","uid":7595403,"size":1359858,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:9da2992abb9b37ea5c42a5e0f25c7df87363db1f&amp;dn=Easy+Language+Trainer+Full+v1.2.2+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346681397,"description":"                                    By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nRequirements: Android 2.1+\nOverview: Then Easy Language Trainer is designed specifically for you! The unique technology of &quot;cards&quot; can teach you lots of words in record time! Just 15 minutes a day with your smartphone on the way to work or before bed and after a week you'll know more words than the standard student of the so-called &quot; Language courses.\n\n\n\nEnglish is no longer a problem!\n\nCan not learn some language?\nTired of sitting with huge dictionaries and pay big money to tutors?\nTime is running out, and the words just do not want to get into your head?\n\nThen Easy Language Trainer is designed specifically for you! The unique technology of &quot;cards&quot; can teach you lots of words in record time! Just 15 minutes a day with your smartphone on the way to work or before bed and after a week you'll know more words than the standard student of the so-called &quot; Language courses.&quot; Too lazy to create your own cards? Then for you, our specialists have developed 12 dictionaries that include more than 500 most popular English words! Use Easy Language Trainer and a month later you will be able to freely understand a necessary language!\n\nFEATURES:\nâ—‡ 12 unique dictionaries and more than 500 words!\nâ—‡ Arcade Mode with multiple-choice answers and the game on time!\nâ—‡ Complete statistics of the results of the arcade game!\nâ—‡ Ability to create custom dictionaries or cards!\nâ—‡ Adding custom words to Favorites, in order to work individually with them!\n\n\n\n\n                                    By bobiras2009\t","torrent":{"xt":"urn:btih:9da2992abb9b37ea5c42a5e0f25c7df87363db1f","amp;dn":"Easy+Language+Trainer+Full+v1.2.2+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9da2992abb9b37ea5c42a5e0f25c7df87363db1f","infoHashBuffer":{"type":"Buffer","data":[157,162,153,42,187,155,55,234,92,66,165,224,242,92,125,248,115,99,219,31]},"announce":[],"urlList":[]}}