{"title":"PhotoViva v2.0.4 Final By bobiras2009","uid":7590970,"size":11032557,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:9f157e3162a802de7f76a29253a224cf2c4d52b1&amp;dn=PhotoViva+v2.0.4+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346539708,"description":"                                    By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nPhotoViva is a powerful application for photo editing and freeform painting. It can help you transform your pictures into expressive and colorful works of art.\n\nIn addition to tools for enhancing your photos, there are paint brushes that let you make abstract painted interpretations of photos. You can select a brush and copy image features by cloning or painting. Brushes can track the direction of movement, or you can set the brush direction. You can also change the hue, saturation and blur of brush strokes as you go.\n\nApp Hints\n\n    Use large brush strokes to fill the canvas, then use smaller brush strokes to reveal detail \n    Use Brushes in &quot;Clone&quot; mode instead of &quot;Paint&quot; mode to copy the source image to the canvas \n    Use Tools-&gt;Blend undo.. to vary the density of your most recent change to the canvas \n    Use the Airbrush in &quot;Clone&quot; mode to blend the image directly to the canvas after painting with brush strokes \n    Try clearing to White, Black or Cream using the Fill menu before painting \n    Add color noise to brush strokes to make a lively variation in the color \n    Use less or no color noise when painting on skin tones \n    Use the HDR correction feature on images that have people in the shadows\n\nWhat's in this version : (Updated : Aug 31, 2012)\n\n    Now you can select the image size to paint higher resolution images. There is an improved user interface with enhance and paint modes, and the app uses less memory on your device. You can also choose to start painting with a blank canvas when a new image is loaded. Image processing is made faster with OpenGL ES 2.0, and PhotoViva also now links to online documentation.\n\nRequired Android O/S : 2.3.3+\n\n\n                                    By bobiras2009\t","torrent":{"xt":"urn:btih:9f157e3162a802de7f76a29253a224cf2c4d52b1","amp;dn":"PhotoViva+v2.0.4+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f157e3162a802de7f76a29253a224cf2c4d52b1","infoHashBuffer":{"type":"Buffer","data":[159,21,126,49,98,168,2,222,127,118,162,146,83,162,36,207,44,77,82,177]},"announce":[],"urlList":[]}}