{"title":"Chinese Fantasy - Paradise, Legend of Magic Mirror (Shui Yue Don","uid":7538274,"size":12809631101,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9f7e48bf26864110b53727be252233d8252d082a&amp;dn=Chinese+Fantasy+-+Paradise%2C+Legend+of+Magic+Mirror+%28Shui+Yue+Don&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ksol1460","files":279,"time":1345148449,"description":"This Chinese wuxia, or fantasy adventure series, from the studios of Zhouyi Media in mainland China was a return to older values for this type of drama. Features an all-star cast, gorgeous sets and costumes and a fascinating story that is fairly easy to follow even if you don't know Chinese (it was never available with English subtitles). \n\nNorman Chu (Tsui Siu-Keung, Xu Shao Qiang) plays the villainous Yin Zhong, a near-immortal sorcerer with a giant snake and insidious plans -- and a curse on him that might take his life before he can carry any of them out. Mr. Chu is kind of the Sean Connery of Chinese cinema. He is a veteran of Shaw Bros. martial arts films of the 70s (including &quot;Duel to the Death!&quot;) and is still active today.  Also starring Yu Bo, Monica Chan, Ada Choi, Yang Jun Yi, Zhang Jin, Song Lai Yun, Lu Xing Yu, Yang Guang, Liu Quan, and Cheng Pei-Pei  (from Crouching Tiger Hidden Dragon). Many of these stars had first performed together in a lengthy science-fiction adventure series, &quot;Young Wesley&quot;, and would team up again a few years later for a shorter series, &quot;Eight Charts&quot;. \n\nSHUI YUE DONG TIAN - LING JING CHUAN QI are out of print and no longer available from the distributor. I've also thrown in the original soundtrack and a summary with full cast list to make sense of what is going on. Hope you enjoy them!","torrent":{"xt":"urn:btih:9f7e48bf26864110b53727be252233d8252d082a","amp;dn":"Chinese+Fantasy+-+Paradise%2C+Legend+of+Magic+Mirror+%28Shui+Yue+Don","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f7e48bf26864110b53727be252233d8252d082a","infoHashBuffer":{"type":"Buffer","data":[159,126,72,191,38,134,65,16,181,55,39,190,37,34,51,216,37,45,8,42]},"announce":[],"urlList":[]}}