{"title":"London 2012 Olympic Games Opening Ceremony BBC1.mp4","uid":7516561,"size":3883561945,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a0298ecd2ff2e9b05230656ce505929139097d5a&amp;dn=London+2012+Olympic+Games+Opening+Ceremony+BBC1.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"yohnivek","files":1,"time":1344488174,"description":"London Olympic Games 2012 Opening Ceromony BBC1. \n\nFirstly I am a sixty year old Australian and have never before tried to do what I about to explain to you. So please bear with me.\n\nI downloaded both the 3GB &quot;tentacle16&quot; and 28GB &quot;footy&quot; upuloads from this site.\nI was not happy with either of them. The former one had terrible sync issues after about the first two and half hours. The latter one I could only get to play in Russian.\nI tried converting  &quot;tentacle16&quot; into DVD format hoping this would fix it.But it didn't.\n\nAs my wife is British and want's to keep this on DVD in the BBC1 form, I then set about what turned out to be a mamath task.\nThe sync issue with &quot;tentacle16&quot; was not not consistant, so I re-encoded it to MPEG2 9200kbps.\nI then split this into five parts and re-encoded each part into five seperate files, adjusting the audio in each one till I was happy with them.\nI also took a small section of the video from &quot;footy&quot; and re-encoded this with the audio from &quot;tentacle16&quot;.\n\nI then combined all these files into one 8GB MPEG2 file suitable for re authoring to DVD9. However in doing this the bit rate was reduced to 4492 kbps thus reducing the video quality a little.There is still a sync issue towards the end of the athletes entrance and and the last minute of the commentators in the studio. However the majority of the athletes march is only commentry and is not really all that noticable. The spoken and sung parts are pretty much in sync.\n\nAfter many many hours over a few days my wife finally has her BBC1 DVD and I am reasonably happy with the results.\n\nI then thought maybe someone else may have had the same sync issues as I had, so then re-encoded the final result to 3.8GB MP4 and posted it on this site if you are interested.\n\nThanks \n\n\n\n\n\n \n\n","torrent":{"xt":"urn:btih:a0298ecd2ff2e9b05230656ce505929139097d5a","amp;dn":"London+2012+Olympic+Games+Opening+Ceremony+BBC1.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0298ecd2ff2e9b05230656ce505929139097d5a","infoHashBuffer":{"type":"Buffer","data":[160,41,142,205,47,242,233,176,82,48,101,108,229,5,146,145,57,9,125,90]},"announce":[],"urlList":[]}}