{"title":"DeviceBondage--------DB-22873 Kathryn Dupri","uid":7502234,"size":2035134867,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:a0a12837f2fe9a988c3dc6be62ef030eb47d95a1&amp;dn=DeviceBondage--------DB-22873+Kathryn+Dupri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1344058486,"description":"\nKathryn Dupri Submits to Leather Restraint\n\nAug 3, 2012 - Performers: Kathryn Dupri \n\n\nMP4 and WMV + Pics.   \n        \n\nWelcome Kathryn Dupri. Her stunning blue eyes are very expressive in restraint and today she submits to leather. Leather is a deceiving tool because it looks so comfortable and delicate. However it has no yield and the edges are felt under any weight bearing activities which acts as a deterrent... a predicament of sorts to discourage movement. Each position curves her body in ways that accentuate her breasts, tattoos, and great ass. In scene one, Claire makes a mesh mask of sorts and binds it to her face using rubber. Her waist is hoisted up to present her cunt. The hands are behind Kathryn's head exposing her breasts and arms for a variety of torment. In scene two she is strapped. Tightly. Leather straps cascade down her body. Leather mitts enrobe her hands, making it very difficult to try and unbuckle the straps. A tight leather corset cinches in her abdomen and tight tall ballet boots prevent any escape attempts. A leather head harness and whiffle ball gag complete the face treatment. A perfect toy to kick with Claire's tall leather boots. In the final position, Kathryn is folded in a kneeling knees forward leather strap hogtie suspension. Her arms are encased into leather opera length bondage mitts woven together to form a type of leather box tie. Her legs are pried open with more straps. Escape has never been possible for this bitch, nor will it be. She is under our control. Helpless. Vulnerable. Fucked. \n\nScreens &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=22873&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=22873&lt;/a&gt;\n\nAnd if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\nCheers  :-) \n\n","torrent":{"xt":"urn:btih:a0a12837f2fe9a988c3dc6be62ef030eb47d95a1","amp;dn":"DeviceBondage--------DB-22873+Kathryn+Dupri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0a12837f2fe9a988c3dc6be62ef030eb47d95a1","infoHashBuffer":{"type":"Buffer","data":[160,161,40,55,242,254,154,152,140,61,198,190,98,239,3,14,180,125,149,161]},"announce":[],"urlList":[]}}