{"title":"Birds of Steel PAL XBOX360-COMPLEX","uid":7104903,"size":8739294243,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:a2d8af34a0bcb989fce7d18ae8b891d800a98a6c&amp;dn=Birds+of+Steel+PAL+XBOX360-COMPLEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boobsman","files":-1,"time":1331835088,"description":"THIS IS AN XGD3 ISO AND IS ONLY BE PLAYABLE WITH LT+2.0 or ABOVE!!!\n\nBirds of Steel PAL XBOX360-COMPLEX\n\nBirds of Steel is a combat simulator featuring some of the most pivotal air \nbattles of World War II, including the battle of Midway, Guadalcanal, Coral \nSea, the historic attack on Pearl Harbour, the Mediterranean Maltese island \nand more. Birds of Steel offers 20 historical and a wealth of fictitious \nmissions, spanning eight world famous campaigns, and users are givenaccess \nto over 100 famous planes from the entire axis and allied forces rosters. A \nnumber of planes ideal for each campaign can be selected, and have been \nfaithfully recreated in terms of handling, capabilities and weaponry. The \nclassic Spitfire, P-51D Mustangs, and Messerschmidt 109 are all lined up for \ncombat, as players opt to player opt to fight for the Allies, Japanese or \nAxis forces. Birds of Steel also enjoys a huge online element. Players can \nsupport co-op missions alongside friends, or enter massive multi-player \nonline dogfights to see who owns the skies.\n\nFeatures:\n\nOver 100 real life planes - Dog fight and dive bomb in actual WW2 planes and \nrain down terror from above. Determine for yourself which plane is the \nultimate bird of prey.\n\nNavigate through hundreds missions - Embark on 20 historical missions, hundreds \nof procedural missions scattered throughout 16 different locations. All are \ninspired by real life campaigns such as Pearl Harbor, Guadalcanal and the battle \nof Wake Island. Reality is reflected using real life maps and actual satellite \nphotos of these areas.\n\nPioneering online and multi-player modes for flight sims - Enjoy 4 player co-op \nor go into the new and unique online war mode to compete against up to 16 \naviators across world.\n\nKey innovations - In every single warplane you will experience the unique details \nof the physics and damage models. Master your dogfights during heavy wind and \nrain. Each plane has over 100 hitpoints where each part of the plane has its own \nhealth and damage detection.\n\nFun for all gamers - Multiple levels of realism offer a gameplay experience for \ngamers of all walks: Simplified, Realistic up to Simulator for the serious \nflight-sim aficionados.\n\nPlatform: XBOX360 \nRegion: PAL\nFormat: XGD3\nSize: 1 DVD \nGenre: Simulator \nLanguages: English \n\nTrailer:\n\nXGD3 BURN GUIDE: http://nickthegr33k.eu/XGD3burn.pdf\n &lt;a href=&quot;\nhttp://www.freeimage.us/image-A602_4F621527.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-A602_4F621527.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.freeimage.us/image-F4B5_4F621527.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-F4B5_4F621527.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a2d8af34a0bcb989fce7d18ae8b891d800a98a6c","amp;dn":"Birds+of+Steel+PAL+XBOX360-COMPLEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2d8af34a0bcb989fce7d18ae8b891d800a98a6c","infoHashBuffer":{"type":"Buffer","data":[162,216,175,52,160,188,185,137,252,231,209,138,232,184,145,216,0,169,138,108]},"announce":[],"urlList":[]}}