{"title":"ExploitedCollegeGirls - Monika ** August 03, 2011 **","uid":7562302,"size":743868814,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a5355f74c1d129ce8ea2c484bcd6552389326952&amp;dn=ExploitedCollegeGirls+-+Monika+%2A%2A+August+03%2C+2011+%2A%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Xavier461","files":1,"time":1345771535,"description":"Screenshots\n &lt;a href=&quot;\nhttp://bayimg.com/caBnEAAEH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/caBnEAAEH&lt;/a&gt;\n\n\n\nSize: 743868814 bytes (709.41 MiB), duration: 00:53:40, avg.bitrate: 1848 kb/s\nAudio: wmav2, 44100 Hz, stereo, 128 kb/s\nVideo: wmv3, yuv420p, 640x360, 1715 kb/s, 29.97 fps\n\n\nSchool: Scottsdale Community College\nYear: Freshman\nAge: 18\nHeight: 5'4\nFigure: 34DD-26-30\nEyeColor: Hazel\nABOUT\n\nMonika is already wet when we take the photos (look at the juice spot on her panties, and the pussy close-ups...). Taking a girl's pics often makes her feel desired and when Monika says she sometimes feels 'ugly' I know this hottie is going to appreciate the attention she'll be getting from her photos and videos here. She is a little nervous when we start the video - her first - in earnest. But that quickly subsides when the topic drifts to sexual things. &quot;What's your favorite body part?&quot; I ask and Monika sheepishly grabs my cock. I actually meant her body but I don't mind the confusion. Not surprisingly she answers her boobs are her favorite part on her and I can tell why. Her tits are fantastic. Large, all natural 34 DDs that bounce and sway whenever she moves (or gets fucked). I got my first peek at those funbags earlier when Monika got ready in the bathroom and we got the interview quesitons out of the way.\nThe minute I start unwrapping and touching her, Monika gets that look on her face that's a clear invite for sex, and anything that comes in between her getting fucked is nothing but an unwelcome distraction to her. Like talking. She must have been ovulating because most girls aren't usually that sensual this soon in the game otherwise: Just a few seconds of fingering Monika's sensitive clit and she's swooning, eyes closed, and her voice cracks a little when she answers my questions. Monika really wants it. Now. That's my cue to stop the yapping and start getting Monika in a comfortable position so she can cum. Hard. I'm thinking I'll have her use toys but she's already starting to masturbate on her own and lovin' it. So am I, our busty blonde is about to cum and all it takes is a bit of touching and fingering. She has a great orgasm, with her body squirming and shaking, and everything. You'll love it!\nSex with Monica is great, she enjoys it as much as I do and her pussy juice covering my cock as I fuck her is testimony to that. If you're a boobs man, you'll love watching her big tits bounce back and forth as she's getting it. Monika makes me cum with her oral skills, and then keeps on stroking my spent cock to squeeze out the last remaining drops of jizz while she watches me squirm. Her facial expressions tell us she lives to make men come and clearly enjoys the power she momentarily has when she makes us orgasm. And right after I'm done coming, Monika does one of the weirdest things in ECG history... ","torrent":{"xt":"urn:btih:a5355f74c1d129ce8ea2c484bcd6552389326952","amp;dn":"ExploitedCollegeGirls+-+Monika+%2A%2A+August+03%2C+2011+%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5355f74c1d129ce8ea2c484bcd6552389326952","infoHashBuffer":{"type":"Buffer","data":[165,53,95,116,193,209,41,206,142,162,196,132,188,214,85,35,137,50,105,82]},"announce":[],"urlList":[]}}