{"title":"Hogtied------HT-23722  Ashli Orion Wmv","uid":7480710,"size":652171189,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:a5fb58bdb7ef1aa5eaef50fe5a95612424a8f180&amp;dn=Hogtied------HT-23722++Ashli+Orion+Wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1343426358,"description":"Reupload \n\n\nAshli Orion Cums Back for More Brutal Ties only on HogTied\n\nJul 26, 2012 - Performers: Ashli Orion \n\n\n WMV + Pics.\n \n\nAmazing Ashli Orion returns to HogTied for another round of extreme rope bondage to the severity that can only be found on the best rope bondage site on the net, HogTied.com. In scene 1, Ashli is bound standing with her arms in elbows together, chicken wing rope bondage, bound firmly to a pole. Her ankles are spread wide with a pole, and a crotch rope is added to her predicament. She loves the pain and the bondage. As Claire increases the tension on her elbows it just turns her on more and more. In scene 2, Ashli is folded with her knees open, toes tied to her thighs, and arms in strappado. A gag head harness is added and her body is slathered in oil. Her ass is repeatedly violated with a dick on a stick. All this bitch can do is cum. In scene 3, her knees are folded to her chest in a compression tie and her ankles in leather cuffs. Her wrists are tied to her neck prisoner style which is also attached to the pulley and she is suspended. All this bitch wants and needs is a good fucking. Claire's fist slides easily into her cunt and Claire steers the bitch around in the air by her greedy fuck hole. In scene 4, Ashli is bound in a modified spread eagle. A tall pipe is placed under her hips and her knees are bound open, making her do a kind of ballet pose laying down. The oil comes out to accentuate every curve and fold of beautiful skin she has, making the focal point her cunt mound. Orgasm after orgasm we peel back layers of this cunt.\n\nScreens  &lt;a href=&quot;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=23722&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=23722&lt;/a&gt;\n\nAnd if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\nCheers  :-) \n\t\t","torrent":{"xt":"urn:btih:a5fb58bdb7ef1aa5eaef50fe5a95612424a8f180","amp;dn":"Hogtied------HT-23722++Ashli+Orion+Wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5fb58bdb7ef1aa5eaef50fe5a95612424a8f180","infoHashBuffer":{"type":"Buffer","data":[165,251,88,189,183,239,26,165,234,239,80,254,90,149,97,36,36,168,241,128]},"announce":[],"urlList":[]}}