{"title":"YTD Video Downloader 3.9.2 + Portable Final By bobiras2009","uid":7599326,"size":11608153,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a69ba3494f42b9e435588a0e3e0934435d6209d9&amp;dn=YTD+Video+Downloader+3.9.2+%2B+Portable+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346771480,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\n\nYTD Video Downloader is software that allows you to download videos from YouTube, including HD and HQ videos, and many others and convert them to other video formats. The program is easy to use, just specify the URL for the video you want to download and click the Ok. It also allows you to convert downloaded videos for iPod, iPhone, PSP, Cell Phone, Windows Media, XVid and MP3. Allows you to access YouTube videos for which you need to be 18+ years of age. Now, plays videos downloaded.\n\nTool to download videos from YouTube and save it to your local computer. The videos can be converted to avi video format or to mp4 (compatible with iPod, iPhone). The main distinguishing feature of YTD Video Downloader is that now you can download High Quality videos and High Definition videos from YouTube.\n\nThis simple freeware application works pretty well, given how basic the interface is. It has two main features: to download FLV files from YouTube, and to convert them to most major formats. If there's a YouTube URL in your clipboard, it will automatically paste it for you when you click on the dialog box. From there, just hit OK and the downloading will commence. One more left-click is all it takes to load the file in the converter, which supports iPhone, iPod, PSP, cell phone, AVI, MP3, WMV, and Xvid. Surprisingly, there's also a basic video editor for cropping videos by time stamp. You can also cut out the sound when converting.\n\nThis is one of the lightest editors around, but the simplistic interface belies its functionality and it performs exactly as advertised. We'd like to see support in future editions for hunting down missing codecs, and new version and earlier won't work because of embed code changes on YouTube itself. Still, the YTD Video Downloader is proof that not only is video-making accessible to everyone, so is video downloading and editing.\n\nFearures:\nEasy to use: just copy video URL from your web browser and paste to YTD Downloader.\nNo need to use scripts or browser plug-ins.\nConvert downloaded video to various formats.\nDownload Youtube High Definition videos (available on certain videos)\nUnicode support: Youtube Downloader HD can save movies whose names have non-standard characters (like Chinese, Japanese, Cyrillic, etc.)\nSupport for big video files\n\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:a69ba3494f42b9e435588a0e3e0934435d6209d9","amp;dn":"YTD+Video+Downloader+3.9.2+%2B+Portable+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a69ba3494f42b9e435588a0e3e0934435d6209d9","infoHashBuffer":{"type":"Buffer","data":[166,155,163,73,79,66,185,228,53,88,138,14,62,9,52,67,93,98,9,217]},"announce":[],"urlList":[]}}