{"title":"Milestones in Science (gnv64)","uid":7547744,"size":72762847,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a872227805cbb1136e51af00b7b7e3ba228c5811&amp;dn=Milestones+in+Science+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gnv65","files":-1,"time":1345400386,"description":"Milestones in Science\nBy Divyanshoo Rai Kohli\nVigyan Prasar | 2003|  ISBN: 81-7480-094-8 | PDF | 233 pages | 69.3 mb\n\nThe Publication Programme of Vigyan Prasar has taken a definite shape in the last few years. To start with, Vigyan Prasar brought out a number of publications on a variety of topics of science and technology on an experimental basis. Popular Science classics, India's Scientific Heritage, Natural History, Health, and Do-It- Yourself are some of the series that have evolved over the years. Our emphasis has been on bringing out quality publications on various aspects of science and technology at affordable prices. Further, Vigyan Prasar is putting in efforts to bring out publications in major Indian languages for various target groups.\nThe present book Quest : Milestones in Science by Divyanshoo Rai Kohli, however, is different from earlier publications. Divyanshoo compiled it, when he was a Class IX student of the St. John's School, Chandigarh as part of the contest Quest : Milestones in Science organised by a national daily, The Indian Express. Shri Divanshoo's compilation was awarded the first prize. Vigyan Prasar agreed to publish this compilation with the hope that it will encourage many other students to take up similar endeavours. The book contains information about one hundred ninety eight scientists and their discoveries/inventions. The Contributors to the Quest Series in the Indian Express were : Dr. V.G. Kulkarni, Dr. Anjali Kulkarni &amp; Dr. Bal Phondke.","torrent":{"xt":"urn:btih:a872227805cbb1136e51af00b7b7e3ba228c5811","amp;dn":"Milestones+in+Science+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a872227805cbb1136e51af00b7b7e3ba228c5811","infoHashBuffer":{"type":"Buffer","data":[168,114,34,120,5,203,177,19,110,81,175,0,183,183,227,186,34,140,88,17]},"announce":[],"urlList":[]}}