{"title":"Hold Screen ON: Face Detection v1.40 Final By bobiras2009","uid":7571808,"size":3266560,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:a8cce84aa3a2ae3f85cd747bcd33c906649f6fa8&amp;dn=Hold+Screen+ON%3A+Face+Detection+v1.40+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346009068,"description":"                                  By bobiras2009\t\t\t\n\nRequirements: Android 2.3+\nOverview: This application act as service and use front camera of your phone for face recognition. When the face is detected, the application will prevent the locking of phone's screen. Just keep the screen on while you are looking on it.\n\n\nKeep the screen on while you are looking on it.\n\nThis application act as service and use front camera of your phone for face recognition. When the face is detected, the application will prevent the locking of phone's screen. Just keep the screen on while you are looking on it.\nBy other words, this app works like a Samsung Galaxy S3 Smart Stay feature but can detects eyes too.\n\nKEY FEATURES:\n\n* Compatibility mode: can run on almost all android devices\n* Run in background\n* Face detections\n* Eyes detections\n* Do not runs when screen goes off\n* Application binding: you can choose behaviour for individual application\n\nPLEASE NOTE:\n\n* When service or preview window is active, you can see a single dot (which can have different color and brightness) at the top right corner of the desktop, just behind the time. It is normal. It is a one and only possible one way to grab content from the camera of some android devices (like HTC One, Galaxy Nexus etc).\n\n* If your front camera have low resolution or small viewing angle, try to use eyes detection instead of face detection.\n\n* This application uses your phone's camera only during the face scanning. By default, it is 3 frame every 5 seconds. Between these intervals, you can run any other application which can lock and use the camera.\n\n\n\n                                  By bobiras2009\t\t\t","torrent":{"xt":"urn:btih:a8cce84aa3a2ae3f85cd747bcd33c906649f6fa8","amp;dn":"Hold+Screen+ON%3A+Face+Detection+v1.40+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8cce84aa3a2ae3f85cd747bcd33c906649f6fa8","infoHashBuffer":{"type":"Buffer","data":[168,204,232,74,163,162,174,63,133,205,116,123,205,51,201,6,100,159,111,168]},"announce":[],"urlList":[]}}