{"title":"MaxxMEM2 preview 1.96","uid":7578956,"size":1063575,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a9e11ffdc3ed46f59211f3952ec896efc20ee49c&amp;dn=MaxxMEM2+preview+1.96&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drhitman","files":1,"time":1346189811,"description":"Copyright (c) 2010 M.Bicak. All rights reserved.\n\nATTENTION:\n \nMAXXPIÂ² (MAXXMEMÂ²-PREVIEW) IS A FREE SERVICE.\nTHERE ARE NO GUARANTEES ABOUT THE AVAILABILITY AND CONTINUITY OF THIS SERVICE.\n \nUSING(1) THIS SITE INDICATES THAT YOU HAVE READ AND ACCEPT THE FOLLOWING TERMS.\n \nSOFTWARE LICENSE AGREEMENT:\n \nIT IS ALLOWED TO PRESENT RESULTS OF MAXXPIÂ² (MAXXMEMÂ²-PREVIEW) IN THE PUBLIC,\nEXECPT I DISAGREE.\n\nREDISTRIBUTION AND USE, ARE PERMITTED PROVIDED THAT THE\nFOLLOWING CONDITIONS ARE MET:\n \n1. THE ORIGIN OF THIS SOFTWARE MUST NOT BE MISREPRESENTED\n   YOU MUST NOT CLAIM THAT YOU WROTE THE ORIGINAL SOFTWARE\n \n2. THE ORIGIN OF THIS SOFTWARE MUST NOT BE MISREPRESENTED\n \n3. YOU MUST NOT CLAIM THAT YOU WROTE THE ORIGINAL SOFTWARE\n \n4. YOU MUST NOT ALTER THE SOFTWARE, USER LICENCE OR INSTALLER IN ANY WAY\n   THIS NOTICE MAY NOT BE REMOVED OR ALTERED FROM ANY DISTRIBUTION\n \n5. YOU MAY NOT RESELL OR CHARGE FOR THE SOFTWARE\n \n6. YOU MAY NOT REVERSE ENGINEER, DECOMPILE, DISASSEMBLE,\n   DERIVE THE SOURCE CODE OF OR MODIFY [OR CREATE DERIVATIVE WORK FROM] THE PROGRAM\n \n7. YOU MAY NOT CLAIM ANY SPONSORSHIP BY, ENDORSEMENT BY, OR AFFILIATION WITH MAXXPI.NET\n \n8. YOU ACKNOWLEDGE THAT MAXXPI.NET OWNS THE COPYRIGHT AND ALL ASSOCIATED\n   INTELLECTUAL PROPERTY RIGHTS RELATING TO THE SOFTWARE\n \n9. IF ANY INFORMATIONS/RESULTS FROM/WITH MAXXPIÂ² (MAXXMEMÂ²-PREVIEW) WILL GIVEN TO  \n   THE PUBLIC, FROM A OFFICAL SITE, AT LEAST ONE DIRECT (CLICKABLE) LINK TO HTTP://WWW.MAXXPI.NET,\n   MUST BE GIVEN\n \nTHIS SOFTWARE LICENCE IS GOVERNED BY AND CONSTRUED IN ACCORDANCE WITH THE LAWS OF GERMANY\nAND YOU AGREE TO SUBMIT TO THE EXCLUSIVE JURISDICTION OF THE GERMAN COURTS.\n \nWARRANTIES AND DISCLAMERS\n \nTHIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS &quot;AS IS&quot; AND ANY \nEXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED \nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, FUNCTIONALITY \nAND DATA INTEGRITY OR PROTECTION ARE DISCLAIMED.\n \nIN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, \nINDIRECT, INCIDENTAL, CONSEQUENTIAL, SPECIAL OR PUNITIVE DAMAGES WHICH MAY \nRESULT FROM THE USE OF THIS SOFTWARE, INCLUDING LOSS OR INTERRUPTION OF \nBUSINESS, ACCIDENTAL LOSS OF DATA OR DAMAGE TO COMPUTER EQUIPMENT.\n \nACKNOWLEDGEMENTS\n \nFirst of all, I thank Ray Hinchliffe for his SIV, which is used by MAXXMEMÂ²-PREVIEW to detect\nsome system specifications. SIV can be found here: http://rh-software.com .\n \nFurther thanks and appreciation goes out to all the Beta testers who have assisted with \ntesting and bug fixing over the past many months.\n \nA special thanks to: Dr.Walther, Andreas, Dr.J.Brown, Cai Dan (GuNNer), Pascal (peebee), Robert (SeLecT),\nFrank (u22) and Christian (rabba) for their extra dedication, enthusiasm, helpful feedback and suggestions.\n \nCONTACTING THE AUTHOR\n \nQuestions and comments concerning MaxxPIÂ² directly, should be done via contact page.\n\n--------------------------------------------------------------------------------\n \n(1) IF YOU DO NOT ACCEPT THIS FOLLOWING TERMS, YOU ARE NOT AUTHORIZED TO USE THIS SITE AND \n    YOU MAY NOT DOWNLOAD OR INSTALL/USE THE SOFTWARE UNTIL YOU HAVE READ AND ACCEPTED \n    THE TERMS OF THE SOFTWARE LICENSE AGREEMENT.\n","torrent":{"xt":"urn:btih:a9e11ffdc3ed46f59211f3952ec896efc20ee49c","amp;dn":"MaxxMEM2+preview+1.96","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9e11ffdc3ed46f59211f3952ec896efc20ee49c","infoHashBuffer":{"type":"Buffer","data":[169,225,31,253,195,237,70,245,146,17,243,149,46,200,150,239,194,14,228,156]},"announce":[],"urlList":[]}}