{"title":"Odd.Jobs.XXX.BDRip.XviD-STARLETS[rbg]","uid":7511953,"size":740147743,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:abb7049cccee8507521ff79999e995743e56280a&amp;dn=Odd.Jobs.XXX.BDRip.XviD-STARLETS%5Brbg%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"perfectblue","files":4,"time":1344353383,"description":"SCREENSHOTS\n &lt;a href=&quot;\nhttp://tpbay.pornblink.com/?p=74&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tpbay.pornblink.com/?p=74&lt;/a&gt;\n\nMORE\n\nRELEASE.DATE07/08/2012            \nDVD.DATE24/07/2012\nPROD.YEAR2012\nSOURCEBLURAY\nAUDIO.BITRATE119 kb/s VBR MP3\nVIDEO.BITRATE817 kb/s\nCOMPANYDigital Playground\n\nSiZE.CD150x15Mb\nRUNNING.TIME1h42m57s\nCODECXviD\nGENREFeature\n\nGenres :\tFeature\nActors :\tAlexa Rydell, Erik Everhard, James Deen, Manuel Ferrara, Reena Sky, Selena Rose, Tessa Lane\nStudio :\tDigital Playground\nReview :\tOdd Jobs porn Luscious Digital Playground superstarlet Selena Rose signs up for one-on-one boxing lessons from James Deen. Odd Jobs DVD video What she doesnt know is that her coach is a fake! James and his buddies are broke, out of work losers who happened to score some old athletic equipment. To make some beer money, the guys pass themselves off as certified professionals. The playfully sexy Reena Skye thinks shes receiving an expert massage from fumbling Erik Everhard, who instead gropes her tight young body until she succumbs to his wily ways. Pretending to be a tennis instructor, Manuel Ferrara tricks saucy Tessa Lane into whacking his racket until he lobs his balls all over her. Teen dream, Alexa Rydell wants to learn martial arts but ends up going crazy when James shows her his full mounting position. Selena sexes up the guys and outwits them all with her hardcore moves that leave them emptied!Making Money And Getting Laid, Any Way Possible!Luscious Digital Playground superstarlet Selena Rose signs up for one-on-one boxing lessons from James Deen. What she doesn't know is that her 'coach' is a fake! James and his buddies are broke, out of work losers who happened to score some old athletic equipment. To make some beer money the guys pass themselves off a certified professionals. The playfully sexy Reena Skye thinks she's receiving an expert massage from fumbling Erik Everhard, who instead gropes her tight young body until she succumbs to his wily ways. Pretending to be a tennis instructor Manuel Ferrara tricks saucy Tessa Lane into whacking his racket until he lobs his balls all over her. Teen dream Alexa Rydell wants to learn martial arts but ends up going crazy when James shows her his full mounting position. Selena sexes up the guys and outwits them all with her hardcore moves that leave them emptied!","torrent":{"xt":"urn:btih:abb7049cccee8507521ff79999e995743e56280a","amp;dn":"Odd.Jobs.XXX.BDRip.XviD-STARLETS%5Brbg%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abb7049cccee8507521ff79999e995743e56280a","infoHashBuffer":{"type":"Buffer","data":[171,183,4,156,204,238,133,7,82,31,247,153,153,233,149,116,62,86,40,10]},"announce":[],"urlList":[]}}