{"title":"Alex Beaton - Daft Ditties [flac]","uid":7554911,"size":167937756,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ae95786f10ad8bc55f589fd5d1f6328df86e837c&amp;dn=Alex+Beaton+-+Daft+Ditties+%5Bflac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rambam1776","files":-1,"time":1345581719,"description":"A collection of humorously and tastefully offensive songs. This is your standard Scottish or Ren Fest stuff.\n\nOriginal Release / Glenfinnan Music Ltd / GRC106CD / CD\n\nAlex Beaton is a Scottish, guitar-playing folksinger who makes more than 20 concert appearances annually at various events across the United States (primarily highland games). Beaton appears annually at the Grandfather Mountain Highland Games in North Carolina, and the Stone Mountain Highland Games in Atlanta, Georgia, two of the largest highland games events in the United States. Beaton has been called &quot;probably the country's most popular Scottish folk singer.&quot; He has a baritone voice.\n\nAt many events, Beaton not only serves as a key entertainer, but as the event emcee. Beaton is known for his powerful stage presence and sense of humor. He frequently interacts and jokes with audiences while performing and in-between songs. One of his albums, Daft Ditties, is composed entirely of comedic songs. Beaton is also known for his keen knowledge of Scotland's history.\n\nBeaton had released 20 albums on CD and one DVD musical travelogue of Scotland that pulls together three titles that were previously released on VHS tape. Along with his concert appearances, Beaton usually hosts one or two trips to Scotland per year where he serves as the host and tour guide. As of 2011, his tour offerings had grown to include a &quot;Highlands &amp; Islands Tour&quot; in June, the occasional Ireland tour, and a 3-day tour of Nashville, Tennessee. All tours typically sell out quickly.\n\n\n1. Big Nellie May\n2. Dundee Weaver \n3. The Hermit \n4. Seven Drunken Nights \n5. The Money Rolls In \n6. Dear Boss\n7. Wee Castanettes \n8. Puddles \n9. The Mermaid \n10. The Bantom Cock \n11. Maids When You're Young","torrent":{"xt":"urn:btih:ae95786f10ad8bc55f589fd5d1f6328df86e837c","amp;dn":"Alex+Beaton+-+Daft+Ditties+%5Bflac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae95786f10ad8bc55f589fd5d1f6328df86e837c","infoHashBuffer":{"type":"Buffer","data":[174,149,120,111,16,173,139,197,95,88,159,213,209,246,50,141,248,110,131,124]},"announce":[],"urlList":[]}}