{"title":"POtHS 3 - Bible - 92 - The Hope","uid":7595531,"size":2830954595,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:af91ed18af1fa5000ad67119395081bc84798c4f&amp;dn=POtHS+3+-+Bible+-+92+-+The+Hope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":50,"time":1346684214,"description":"\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS 3 - Bible Movies - 92 - The Hope\n\n\n\n\n\nPOtHS says: This is Good\n\nDescription:\n\nThe Bible is a source of hope and help for all who place their faith in its Author. Like the Bible, The Hope transcends age and culture to communicate the love, and the story of Jesus -- from Creation to cruxificion, and beyond!\nIf you've been a Christian for as long as you can remember, you'll be amazed at how much better you understand the Bible after just one viewing. If your relationship with Jesus has only recently begun, this production could easily advance your understanding of Scripture by 10 years. The Hope is an evangelistic tool that touches hearts as it emblazons unforgettable stories on the minds of its viewers. An amazing overview of God's miraculous plan of Salvation!\n\n&quot;Without question, The Hope is the most powerful presentation of the gospel on video that we have ever seen. Where the .Jesus film has introduced millions worldwide to the life and message of Jesus, The Hope is set to supplement that by giving an overall view of the timeline of history on earth. ...There is a &quot;zero embarrassment&quot; factor on this one, so feel free to share a copy with friends, family, your local library... the question is what part will you and The Hope play together in reaching the nations with the Good News of the Kingdom?&quot;\nFrom review by Ken James at Christian Spotlight on the Movies\n\n&quot;The common barriers to global evangelization are language, culture, geography, and iliteracy. The Hope was created to overcome these barriers, and to take viewers on a complete journey through the biblical account of God's redemptive story in little more than an hour.&quot;\n--Fred Carpenter, President of Marks Hill productions.\n\n&quot;In a time when instant solutions are sought, it is gratifying to see a project like The Hope which takes the time to use the fabric of Scripture to prepare the human heart for true understanding of the Gospel.&quot;\n--Don Pederson, Chairman, New Tribes Missions Research and Planning\n\n\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n ","torrent":{"xt":"urn:btih:af91ed18af1fa5000ad67119395081bc84798c4f","amp;dn":"POtHS+3+-+Bible+-+92+-+The+Hope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af91ed18af1fa5000ad67119395081bc84798c4f","infoHashBuffer":{"type":"Buffer","data":[175,145,237,24,175,31,165,0,10,214,113,25,57,80,129,188,132,121,140,79]},"announce":[],"urlList":[]}}