{"title":"Sexually Broken----Old School Sexual Punishment Lyla Storm Matt ","uid":7554584,"size":662960015,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b277650036960837344798ee5018b7604000441b&amp;dn=Sexually+Broken----Old+School+Sexual+Punishment+Lyla+Storm+Matt+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":-1,"time":1345573906,"description":"Old School Sexual Punishment | Lyla Storm | Matt Williams \n\nAugust 20, 2012 \n \n   \nMP4 + Pics.  \n    \n \nLyla Storm is back, and her flexible, lithe body is put to the test. Along with her HUGE nipples, sexy feet, and slutty pussy. She gets the deluxe package of pain and pleasure combined into one devastating orgasmic overload that might result in brain damage, Just kidding, no I'm not, of course I am, not really...\n\nWith her breast tightly bound, her huge nipples sticking out, and trapped in a amazing &quot;fuck me&quot; position, Lyla is in for the ride of her life. \n\nFirst off we pay special attention to her delicate sexy feet. The flogger is deployed to the soles of her feet, and since her big toe is tied down we have an easy target. Lyla reels in pain as the flogger bits hard into her tender foot flesh. We move quickly to her exposed pussy and give that a brutal flogging as well. Lyla's screams of pain will make most men's dick hard in a seconds. \n\nAfter we abuse our helpless, little, want-to-be runway model, and build her endorphins to a high level, we attack her huge nipples with suction cups, clamp her tongue in a brutal wooden trap, then pull that up and out of her mouth! We vibrate her to orgasm after orgasm, then we finger blast her to squirting orgasms, then vibrate then squirt on and on. \n\nSoon Lyla is just a helpless cumming machine, unable to stop herself from orgasming over and over. Each orgasm more brutal then the last, until our sexy porn star is begging, no pleading for us to stop, to show mercy. She has finally learned what being totally helpless really means, and it scares her... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_20lyla3/SexuallyBroken-Lyla-Storm-Matt-Williams-Old-School-Sexaul-Punishment.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_20lyla3/SexuallyBroken-Lyla-Storm-Matt-Williams-Old-School-Sexaul-Punishment.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n\nCheers  :-) \n\t\n\n","torrent":{"xt":"urn:btih:b277650036960837344798ee5018b7604000441b","amp;dn":"Sexually+Broken----Old+School+Sexual+Punishment+Lyla+Storm+Matt+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b277650036960837344798ee5018b7604000441b","infoHashBuffer":{"type":"Buffer","data":[178,119,101,0,54,150,8,55,52,71,152,238,80,24,183,96,64,0,68,27]},"announce":[],"urlList":[]}}