{"title":"Watashi ga Renai Dekinai Riyuu","uid":7097831,"size":4021864529,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b37f193b48a864faefdb23ba0a73c495f4b6a30b&amp;dn=Watashi+ga+Renai+Dekinai+Riyuu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Domiku","files":22,"time":1331611881,"description":"Subtitles courtesy of http://www.d-addicts.com/forum/viewtopic_100573.htm\n\nMore than half of women in their 20's to 30's admit to &quot;currently lacking a boyfriend.&quot; Men, love, sex, work, marriage... All the issues women face today are revealed in truth through this generation, an &quot;ice age of love.&quot;\n\n&quot;The reason I can't find my love&quot; highlights the lives of three women, Fujii Emi, Ogura Saki and Hanzawa Mako. Emi works for a lighting company as a lighting technician, where she is surrounded by men due to the nature of the profession. She has a straight-forward and generous personality, but is unconcerned about general feminine interests such as fashion. She is often treated like another man by her boss and colleagues, and feels that being in love is tiresome. However, she cannot forget about her ex-boyfriend and hopes to someday fall truly in love. Saki is prideful and determined, but fails in landing a desirable job. As a result, she starts to work at a bar as a hostess, keeping the fact a secret from her parents. Mako is the youngest of all, having attended the same high school following Emi and Saki. She is earnest and responsible, but on the other hand, rather clumsy and afraid of taking chances on a romantic relationship. The three women end up living under the same roof by coincidence, and it is there that they share each other's experiences, bitter or sweet, desperately struggling with their love life. ","torrent":{"xt":"urn:btih:b37f193b48a864faefdb23ba0a73c495f4b6a30b","amp;dn":"Watashi+ga+Renai+Dekinai+Riyuu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b37f193b48a864faefdb23ba0a73c495f4b6a30b","infoHashBuffer":{"type":"Buffer","data":[179,127,25,59,72,168,100,250,239,219,35,186,10,115,196,149,244,182,163,11]},"announce":[],"urlList":[]}}