{"title":"Black Sabbath - 1971 - Paranoid (US 1st Pressing) {Chronus} [24-","uid":7441273,"size":996594534,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b560fc88a4fd88004783f6740cffc1cdff312e18&amp;dn=Black+Sabbath+-+1971+-+Paranoid+%28US+1st+Pressing%29+%7BChronus%7D+%5B24-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"paconroll","files":23,"time":1342224985,"description":"PARANOID proved to be Black Sabbath's most focused, consistent, and successful record. Leaving behind the amorphous, extended jams of their debut for focused songs and a more structured sound, Black Sabbath virtually wrote the book on heavy metal with the ominous, unforgettable riffs, thunderous rhythms, and dark themes on this release. There are some up-tempo rockers, the famous title track for one, but for the most part PARANOID oozes along like a bad dream, as on the slinky, creepy opener, &quot;War Pigs,&quot; or the lumbering thud of &quot;Iron Man&quot; (which boasts one of the most indelible electric guitar riffs in rock history). The album's title is apt: PARANOID is filled with an edgy aggression and lyrics about war, insanity, death, and destruction. Ozzy Osbourne's flat, affectless voice merges perfectly with Tony Iommi's fuzzed-out, sledgehammer power chords and the bruising bass and drum lines to create an intense, freaky, horror-show universe. There are elements of blues-rock and psychedelia (the floating &quot;Planet Caravan,&quot; in particular), but Black Sabbath basically invents here what would become one of the most popular genres of music in the latter 20th century and beyond. Even after the millions of heavy metal albums that have followed in its wake, PARANOID stands as an all-time classic.","torrent":{"xt":"urn:btih:b560fc88a4fd88004783f6740cffc1cdff312e18","amp;dn":"Black+Sabbath+-+1971+-+Paranoid+%28US+1st+Pressing%29+%7BChronus%7D+%5B24-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b560fc88a4fd88004783f6740cffc1cdff312e18","infoHashBuffer":{"type":"Buffer","data":[181,96,252,136,164,253,136,0,71,131,246,116,12,255,193,205,255,49,46,24]},"announce":[],"urlList":[]}}