{"title":"Tove Jansson - Sculptors Daughter (Autobiogaphy) - Kindle Editio","uid":7599950,"size":202076,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b58889376756578a0586fc27071d709e70cc393b&amp;dn=Tove+Jansson+-+Sculptors+Daughter+%28Autobiogaphy%29+-+Kindle+Editio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Emgaol","files":-1,"time":1346787265,"description":"SCULPTOR'S DAUGHTER by TOVE JANSSON - Kindle Edition\n\nTranslated by \nKINGSLEY HART\n\nFirst published as Bildhuggarens Dotter 1968 \nby Holger Schildts FÃƒÂ¶rlag.\nTove Jansson 1968 - English translation Â© Ernest Benn Limited 1969\n\n510-04411-5 30s net [Â£1.50]\n\nTove Jansson, the Finnish winner of the 1966 Hans Christian Andersen Award, needs no introduction to English readers: her Moomin books have made her one of the best loved writers of children's books.\n\nIn this book for adults she writes about the enchantment of childhood, the magical world of delight and fear in which all children at some time find themselves and learn to come to terms with. Throughout the book the blend of fantasy and reality in this world is seen through the eyes of the sculptor's daughter: the mysterious darkness behind her father's sacks of plaster, the sounds of a balalaika party in his studio, the great storms that blow in from the sea, the illuminated iceberg and the stone that will make the whole family rich, are all part of the reality of the child's experience of life. From these rich \nmemories of her childhood, Tove Jansson creates a series of fascinating vignettes\n\nSculptor's Daughter is truly a book that is suitable for all ages. With great \ndelicacy she hints at the limits of the child's understanding and allows the child herself to use her own native intelligence in finding explanations for her own experiences. \n\nThese days, this book is almost impossible to get hold of and although about 50% of it was reprinted in the Winter Book this does remain as Jansson's major autobiographical work. A lot of work went into getting this PDF version up so if you do grab a copy, please seed as long as you can. I can't see this being hugely popular but the people who will want it will appreciate it I hope.\n\nIf you enjoyed this torrent please leave a comment. I am curious about how many people are interested in this plus it may motivate me to scan some of my other rarer books.\n\nEnjoy! _H*\t\t\n\nThis is a Kindle Edition of my PDF torrent at http://thepiratebay.se/torrent/5577347/Tove_Jansson_-_Sculptors_Daughter_%28Autobiogaphy%29","torrent":{"xt":"urn:btih:b58889376756578a0586fc27071d709e70cc393b","amp;dn":"Tove+Jansson+-+Sculptors+Daughter+%28Autobiogaphy%29+-+Kindle+Editio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b58889376756578a0586fc27071d709e70cc393b","infoHashBuffer":{"type":"Buffer","data":[181,136,137,55,103,86,87,138,5,134,252,39,7,29,112,158,112,204,57,59]},"announce":[],"urlList":[]}}