{"title":"Train Crisis HD v1.6 Final By bobiras2009","uid":7606180,"size":23598481,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:b63d11959e26eceb75d1afc46215bdebffe9c57c&amp;dn=Train+Crisis+HD+v1.6+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346952585,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nRequirements: Android version 2.2 and higher, supports App2SD\nOverview: A puzzle and addictive strategy game where you have to prove your reflexes.\n\n\nTrain: &quot;a series of railway carriages or wagons moved as a unit by a locomotive or by integral motors&quot;.\nCrisis: &quot;a time of intense difficulty or danger&quot;.\n\nWith these two definitions we launch Train Crisis, a puzzle and addictive strategy game with HD graphics where you have to prove your quick mind and reflexes in full 3D environment.\n\nWould you like to travel through the history of the railroad? This amazing game lets you play in two different railroad eras, where your goal is to overcome all the obstacles that appear on each level and guide each colored train toward its corresponding destination\n\nFeatures:\n\n- 2 Eras of railroad history (Industrial Era and Far West Era).\n- Spectacular High-definition 3D environments that recreate perfectly both eras with many details as vegetation, animals, mountains, rocks, tunnels, banks, etc.\n- Train Crisis provides 42 levels for players to conquer (currently available).\n- A star rating system to assess your skills.\n- Extra unlocking levels that will require you to have a certain number of stars.\n- The addictive gameplay and challenge of increasing levels of difficulty kept you hooked.\n- 4 colored trains and over 6 railway wagons.\n- You must interact with several elements to get past the level: changing junctions; timed traffic lights; trap tunnels; transportation of money; ghost trains and parts of the track obstructed with rocks you must blow up.\n- Spectacular colorful graphics effects with explosions of trains and rocks.\n- Music and 3D sound. Sound effects in real time depending on where elements are located in the screen and different music for each world.\n- Train Crisis's full version will be updated shortly with 2 new eras and many more levels available.\n- Train Crisis has been developed with Unity3D, the most optimized game engine for mobile device.\n\nWhat's in this version:\nNew in 1.6:\n- 3 new Eras\n- Star counter indicator\n- many bugs fixed\nNew in 1.5.1:\n- Download bug fixed when offline\nNew in 1.5:\n- A complete new Era with 24 new challenging levels\n- New levels for the previous Eras\n- Ability to skip some levels\n- Era online downloading\n- Bug fixes\n\n\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:b63d11959e26eceb75d1afc46215bdebffe9c57c","amp;dn":"Train+Crisis+HD+v1.6+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b63d11959e26eceb75d1afc46215bdebffe9c57c","infoHashBuffer":{"type":"Buffer","data":[182,61,17,149,158,38,236,235,117,209,175,196,98,21,189,235,255,233,197,124]},"announce":[],"urlList":[]}}