{"title":"Cyber Update Jul.2012--------DB-22695 Lorelei Lee WMV","uid":7431001,"size":573915509,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b8bb6672e5a9e73614e6337d2d2a22966d98c676&amp;dn=Cyber+Update+Jul.2012%5C--------DB-22695+Lorelei+Lee+WMV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1341943311,"description":"Lorelei Lee is Bent in Unforgiving Device Bondage\n\n \n\nJul 6, 2012 - Performers: Lorelei Lee \n\n \n\n \n\nWMV + Pics.        \n\n \n\nMP4 is here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/7419596/DeviceBondage-----DB-22695_Lorelei_Lee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/7419596/DeviceBondage-----DB-22695_Lorelei_Lee&lt;/a&gt;\n\n \n\n \n\nSweet, seductive, blonde hair and blue eyed Lorelei comes back to Device for another serving of pain and predicament bondage with a side of hard black cock in her ass.\n\n \n\nSCENE 1\n\nInnocent Lorelei wearing a pretty pink dress with nails and eyeshadow to match gets crammed into metal. Bending over, her waist is secured in a pipe box and her neck is trapped parallel to her back preventing her moving up or moving her ass out of the way. Her wrists are bound above her head in thick leather cuffs strappado style that are attached to a metal frame. Her ankles are strapped in leather and spread wide too. Completely vulnerable, there is no way for her to escape having her breasts, cunt, or ass being played with. Ripe pickings.\n\n \n\nSCENE 2\n\nHer torso is strapped to a leather bar crucifixion style. Her knees are elevated to the height of her arms, straight in front of her and are also strapped to metal. Her ass is precariously balanced on a miniature perch. Her mouth is pried open with a plumbing gag. She... is... fucked. To better illustrate to Lorelei exactly how helpless she is, Claire goes after her feet with cruel piano wire. Writhing in pain, its clear there is no escape. Amused, the last thing on Claire's mind is stopping...\n\n \n\nSCENE 3\n\nThe ultimate in a bondage lover's predicament arsenal - Lorelei is bent into a severe back arch and stuffed in the mouth and the pussy with cock that she cannot escape. The leather straps are angled and held taut with chain. Her back is pushed into the arch with pipe and her mouth pried open with a spider gag with no rite of refusal to the cock in her mouth... cumming, breathing, terrorized, more cumming...\n\n \n\nScreens\n &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=22695&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=22695&lt;/a&gt;\n\n \n\nAnd if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\n \n\nCheers  :-) \n","torrent":{"xt":"urn:btih:b8bb6672e5a9e73614e6337d2d2a22966d98c676","amp;dn":"Cyber+Update+Jul.2012%5C--------DB-22695+Lorelei+Lee+WMV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8bb6672e5a9e73614e6337d2d2a22966d98c676","infoHashBuffer":{"type":"Buffer","data":[184,187,102,114,229,169,231,54,20,230,51,125,45,42,34,150,109,152,198,118]},"announce":[],"urlList":[]}}