{"title":"Self-Esteem: A Novel (2012)","uid":7608781,"size":38343165,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b90e30f801ada494d4b57d844de033fa92d6131f&amp;dn=Self-Esteem%3A+A+Novel+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NortonDavis","files":-1,"time":1347010350,"description":"Strange and humourous tale set in the world of the self-help industry in America. A fun read that raises questions about industries that promise happiness for a price. I enjoyed it. Hope you do too!\n\n\nSelf-Esteem: A Novel (2012)\nby Preston David Bailey\n\nFORMAT: PDF and MOBI\nPAGES: 294\nLANGUAGE: English\nGENRE: Thriller, Dark Comedy, Satire\n\nDESCRIPTION: Self-Esteem, a strange tale of the meltdown of a man who has profited from telling others how to live, is both a thriller and social satire that raises disturbing questions about the effects of popular psychology on the world. Successful self-help writer Dr. James Crawford is not happy. Crawford's professional success is greater than ever but his personal life is falling apart. He has endorsed a children?s TV show based on his writings, but the cartoon-like host could be up to no less than murder. During a nasty drinking binge, Crawford struggles with his wife and son and his son?s strange mentor, a popular talk show host, a business partner tired of Crawford's aspirations, a mistress who doesn?t understand him, an emotionally distant professor, a couple of college pranksters, a successful rap artist, and an ominous tormentor -- all of whom seem to be pushing the famous guru toward emotional destruction. Self-Esteem is a dark and earthy satire on vacuous &quot;self help&quot; culture with a careening air of inevitable catastrophe. It's juicy, dirty, thought-provoking and disturbingly hilarious.\n\nWEBSITE: http://www.self-series.com/\nTRAILER:","torrent":{"xt":"urn:btih:b90e30f801ada494d4b57d844de033fa92d6131f","amp;dn":"Self-Esteem%3A+A+Novel+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b90e30f801ada494d4b57d844de033fa92d6131f","infoHashBuffer":{"type":"Buffer","data":[185,14,48,248,1,173,164,148,212,181,125,132,77,224,51,250,146,214,19,31]},"announce":[],"urlList":[]}}