{"title":"Evil.Laugh.1986","uid":7588577,"size":331361655,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ba28307581b0c0f0cf11c22df74584b718f82567&amp;dn=Evil.Laugh.1986&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Scientography","files":1,"time":1346477488,"description":"Evil Laugh 1986\n\nHorror Slasher\n\nNOTE: I did not make this rip.  It is low quality because I downloaded it from the web, however it needs to be shared cause the link is gone and the only other torrent for this movie has no seeds.  \n\nStoryline\n\nAn old orphanage has just been rebuilt after it was mysteriously burned to the ground over a decade ago following accusations of child molestation and abuse by Martin, whose own father committed suicide out of shame. Needless to say he couldn't prove his innocence, suffered a psychotic breakdown which subsequently led to him systematically slaughter the other occupants, including the kids, particularly the accusers, before perishing in the blaze that followed. Now a group of med-students are brought in by a seemingly benevolent doctor turned pediatrician, Jerry who seeks to fix the place up as less an institution more of a foster home. One of the students is set on dwelling there at this current position, while the others are set on helping them settling in. But soon they'll discover that our current owner has been secretly disposed of by an intruder, who is still lurking close by... Written by suspicous   \n\n\nMy take: The acting in this movie is lame, and the plot is old hat.  There were a few funny scenes.  It has some naked boob scenes like most 80s slashers if that makes it worthwhile.\n\nThe video file plays fine in VLC,I tested it myself. The header on the file is partially corrupted, so I couldn't get Gspot to print out a nice datasheet for this description.  \n\nREAD THIS: There is no need to say it's low quality. I admit it, and it's not my rip.","torrent":{"xt":"urn:btih:ba28307581b0c0f0cf11c22df74584b718f82567","amp;dn":"Evil.Laugh.1986","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba28307581b0c0f0cf11c22df74584b718f82567","infoHashBuffer":{"type":"Buffer","data":[186,40,48,117,129,176,192,240,207,17,194,45,247,69,132,183,24,248,37,103]},"announce":[],"urlList":[]}}