{"title":"MeguIVit 1.0.0.0 Beta-4","uid":7493393,"size":115912977,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bb6e10e2d07e1417fc44b9714ed60609937ed2e7&amp;dn=MeguIVit+1.0.0.0+Beta-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1343813774,"description":"MeguIVit 1.0.0.0 Beta-4\n\nMeguIVit is a portable, one-click version of the MeGUI encoder, preconfigured with state-of-the-art deinterlacing &amp; carefully tuned presets. Just Drag &amp; Drop your DVD-Video, Blue Ray or MKV AVI etc files and press Go! to have encoded them to HQ MKV/H.264 50/60FPS. High Quality encoding made thery easy, for everyone.\n\nCapabilities\n\n    No messy installation or configuration required, just double-click the .EXE to start.\n    Sharp, clean, and detailed video output every time.\n    Your choice of MP4 or MKV container.\n    Your choice of MP3 or AAC audio.\n    Anamorphic video output (720 pixel width) with aspect ratio signalling.\n    Chapters are created automatically and have perfect timecodes (official MeGUI builds do not).\n    Perfect aspect ratio autodetection (official MeGUI builds have 3% horizontal stretching).\n    Multithreaded deinterlacing (TempGaussMC) to take advantage of multi-core systems.\n\nSystem Requirements\n\n    Windows XP/2003 or higher\n    15-25GB or more free space for temporary files that are created during encoding.\n    An SSE3-capable multi-core CPU (the more cores the better! The deinterlacing used in meguIV is very demanding.)\n    Microsoft .NET Framework 2.0 or higher (for example .NET 3.5). You probably already have it installed.\n\nA short tutorial in RTF format is included in the torrent.\n\t\t\nInstallation:\n- Create a new folder in your home directory.\n- Extract the MeguIVit zip file into that folder, which creates a new &quot;Sandbox&quot; folder inside it.\n- Extract MeguIV in the same folder and run it (MeguIV is now transformed into MeguIVit).\n- If you use Noise Processing settings (not enabled by default) then you need the contents of the attached\n  ExtraDlls zip file too. Follow the instructions in the zip file for where to install the included DLLs.\n\nFollow the pictorial instructions in the tutorial to give it a quick try.\n\nChanges:\n- Updated the sandbox with fixes that a few of us worked out.\n- Latest avisynth plugins, which should provide some minor speed-up.\n- Update to QuickTGMC 3.33 (some minor tweaks mostly regarding how it deals with source noise).\n- Improved FPSx2 (Synthesize in-between frames) option, which allows you to force progressive 30fps\n  into 60fps (or 24fps to 48fps etc.).\n- Improved EdgeClean, which is now more delicate on fine detail. Good for older sources with strong\n  over-sharpening.\n\n___\n\nMeguIVit is based on a &quot;One-Click&quot; concept. When you drag a source into the first one-click window it\nautomatically selects settings for high quality double rate deinterlacing. It chooses the fastest settings\nthat are still considered [HQ] for your source. That means for most 60fps (or 50fps) deinterlacing jobs,\nyou can just press &quot;Go&quot; and the result will be good. You can confirm whether your settings are HQ on the\n&quot;Custom Processing&quot; tab, there is a [HQ] box that goes green when your settings are good.\n\nIMPORTANT: To rip a blu-ray, you extract the BDISO and drag one of the M2TS files from the\nBDMVSTREAM folder into MeguIVit. However, you should also check &quot;Switch Parity&quot; on the &quot;Advanced Config&quot;\ntab. I haven't yet updated the program to do that automatically.\n\nThe myriad options are for repairing bad rips or improving poor sources, particular cropping or resizing\nrequirements, ultra high quality or faster settings, adjusting threading for performance/stability and\njust general tweaking.\n","torrent":{"xt":"urn:btih:bb6e10e2d07e1417fc44b9714ed60609937ed2e7","amp;dn":"MeguIVit+1.0.0.0+Beta-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb6e10e2d07e1417fc44b9714ed60609937ed2e7","infoHashBuffer":{"type":"Buffer","data":[187,110,16,226,208,126,20,23,252,68,185,113,78,214,6,9,147,126,210,231]},"announce":[],"urlList":[]}}