{"title":"The Survivor by Sean Slater (Jacob Striker Book 1)","uid":7579954,"size":1096963,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc3e09d9233d93800e474b33180cd5248e8d5e1f&amp;dn=The+Survivor+by+Sean+Slater+%28Jacob+Striker+Book+1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"azizex666","files":-1,"time":1346210778,"description":"Columbine. Dunblane. Virginia Tech. Winnenden. But Saint Patrick's High? In his first hour back from a six-month leave of absence, Detective Jacob Striker's day quickly turns into a nightmare. He is barely on scene five minutes at his daughter's high school when he encounters an Active Shooter situation. Three men wearing hockey masks - Black, White, and Red - have stormed the school with firearms and are killing indiscriminately. Striker takes immediate action. Within minutes, two of the gunmen are dead and Striker is close to ending the violence. But the last gunman, Red Mask, does something unexpected. He runs up to his fallen comrade, racks the shotgun, and unloads five rounds into the man, obliterating his face and hands. Before Striker can react, Red Mask flees - and escapes. Against the clock, Striker investigates the killings for which there is no known motive and no known suspect. Soon his investigation takes him to darker places, and he realizes that everything at Saint Patrick's High is not as it appears. The closer he gets to the truth, the more dangerous his world becomes. Until Striker himself is in the line of fire. And the violence follows him home.\n\n\n                            Format 1 - Epub\n\n                            Format 2 - Mobi\n\n\n          **Support Your Favorite Authors By Buying Their Books**","torrent":{"xt":"urn:btih:bc3e09d9233d93800e474b33180cd5248e8d5e1f","amp;dn":"The+Survivor+by+Sean+Slater+%28Jacob+Striker+Book+1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc3e09d9233d93800e474b33180cd5248e8d5e1f","infoHashBuffer":{"type":"Buffer","data":[188,62,9,217,35,61,147,128,14,71,75,51,24,12,213,36,142,141,94,31]},"announce":[],"urlList":[]}}