{"title":"The Ed Show 8-20-12.mp4","uid":7553411,"size":177117101,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bd1cfc9aa04eece0581dd5c8589ef6f6d51053ab&amp;dn=The+Ed+Show+8-20-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1345539605,"description":"The Ed Show; August 20, 2012.\n\n78 days until the election and radical rhetoric by a Missouri lawmaker reignited the Republican war on women.\n\nMissouri Senate candidate Todd Akin said he won't quit, even though he apologized for saying women's bodies are able to prevent pregnancies in cases of what he called &quot;a legitimate rape.&quot;\n\nTerry O'Neill, President of The National Organization for Women, commented on Akin's ridiculous beliefs.\n\nThen, Sam Stein, Huffington Post Political Editor, and Joan Walsh (Salon's Editor at Large and author of &quot;What's the Matter With White People? Why We Long for a Golden Age That Never Was&quot;), looks at the political impact in Missouri and elsewhere.\n\nThe Romney camp refused to stop lying and President Obama is called them out for it.  Richard Wolffe (MSNBC Political Analyst) reviewed the president's blistering press conference.\n\nAn Ohio Republican said &quot;we shouldn't contort the voting process&quot; Nina Turner (D-OH) and Ari Berman (Contributing Writer for The Nation and Rolling Stone), had the latest on voter suppression in Ohio.\n\nAugusta National made history on (8/20/12) by offering two women membership to the golf club, but Ed thinks there are a few other women that should be offered a green jacket as well.\n\nAnd in the Big Finish, singer Hank Williams, Jr., unleashed another hateful rant against President Obama to a cheering crowd. Michael Eric Dyson (Professor of Sociology at Georgetown university and author of &quot;Can You Hear Me Now?&quot;), joined Ed for analysis and reaction.","torrent":{"xt":"urn:btih:bd1cfc9aa04eece0581dd5c8589ef6f6d51053ab","amp;dn":"The+Ed+Show+8-20-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd1cfc9aa04eece0581dd5c8589ef6f6d51053ab","infoHashBuffer":{"type":"Buffer","data":[189,28,252,154,160,78,236,224,88,29,213,200,88,158,246,246,213,16,83,171]},"announce":[],"urlList":[]}}