{"title":"Betrayed Teens - Classic XXX 1974","uid":7535201,"size":733773824,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:bfc3417b920da1914f091d4ad2d497433c0b765f&amp;dn=Betrayed+Teens+-+Classic+XXX+1974&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sampi9","files":1,"time":1345067977,"description":"Betrayed Teens - Classic XXX 1974\n\nYear: 1974\nCountry: USA\nGenre: All Sex, Drama, Whipping, Incest\nDuration: 0:57:20\nDirected by: Shaun Costello as Gerard Damiano\nStudio: Russ Carlson Productions\nStarring: Shaun Costello (as Russ Carlson), Leo Lovemore (as David Joseph), Alan Marlow, Marlene Willoughby.\n\nSCREENS:\n &lt;a href=&quot;\nhttp://backupimg.in/viewer.php?file=5202_classic.xxx.1974.betrayed_teens_s_d240.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://backupimg.in/viewer.php?file=5202_classic.xxx.1974.betrayed_teens_s_d240.jpg&lt;/a&gt;\n\nDescription: BETRAYED TEENS is another cheapie roughie helmed by the prolific Shaun Costello. Thin on storyline, heavy on sex, and a pinch of sleaze thrown in make this one a semi-enjoyable if a bit &quot;tired&quot; roughie entry.\nLinda is abducted by bikers and her mother contacts a private-dick to find her. Turns out Linda wasn't abducted at all, but was hanging out with the bikers of her own accord. When the gang realizes that the mother concocted the &quot;abduction&quot; story, they decide to go back with Linda in tow to mess with Linda's parents ...\nLots of goofiness in this one - first off, Linda is played by some French speaking hooker whose heavy accent is played off as a by-product of her going to school in France. The plot is pretty weak and only serves as the barest of threads to hold together the several sex scenes. On the good side - the hardcore scenes are pretty good and erotic, and there is a bit of extra sleaziness towards the end where the gang whips Linda's mom and forces her to give an inter-racial blowjob, and where Linda decides to go down on her pops as revenge (?!?!?). I don't know if any of Costello's films will ever reach the &quot;greatness&quot; achieved by his classics WATER POWER and FORCED ENTRY - but so far, none have come close. Even so - most of Costello's films have been entertaining and / or arousing - so I'll continue to check out his works","torrent":{"xt":"urn:btih:bfc3417b920da1914f091d4ad2d497433c0b765f","amp;dn":"Betrayed+Teens+-+Classic+XXX+1974","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfc3417b920da1914f091d4ad2d497433c0b765f","infoHashBuffer":{"type":"Buffer","data":[191,195,65,123,146,13,161,145,79,9,29,74,210,212,151,67,60,11,118,95]},"announce":[],"urlList":[]}}