{"title":"Sly Fox; Jeanine Pirro (Mobi, Epub)","uid":7507365,"size":1411004,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0154071421ab5c3f1672a76cef535583122f98b&amp;dn=Sly+Fox%3B+Jeanine+Pirro+%28Mobi%2C+Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lynnrlou","files":1,"time":1344220167,"description":"Westchester, New York, 1976--Cocaine abuse is rampant, the county courthouse is a boys' club, and men are still legally permitted to beat their wives. Enter Dani Fox, the feisty, ambitious twenty-five-year-old assistant district attorney tired of feeling like an outsider and hungry to bring abusers to justice.\n\nDani confronts emotionally challenging crime scenes and uncooperative colleagues, facing threats to her safety--and even the safety of her pet pig, Wilbur--in order to protect society's silent victims. Spearheading the country's first domestic violence unit in a shifting legal landscape, Dani must find allies where she can, especially when she discovers a seemingly simple case has some shocking twists. But who can she trust, and which of her colleagues will she end up battling both in and out of the courtroom?\n\nDrawing from her own past as a dynamic, hard-charging former district attorney, Emmy-winning Judge Jeanine Pirro's debut page-turner is ripped from the headlines, full of gripping details, authentic thrills, and suspenseful realism that can only come from a courtroom litigator who's been in the trenches.","torrent":{"xt":"urn:btih:c0154071421ab5c3f1672a76cef535583122f98b","amp;dn":"Sly+Fox%3B+Jeanine+Pirro+%28Mobi%2C+Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0154071421ab5c3f1672a76cef535583122f98b","infoHashBuffer":{"type":"Buffer","data":[192,21,64,113,66,26,181,195,241,103,42,118,206,245,53,88,49,34,249,139]},"announce":[],"urlList":[]}}