{"title":"Thomas W. Young - The Mullah's Storm","uid":7552313,"size":211060620,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c0b4529b2e98a192abdd0b06afdadc5134f9433a&amp;dn=Thomas+W.+Young+-+The+Mullah%27s+Storm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":7,"time":1345513039,"description":"At the start of Young's well-crafted first novel, a transport plane carrying a high-value prisoner, a radical mullah, is forced down in the rugged Hindu Kush of Afghanistan. Maj. Michael Parson, the plane's co-pilot, and female Master Sergeant Gold, an interpreter who speaks Pashto, must brave a ferocious winter storm and reach a nearby Special Forces team with the mullah, but they wind up in the hands of Taliban insurgents. The SF team rescues Parson, but the Taliban escape, taking the mullah and the translator in opposite directions. The team must try to recapture the mullah, but Parson can't abandon Gold because &quot;You love your comrades more than you hate your enemies.&quot; Young (The Speed of Heat: An Airlift Wing at War in Iraq and Afghanistan) draws on his own war experiences for verisimilitude, which, along with believable characters and an exciting plot, makes this one of the better thrillers to come out of the Afghan theater. \n\nThomas W. Young has logged nearly 4,000 hours as a flight engineer for the Air National Guard in Afghanistan, Iraq, Bosnia, Kosovo, and elsewhere, including Latin America, the Horn of Africa, and the Far East. Military honors include two Air Medals, three Aerial Achievement Medals, and the Air Force Combat Action Medal. He continues to serve with the Air National Guard as a Senior Master Sergeant.\n\n&quot;Though the idea for The Mullah's Storm had been knocking around in my head for a while, it took an in-flight emergency to get me started on the actual writing. In August of 2007, I was part of a crew flying a routine airlift mission into Osan Air Base, South Korea. On the way, we lost a hydraulic system and a generator. We declared an emergency and landed safely, greeted by the flashing lights of the crash trucks. When we taxied to the ramp, the aircraft dripped a trail of hydraulic fluid.\nAfter we shut down, we learned we'd be stuck for days, waiting for parts. So with time to kill at Osan, one morning I went to the Base Exchange and bought a yellow legal pad and a cup of coffee. I sat on a couch in aircrew billeting, and I wrote at the top of the pad, &quot;Chapter One.&quot;","torrent":{"xt":"urn:btih:c0b4529b2e98a192abdd0b06afdadc5134f9433a","amp;dn":"Thomas+W.+Young+-+The+Mullah%27s+Storm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0b4529b2e98a192abdd0b06afdadc5134f9433a","infoHashBuffer":{"type":"Buffer","data":[192,180,82,155,46,152,161,146,171,221,11,6,175,218,220,81,52,249,67,58]},"announce":[],"urlList":[]}}