{"title":"FUEGO 1969 Armando Bo Isabel Sarli ENGHardSub CLAN-SUD","uid":7478837,"size":734003200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c1caf01cbfd5ed824699f3fcd677abb2f428f20e&amp;dn=FUEGO+1969+Armando+Bo+Isabel+Sarli+ENGHardSub+CLAN-SUD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":15,"uploader":"etheryus","files":-1,"time":1343365312,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0062993/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0062993/&lt;/a&gt;\n\nImagine if Russ Meyer didn't seem to realize just how ridiculous his films where (and lacked talent), and you may get something close to Armando Bo. Argentina's most successful exploitation filmmaker, Bo was pretty much a hack with a secret weapon for success. His weapon was his wife, the legendary bombshell Isabel Sarli. Shes just as mind blowing as anyone of Meyer's discoveries, a beautiful and voluptuous sex symbol. What Sarli lacked in actual acting talent, she more than made up for in screen presence. Fans of natural full-bodied beauties such as Jayne Mansfield will fall in love with her.\n\nThe film &quot;Fuego&quot; is probably the most typical of their collaborations. Its hilarious camp that exists only to entertain, and it succeeds in that department quite well. The dialog, situations, and characters are ludicrously over-the-top and the garish and tawdry film making style perfectly complements it. The lack of subtlety makes Douglas Sirk look like Stanley Kubrick! Fortunately, its pretty entertaining and bizarre enough for those more accustomed to American and European sexploitation film-making. The film is hilarious and dumb beyond belief. Fortunately, it never commits the ultimate cult film sin, which is being boring. Isabel Sarli is a screen sex goddess unlike any other. Special mention must go to the cheesy score, which sounds like bad 60s lounge organ covers of spaghetti western music (love the title song which simply repeats &quot;Fuego&quot; over and over again). (6/10)","torrent":{"xt":"urn:btih:c1caf01cbfd5ed824699f3fcd677abb2f428f20e","amp;dn":"FUEGO+1969+Armando+Bo+Isabel+Sarli+ENGHardSub+CLAN-SUD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1caf01cbfd5ed824699f3fcd677abb2f428f20e","infoHashBuffer":{"type":"Buffer","data":[193,202,240,28,191,213,237,130,70,153,243,252,214,119,171,178,244,40,242,14]},"announce":[],"urlList":[]}}