{"title":"Nanami: The Inferno of First Love (Hatsukoi: Jigoku-hen, 1968)","uid":7547203,"size":4507828224,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c20d93cfb1db400041fc5cec2fe57e73e3b3c53e&amp;dn=Nanami%3A+The+Inferno+of+First+Love+%28Hatsukoi%3A+Jigoku-hen%2C+1968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"volmik","files":14,"time":1345382451,"description":"Exhibited to some recognition at the Berlin International Film Festival in 1968, Hani Susumu's Inferno of First Love, (sometimes also known as Nanami) is a brilliant, unforgettable, and sensitive film. Working from a script by playwright, and experimental filmmaker, Terayama Shuji, Hani's film captures Shun, an orphan, who falls in love with a pretty young nude model named Nanami, with his sexual inadequacies, problem childhood, and coming of age.\n\nExamining Shun, we see the reality of child molestation, with deep scars that ripple into adulthood, exposing the twin monsters of repression and inadequacy looming overhead. Shun's complex relationship with his parents, Nanami, and a young girl named Momi he befriends, eventually lead to disaster, as society closes in, so does fate. Emotionally painful as it is lyrical, Hani has crafted an amazing film that sees into the souls of this young man and woman, and is truly a record of first love.\n\nDesser said that, along with Oshima's The Man Who Left His Will On Film and Yoshida's Eros Plus Massacre, these films &quot;stand as elegies, not only to the new wave of the cinema, but to the era of the '60s in Japan.&quot;\n\n__________\n\nStolen from Gamulchet blog \n\nGamulchet, thank you.\n","torrent":{"xt":"urn:btih:c20d93cfb1db400041fc5cec2fe57e73e3b3c53e","amp;dn":"Nanami%3A+The+Inferno+of+First+Love+%28Hatsukoi%3A+Jigoku-hen%2C+1968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c20d93cfb1db400041fc5cec2fe57e73e3b3c53e","infoHashBuffer":{"type":"Buffer","data":[194,13,147,207,177,219,64,0,65,252,92,236,47,229,126,115,227,179,197,62]},"announce":[],"urlList":[]}}