{"title":"Skyrim savegame - 100% Progress","uid":7556840,"size":17098600,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c3d30d099899239231e691463ce4ad4631c78935&amp;dn=Skyrim+savegame+-+100%25+Progress&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BLAIND","files":1,"time":1345596308,"description":"This is my little beauty, a saved game with practically 100% of progress. Save from the few bugged quests that are currently in the journal, pretty much everything has been completed, there are just a few unexplored locations and a few shouts remain to be discovered. The status is the following:\n\n- Level 96, almost all perks acquired and 100 in almost every skill\n- The war is finished in favor to the Empire (changed my mind about it, but too late unfortunately)\n- Dawnguard has been completed\n- You're the Thieves' Guild leader\n- You're the leader of The Companions\n- The Blades are fully established and with a full membership\n- You're the leader of the Dark Brotherhood\n- You're the Archmage of The College of Winterhold\n- All master spells (Destruction, Illusion etc.) acquired\n- You're a Nightingale\n- Gauldur Amulet reforged\n- Practically all of the enchantments learned\n- You're a Vampire Lord (part of Dawnguard)\n- You're a Thane in every keep save for Riften and Windhelm\n- Houses are fully furnished in Riften, Markarth and Solitude, more available for purchase\n- All of the daedric quests are finished and all of their special items stored\n- All Stones of Barenziah collected and the crown repaired\n- Conjurable horse (Arvak) available\n- All Falmer tomes translated (stored on a bookshelf in Markarth)\n- End table in Solitude full of smithing materials\n- End table in Solitude full of potions\n- End table in Solitude full of ingredients\n- End table in Solitude full of scrolls\n- End table in Solitude full of Soul Gems (filled)\n- Safe in Solitude full of gems and 200k+ of gold (100k+ by now, most probably)\n- 1000+ Dragon souls (walk to almost everywhere, you might get even more)\n- Other stuff I don't remember...\n*Console commands used for bugged quests only (at least I don't remember using any others)\n\nIn order to load, place this file in My Documents&gt;My Games&gt;Skyrim&gt;Saves. Hope you had fun playing and managed more than me!","torrent":{"xt":"urn:btih:c3d30d099899239231e691463ce4ad4631c78935","amp;dn":"Skyrim+savegame+-+100%25+Progress","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3d30d099899239231e691463ce4ad4631c78935","infoHashBuffer":{"type":"Buffer","data":[195,211,13,9,152,153,35,146,49,230,145,70,60,228,173,70,49,199,137,53]},"announce":[],"urlList":[]}}