{"title":"Deploying with JRuby {BBS}","uid":7479750,"size":5106341,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c45c2683c30b859e84c87356b18925c53a9e42ed&amp;dn=Deploying+with+JRuby+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1343395860,"description":"JRuby deployments have fewer moving parts and consume less memory than traditional Ruby deployments, but to deploy your apps on the JVM, you need to learn some new approaches. This book introduces you to three JRuby deployment strategies that will give you the performance and scalability you need while letting you use the language you love.\n\nYou'll start by porting an existing application to JRuby, preparing the app to take advantage of the JVM platform. Then you'll use Vagrant and Puppet to build a virtual production environment so you have a stable, reproducible place to explore JRuby deployment.\n\nWith your environment in place, you'll experiment with simple JRuby deployment with Warbler as you package your Ruby web application into a single file you can deploy to a Java application server. Next you'll set up the lightweight Trinidad web server to create a more flexible, modular deployment that fits more complex situations but still feels friendly and familiar to Ruby developers. You'll switch to powering your app with TorqueBox, an all-in-one JRuby environment that includes built-in support for messaging, scheduling, and daemons--perfect for handling the &quot;big jobs.&quot; Then, you'll set up a continuous integration environment with Jenkins so you can deploy like the pros.\n\nDeploying with JRuby is the missing link between enjoying JRuby and using it in the real world to build high-performance, scalable applications.\n\nWhat You Need:\n\nTo run the examples in this book, you'll need a computer that can run the Java Virtual Machine.\n\n\n# Paperback: 224 pages\n# Publisher: Pragmatic Bookshelf (July 17, 2012)\n# Language: English\n# ISBN-10: 1934356972\n# ISBN-13: 978-1934356975","torrent":{"xt":"urn:btih:c45c2683c30b859e84c87356b18925c53a9e42ed","amp;dn":"Deploying+with+JRuby+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c45c2683c30b859e84c87356b18925c53a9e42ed","infoHashBuffer":{"type":"Buffer","data":[196,92,38,131,195,11,133,158,132,200,115,86,177,137,37,197,58,158,66,237]},"announce":[],"urlList":[]}}