{"title":"POtHS 3 - Bible - 89 - Judgement","uid":7593957,"size":4526995104,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c4e717149d03ff24d34ff30d14053426c30f89ae&amp;dn=POtHS+3+-+Bible+-+89+-+Judgement&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":-1,"time":1346632312,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS 3 - Bible Movies - 89 - Judgement\n\nPOtHS says: This is a great movie as it comes in 8 languages.\n\nDescription:\n\nJudgment\n2008  PG-13  105 Min.\nIt is the imminent future. The world follows one government and one man. It is a world of peace, yet some still fight the authorities.\n\nTo crush the dissent, the ruler arranges a trial of unprecedented proportion. A trial in the world court to be televised to a global audience. A trial that would see Helen Hannah, a Christian and a champion of the resistance, convicted and executed for hatred of the human race.\n\nEverything is prepared and only humiliation and death await the accused. There is only one small problem - Mitch Kendrick, the defense attorney, has been tricked into representing Hannah, and now hunts for any way out.\n\nIn a clever twist he puts not Hannah, but her leader, the real scourge of this new world, to the test. Suddenly it is the biggest trial of history with the guilt or innocence of God himself hanging in the balance.\n\nWhile appearing loyal to the new world order, Kendrick at first defends Hannah's God for his own pride. But as he listens to her, he realizes that she might be telling the truth.\n\nThreatened by a hired assassin and the world leader himself, Kendrick still fights for more answers. Memories of a misunderstood father, the love of a tortured woman, and the glare of the world all bear down, as the trial rushes to a conclusion.\n\nWithin the final verdict lay the lives of the innocent, the ruling against God, and the destiny of a lost soul.\nStars Mr. T.\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n                                          \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:c4e717149d03ff24d34ff30d14053426c30f89ae","amp;dn":"POtHS+3+-+Bible+-+89+-+Judgement","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4e717149d03ff24d34ff30d14053426c30f89ae","infoHashBuffer":{"type":"Buffer","data":[196,231,23,20,157,3,255,36,211,79,243,13,20,5,52,38,195,15,137,174]},"announce":[],"urlList":[]}}