{"title":"The Incompatibility of Science and Religion.epub","uid":7556403,"size":899231,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c524858393105c6dbabee981e521cf6309f069b2&amp;dn=The+Incompatibility+of+Science+and+Religion.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cowboy1966","files":-1,"time":1345625125,"description":"God and the Folly of Faith: The Incompatibility of Science and Religion by Victor J. Stenger\n\n\n Prometheus Books | 2012 | ISBN: 1616145994 | English | 408 pages | EPUB | 0.85 MB \n\n It has become the prevalent view among sociologists, historians, and some theistic scientists that religion and science have never been in serious conflict. Some even claim that Christianity was responsible for the development of science. In God and the Folly of Faith, physicist Victor J. Stenger shows that this conclusion flies in the face of the historical facts.\n In a sweeping historical survey that begins with ancient Greek science and proceeds through the Renaissance and Enlightenment to contemporary advances in physics and cosmology, Stenger makes a convincing case that Christianity held back the progress of science for one thousand years. It is significant, he notes, that the scientific revolution of the seventeenth century occurred only after the revolts against established ecclesiastic authorities in the Renaissance and Reformation opened up new avenues of thought.\n \nThe author goes on to detail how religion and science are fundamentally incompatible in several areas: the origin of the universe and its physical parameters, the origin of complexity, holism versus reductionism, the nature of mind and consciousness, and the source of morality.\n \nIn the end, Stenger is most troubled by the negative influence that organized religion often exerts on politics and society. He points out antiscientific attitudes embedded in popular religion that are being used to suppress scientific results on issues of global importance, such as overpopulation and environmental degradation. When religion fosters disrespect for science, it threatens the generations of humanity that will follow ours.\n \nThis thorough and hard-hitting critique is must reading for anyone interested in the interaction between religion and science.","torrent":{"xt":"urn:btih:c524858393105c6dbabee981e521cf6309f069b2","amp;dn":"The+Incompatibility+of+Science+and+Religion.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c524858393105c6dbabee981e521cf6309f069b2","infoHashBuffer":{"type":"Buffer","data":[197,36,133,131,147,16,92,109,186,190,233,129,229,33,207,99,9,240,105,178]},"announce":[],"urlList":[]}}