{"title":"Robert B. Parker - Back Story","uid":7546443,"size":121747680,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c6603764ee64e4bb0566ac053ad0666a077f2bb7&amp;dn=Robert+B.+Parker+-+Back+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nedand","files":5,"time":1345360062,"description":"Spenser's respectable 30th outing (he debuted 30 years ago in The Godwulf Manuscript) finds the veteran Boston PI teaming briefly with Jesse Stone, the cop hero of a newer Parker series (Death in Paradise, etc.). The move works because Parker plays it low-key, presenting Stone as just one of many characters who cross Spenser's path as the PI-hired by a friend of his adoptive son, Paul, for the princely sum of six Krispy Kremes-digs into the 28-year-old murder of a woman during a bank robbery; the friend is the slain woman's daughter and wants closure. Before Spenser bumps into Stone, the top cop in Paradise, Mass., he connects the killing to the daughter of big time Boston mobster Sonny Karnofsky, an old foe. When Spenser won't back off, Karnofsky threatens Spenser's girlfriend, Susan, then orders a hit on the PI. Enter as protection longtime sidekick Hawk; other series vets make appearances too on Spenser's behalf, including cops Belsen and Quirk and shooter Vinnie Morris. An interesting new character, a Jewish FBI agent, also helps out. The repartee between Spenser and Hawk is fast and funny; the sentiment between Spenser and Susan and the musings about Spenser's code are only occasionally cloying; and there's a scattering of remarkable action scenes including a tense shootout in Harvard Stadium.\n\n64kbps VBR","torrent":{"xt":"urn:btih:c6603764ee64e4bb0566ac053ad0666a077f2bb7","amp;dn":"Robert+B.+Parker+-+Back+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6603764ee64e4bb0566ac053ad0666a077f2bb7","infoHashBuffer":{"type":"Buffer","data":[198,96,55,100,238,100,228,187,5,102,172,5,58,208,102,106,7,127,43,183]},"announce":[],"urlList":[]}}