{"title":"Smart Talent Management {BBS}","uid":7562013,"size":846483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb024c38dc51efee94a1004bbe0f914f1d8fda93&amp;dn=Smart+Talent+Management+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1345764176,"description":"This book takes a fresh look at human talent in organizations, focusing on employees at all levels who represent key agents of knowledge management in acquiring, transferring, and applying important knowledge for competitive advantage.\n\nThe overarching aim of the book is to identify, define, and explore the implementation of talent management strategies aimed at facilitating effective knowledge management in an organization. The contributors provide a valuable fusion of two important areas of emphasis for current research and practice in human resource management: talent management and knowledge management. They illustrate the immense significance of the latter to competitive advantage and organizational success in our rapidly changing global knowledge-based economy. The generation and acquisition of ideas and knowledge, their internal transfer and application throughout the organization, and the cross-border transfer of knowledge - all through the effective management of human talent - have become integral to contemporary management. The contributors examine planning and staffing, training/coaching, performance management, and organizational learning and development.\n\nAcademics, human resource management practitioners and management consultants will find this volume valuable.\n\n\n# Paperback: 288 pages\n# Publisher: Edward Elgar Publishing (April 26, 2010)\n# Language: English\n# ISBN-10: 1849800715\n# ISBN-13: 978-1849800716","torrent":{"xt":"urn:btih:cb024c38dc51efee94a1004bbe0f914f1d8fda93","amp;dn":"Smart+Talent+Management+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb024c38dc51efee94a1004bbe0f914f1d8fda93","infoHashBuffer":{"type":"Buffer","data":[203,2,76,56,220,81,239,238,148,161,0,75,190,15,145,79,29,143,218,147]},"announce":[],"urlList":[]}}