{"title":"Russia's Last Tsar (uncensored)","uid":7430500,"size":4191150080,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cb83263849b8f1995e8b173243abad9cdbf7ad3a&amp;dn=Russia%27s+Last+Tsar+%28uncensored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cockymountainoyster","files":-1,"time":1341930442,"description":"Russia's Last Tsar (1997)\n\n62 min. NTSC, 48k pcm dvd iso from vhs.\n\nThis version of the censored documentary is complete with the demolition of the Church of Christ the Saviour, which has been removed in the DVD version by National Geographic.\n\nThe Orthodox Christian Church of Russia was the primary target of the Soviet government, whose leaders during Lenin's days were in their majority Jews who suffered under the Tsarist regime. Early legislation banned all influences of the church on education and public life. During the Civil War hundreds of thousands of clergymen were murdered. Despite repeated attempts by church leaders to prove their loyalty to the state, churches were closed in the thousands, their assets were seized, and clergy and the faithful were violently persecuted. By 1933, only a hundred churches in Moscow were operational (compared to 600 in 1917), and by 1939 around 98% of all churches in Russia were confiscated, destroyed or closed.\n\nFollowing the 1941 invasion of the Soviet Union by Germany, and Hitler's attempt to win over Christians in Ukraine and Russia, Stalin relaxed active persecution of the Russian Orthodox Church until the end of World War II. Active persecution continued under Khrushchev and until the fall of Communism in the 1990s. It is estimated that fourty million Orthodox Christians perished under Lenin and Stalin.\n\nMay their memory be eternal.\n\nVladislav Mikosha (1909-2004) filmed the destruction. Stalin planned to build &quot;the palace of the soviets&quot; on top of the Cathedral, and an international competition was held for the final design of this monstrosity which was to house the tomb of lenin. The chosen design was 4 1/2 times the height of the Statue of Liberty, but the construction was interrupted due to a lack of funds, problems with flooding from the nearby Moskva River, and the outbreak of war. The flooded foundation hole remained on the site until, under Nikita Khrushchev, it was transformed into a huge public swimming pool, the largest the world has ever seen. Stalin's #2 man, ruthless bureaucrat Lazar Moyseyevich Kaganovich (a khazar jew) carried out the demolition of the Church with dynamite in 1931.\n","torrent":{"xt":"urn:btih:cb83263849b8f1995e8b173243abad9cdbf7ad3a","amp;dn":"Russia%27s+Last+Tsar+%28uncensored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb83263849b8f1995e8b173243abad9cdbf7ad3a","infoHashBuffer":{"type":"Buffer","data":[203,131,38,56,73,184,241,153,94,139,23,50,67,171,173,156,219,247,173,58]},"announce":[],"urlList":[]}}