{"title":"BRAVE MPEG2.TS 2012 PORsub - GLOBE.TS","uid":7577727,"size":1038472798,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cd31b0442b191aaa20064fa105c6a10f68d55ef1&amp;dn=BRAVE+MPEG2.TS+2012+PORsub+-+GLOBE.TS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1346159572,"description":"* MPEG2-TS  * 01H24M38S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n* PORTUGUESE SUBTITLES \n\n\n* FILE INFO :\n\n\n- ASPECT RATIO CORRECTED ! (the original cam file had a slight inclination at the bottom of the screen)\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Plot :\n\nIn Scotland, King Fergus of Clan DunBroch presents his young daughter Merida with a bow for her birthday. While practicing with the bow, Merida briefly encounters a will-o'-the-wisp as a giant demon bear named Mor'du attacks the family. Merida escapes along with her mother Queen Elinor while Fergus fights off the bear alongside his men at the cost of his left leg. Years later, Elinor has since given birth to identical triplet boys, and Merida has become a free-spirited and adventurous teenager. One night, her mother informs her she is to be betrothed to one of her father's allied clans: Dingwall, Macintosh, or MacGuffin. Despite her mother's attempts to explain the necessity of the marriage her by telling her a legend of a power-hungry prince who broke off from his duty and caused the ruin of a kingdom, Merida is dissatisfied with the arranged marriage.\n\nThe clans arrive with their first-born sons to compete in the Highland Games for Merida's hand, and the princess chooses archery as the main event. During the competition, Lord Dingwall's son wins by accident. Entering the competition, Merida says that as the first-born of Clan DunBroch she is eligible to compete for her own hand, and later has a falling-out with Elinor. When Merida destroys a tapestry depicting her family and Elinor burns her bow, Merida flees to the forest. While there, the Will O' The Wisps lead her to the hut of an elderly witch who insists she is a wood carver. After some bargaining, the witch agrees to give Merida a spell, in the form of a cake, to change her mother.\n\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012\t\t","torrent":{"xt":"urn:btih:cd31b0442b191aaa20064fa105c6a10f68d55ef1","amp;dn":"BRAVE+MPEG2.TS+2012+PORsub+-+GLOBE.TS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd31b0442b191aaa20064fa105c6a10f68d55ef1","infoHashBuffer":{"type":"Buffer","data":[205,49,176,68,43,25,26,170,32,6,79,161,5,198,161,15,104,213,94,241]},"announce":[],"urlList":[]}}