{"title":"File Synchronization 1.6.3","uid":7445064,"size":4751750,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:cdbf7adf65db1b204cb34c2fbeccff07d5af328d&amp;dn=File+Synchronization+1.6.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"openarena","files":-1,"time":1342343957,"description":"File Synchronization is a utility that has the ability to synchronize multiple pairs of folders or files. It has been designed to be easy to use and quick to do the job.\n\nIt was based originally on the File Synchronization tool provided by Apple with the old Mac OS, but has a few improvements and features to help get the job done quickly and efficiently.\n\nFile Synchronization synchronizes multiple pairs of folders or files. It has been designed to be easy to use: choose 2 folders to synchronize then click the Synchronize button and you're done! However, there are multiple options when your needs get a little more complicated. The interface is easy to use and the application is quick to do any synchronization that you might need.\n\n\nWhat's New\nVersion 1.6.3:\n\nAdded &quot;Show Growl Notifications&quot; checkbox to Interface preferences. By default, it is off so no notifications will appear unless you explicitly turn it on, even if you have Growl installed\nReplaced the dialog sheet that was causing the application's icon to jump in the dock if the synchronization was performed while the application was in the background. Now, the view showing the progress is always visible, even when the app is in the background and doesn't cause any icon jumping\nFixed a problem where the application would not find the proper destination to sync with some volumes. The application would report that all the files in one of the folder were missing but would fail to copy them because it was trying to copy them to a non-existing destination\nSwitched to more modern functions to copy items, insuring greater reliability and better error reporting\nEnhanced the filtering so that filters based on name will filter out any folder that satisfies the filter, reducing the time for the analysis for modified items\nFixed a problem where the log would not be created if the application would crash before the end of the synchronization. Now, the log is created and the sync operations are written immediately to it. In the event that the application crashes, the log will still contain valuable information\nFixed a problem with the Chinese localization where the application would crash as soon as a synchronization was performed\nRemoved the &quot;Log extra debugging info&quot; from the Log preferences. Now, all the logs contain all the information needed to troubleshoot a problem\nCorrected a few incorrect URLs\nAdded the ability to change the deletion of an orphaned file in the preview window so that it will be copied instead of being deleted.\nAdded a &quot;Report a Bug&quot; that links to our new website to report problems. Please, use it if you think you discovered a bug\nAdded a &quot;Show Frequently Asked Questions&quot; menu item to the Help menu\n\nRequirements\nPPC / Intel, Mac OS X 10.5 or later ","torrent":{"xt":"urn:btih:cdbf7adf65db1b204cb34c2fbeccff07d5af328d","amp;dn":"File+Synchronization+1.6.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdbf7adf65db1b204cb34c2fbeccff07d5af328d","infoHashBuffer":{"type":"Buffer","data":[205,191,122,223,101,219,27,32,76,179,76,47,190,204,255,7,213,175,50,141]},"announce":[],"urlList":[]}}