{"title":"Boom 1.5","uid":7485090,"size":9253750,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:ce0d3777aa1e8ffc7e4e1573005138ea6760d361&amp;dn=Boom+1.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"openarena","files":-1,"time":1343558106,"description":"Description\n\nMusic, movies, online videos, Skype calls on your Mac can be heard more louder, more better!\n\nYou must have experienced any or all of the following:\n- The volume is low while listening to music on your iPhone/iPod touch\n- The volume on your laptop is not loud enough\n- There should have been a system-wide Equalizer\n- The volume could have been a little louder while watching a video/movie on your iPad\n\nBoom volume booster is the first-of-its-kind app for Mac! Boost volume of your music and video files so they sound better on your iPhone, iPod touch and iPad.\n\nBoom provides the ability to boost the volume of your music and video files residing in the iTunes library of your Mac and on the disk. It lets you enjoy the new boosted experience on your iPhone, iPod touch or iPad through a seamless transfer by creating a separate playlist\n\nMore option: Boost the volume of your Mac and a system-wide Equalizer. Do you think the volume on your laptop is not loud enough? Or do you think, there should have been a system-wide Equalizing control? As an additional free option, you can download and install the driver for Boom to enjoy enhanced volume in your favorite:\n\n- Media-playing applications such as iTunes and QuickTime\n- Online music and video playing sites such as YouTube, Vimeo and others\n- Netflix, Hulu or cool TV shows\n- Voice applications such as FaceTime, iChat, Skype and more\n- Games, Podcasts and radio channels\n- A system-wide Equalizer\n\nWhat's New in Version 1.5\n\nFully compatible with the OS X 10.8.\nSupport for Notification Center.\n\nRequirements: OS X 10.6.6 or later","torrent":{"xt":"urn:btih:ce0d3777aa1e8ffc7e4e1573005138ea6760d361","amp;dn":"Boom+1.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce0d3777aa1e8ffc7e4e1573005138ea6760d361","infoHashBuffer":{"type":"Buffer","data":[206,13,55,119,170,30,143,252,126,78,21,115,0,81,56,234,103,96,211,97]},"announce":[],"urlList":[]}}