{"title":"PhotoStyler 6.4","uid":7448650,"size":34372753,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:cf0115eff0cfbf31dcbd1f1fc85f3e3b7859b307&amp;dn=PhotoStyler+6.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"openarena","files":-1,"time":1342446269,"description":"PhotoStyler is the easiest way to style your digital photos with your Mac. This simple, fast and accurate native solution combines the powers of Apple's core technologies with the flexibility and efficiency of proprietary application-specific modules. PhotoStyler supports all image formats that are supported by MacOS including RAW images.\n\nPhotoStyler doesn't require any special skills or knowledge. Need a sepia? Drop the &quot;Monochrome&quot; filter to the chain and check the &quot;Sepia&quot; checkbox. Want some scratches on the photo to make it look old? Drop the &quot;Scratches&quot; filter to the chain. Need a glow, an annotation, shadows, 3D-look with perspective? Well, you know what to do... You can combine any number of filters and save the chain as a preset. A built-in presets library contains prepared styles so you can preview and adjust your photo variations in seconds.\n\nFeatures:\nLomo, polaroid, cross-processing, sepia, black &amp; white, scratches and ragged corners - Everything is made with incredible speed and simplicity.\nA Presets library gives you an easy way to re-use interesting filter combinations. Tens of pre-built presets give you a good starting point and endless photo styling possibilities.\nFraming tools are simple yet powerful: you can apply color, textured, glass, matte and vignette.\nChoose a part of the image to apply the filter to: the new masking tool allows you to adjust the filter area and power with great accuracy.\nJust one click to apply auto-levels or auto-contrast, unsharp mask and noise reduction.","torrent":{"xt":"urn:btih:cf0115eff0cfbf31dcbd1f1fc85f3e3b7859b307","amp;dn":"PhotoStyler+6.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf0115eff0cfbf31dcbd1f1fc85f3e3b7859b307","infoHashBuffer":{"type":"Buffer","data":[207,1,21,239,240,207,191,49,220,189,31,31,200,95,62,59,120,89,179,7]},"announce":[],"urlList":[]}}