{"title":"Marley and Me - John Grogan (Unab) [128]","uid":7534724,"size":570392920,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cf33f678c9857d5aaa1af95e285b44a2f5937180&amp;dn=Marley+and+Me+-+John+Grogan+%28Unab%29+%5B128%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rambam1776","files":-1,"time":1345057649,"description":"Recorded Books LLC - Read by Johnny Heller\n\n128 CBR Unabridged\n\nThe heartwarming and unforgettable story of a family in the making and the\nwondrously neurotic dog who taught them what really matters in life\n\nJohn and Jenny were just beginning their life together. They were young and in love, with a perfect little house and not a care in the world. Then they brought home Marley, a wiggly yellow furball of a puppy. Life would never be the same.\n\nMarley quickly grew into a barreling, ninety-seven-pound streamroller of a Labrador retriever, a dog like no other. He crashed through screen doors, gouged through drywall, flung drool on guests, stole women's undergarments, and ate nearly everything he could get his mouth around, including couches and fine jewelry. Obedience school did no good Marley was expelled. Neither did the tranquilizers the veterinarian prescribed for him with the admonishment, &quot;Don't hesitate to use these.&quot;\n\nAnd yet Marley's heart was pure. Just as he joyfully refused any limits on his behavior, his love and loyalty were boundless, too. Marley shared the couple's joy at their first pregnancy, and their heartbreak over the miscarriage. He was there when babies finally arrived and when the screams of a seventeen-year-old stabbing victim pierced the night. Marley shut down a public beach and managed to land a role in a feature-length movie, always winning hearts as he made a mess of things. Through it all, he remained steadfast, a model of devotion, even when his family was at its wit's end. Unconditional love, they would learn, comes in many forms.\n\nIs it possible for humans to discover the key to happiness through a bigger-than-life, bad-boy dog? Just ask the Grogans.","torrent":{"xt":"urn:btih:cf33f678c9857d5aaa1af95e285b44a2f5937180","amp;dn":"Marley+and+Me+-+John+Grogan+%28Unab%29+%5B128%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf33f678c9857d5aaa1af95e285b44a2f5937180","infoHashBuffer":{"type":"Buffer","data":[207,51,246,120,201,133,125,90,170,26,249,94,40,91,68,162,245,147,113,128]},"announce":[],"urlList":[]}}