{"title":"HISTORY OF POP AND ROCK MUSIC - part 403","uid":7593595,"size":628623626,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cf87441555146a0f8639b9a918840470fd8d06e4&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+403&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1346623589,"description":"              \n                       PART  403\n\n\n\n               PAUL ANKA  - Diana  (1957)\n               CRAIG DOUGLAS  -  Only Sixteen  (1959)\n               PAUL ANKA  -  It's Time To Cry  (1959)\n               PAUL ANKA  - Put Your Head On My Shoulder (1959)\n               FRANKIE AVALON  -  Venus (1959)\n\n\n\n            &quot;Diana&quot; is a song written and made famous by Paul Anka in 1957, reportedly inspired by a high school friend of Anka's named Diana Ayoub.The original Paul Anka 1957 recording reached number one on the Billboard &quot;Best Sellers In Stores&quot; chart and has reportedly sold over 9 million copies. &quot;Diana&quot; also hit number one on the \nR&amp;B Best Sellers list chart\n            Craig Douglas is an English pop singer, who was popular in the late 1950s and early 1960s. His sole UK chart-topper, &quot;Only Sixteen&quot; (1959), sold more copies in the UK than Sam Cooke's original version. It was recorded at EMI's Abbey Road studios, with whistling by Mike Sammes, and released through Top Rank records.\n           &quot;It's Time To Cry&quot; is a song written by Canadian singer-songwriter Paul Anka. Anka's version was released as a single by ABC-Paramount in 1959. It was arranged and conducted by Don Costa  &quot; It's Time To Cry&quot;  became very successful, reaching number 4 on the Billboard Hot 100.\n           &quot;Put Your Head on My Shoulder&quot; is a song written by Paul Anka. &quot;Put Your Head on My Shoulder&quot; was very successful, reaching number 2 on the Billboard Hot 100. The B-side was &quot;Don't Ever Leave Me&quot;.The song was repopularized when released as a single by The Lettermen in 1968. This version peaked just outside the top forty of the Hot 100, but continued their streak of top forty adult contemporary hits.\n             &quot;Venus&quot; is the name of a song written by Ed Marshall and Peter DeAngelis. The most successful and well-known recording of it was done by Frankie Avalon and released in 1959 . It became Avalon's first number-one hit on the Billboard Hot 100 chart, where it spent five weeks atop the survey. The song also reached number ten on the R&amp;B chart. The song's lyrics detail a man's plea to Venus, the Roman goddess of love and beauty, to send him a girl to love and one who will love him as well.","torrent":{"xt":"urn:btih:cf87441555146a0f8639b9a918840470fd8d06e4","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+403","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf87441555146a0f8639b9a918840470fd8d06e4","infoHashBuffer":{"type":"Buffer","data":[207,135,68,21,85,20,106,15,134,57,185,169,24,132,4,112,253,141,6,228]},"announce":[],"urlList":[]}}