{"title":"Fling! v1.1.1 Final By bobiras2009","uid":7596837,"size":22210580,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:cfdb114b8f3f76402d93e95da42a4a8700706d4f&amp;dn=Fling%21+v1.1.1+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346716485,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nA #1 selling app in Apple's AppStore, with over a million paid sales, Fling! is now finally available on Android - and we've made this Android version even better than the iphone version!\nFling! is an addictive puzzle-game based a simple, unique concept, which while simple is at the same time infinitely challenging. Ideal for all ages.\n\nFeaturing over 100,000 unique puzzles, such that no two puzzles you encounter are ever the same, and split into 35 levels of gradually increasing difficulty, Fling guarantees you many long hours of puzzling fun!\n\nEach puzzle has a single, unique solution, and is solved by simply flinging (pushing) the furballs, and watching them bump each other off the edge of the screen, until only one is left.\n\nFOUR GAME MODES :\n\n    FREE-PLAY mode - play at your own pace, while the game tracks your stats and keeps track of all puzzles solved/failed, allowing you to browse your entire puzzle-solving history and go back to any previously solved/unsolved puzzle to attempt to (re-)solve it! \n    ARCADE mode - race against the clock, solving as many puzzles of ever-increasing difficulty as you can before your time runs out! \n    CHALLENGE mode - solve sets of puzzles within a given amount of time to progress, while trying to beat your personal best times for each level! \n    FRENZY mode - the all new survival mode - keep the board from filling up by flinging same-colored balls off the board! \n\nFeatures :\n\n    HINTs and UNDOs are provided to help you solve the puzzles when stuck \n    Game music, which automatically switches itself off at start when playing other music on your iPod/iPhone \n    Local+Global high-scores lists - compete against the millions of Fling! for iPhone (and now Android) players \n    Automatic saving of games - always come back to the game right where you left it! \n    Themes - get an overdose of cuteness from staring at the furballs for hours? Try playing with the marbles or fruits or any of the four other themes instead! \n    Simple tutorial - you'll be solving your first Fling! puzzles within seconds of downloading! \n    Multiple language support - english, french, italian, german, spanish, japanese, chinese \n    Gameplay + instructions video on youtube -or just search for Fling iphone \n\nWhat's in this version: (Updated : Aug 28, 2012)\n\n    Fixed freezes and other issues that happen on Android 4.1 devices\n\nRequired Android O/S : 1.6+\n\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:cfdb114b8f3f76402d93e95da42a4a8700706d4f","amp;dn":"Fling%21+v1.1.1+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfdb114b8f3f76402d93e95da42a4a8700706d4f","infoHashBuffer":{"type":"Buffer","data":[207,219,17,75,143,63,118,64,45,147,233,93,164,42,74,135,0,112,109,79]},"announce":[],"urlList":[]}}