{"title":"Glow Draw Pro v1.0 By bobiras2009","uid":7599229,"size":334135,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:d2cfa63cfc00c1c90c301c314fea172cbc8c5b3a&amp;dn=Glow+Draw+Pro+v1.0+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346768593,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nRequirements: Android 2.1+\nOverview: It is so easy to draw something interesting using this app with a pretty nice glowing effect.\nFeel like Picasso! Paint and draw something impressive!\n\n\nIt is so easy to draw something interesting using this app with a pretty nice glowing effect.\nFeel like Picasso! Paint and draw something impressive!\n***\nShort Feature List:\n* Choose any brush color you like\n* Adjust size of the brush\n* Select any background color you wish\n* 5 undo actions (and also 5 redo actions)\n* Paint on your photos\n* Optimized for tablets - you can doodle not only on phone\n* Supports MULTITOUCH - you can draw with 3, 4 or 5 fingers at the same time (it's especially funny on tablets)\n* Save your paintings on SD card and resume drawing later\n* Share your masterpieces via MMS, social networks and other apps\n***\nMake beautiful glowing art on your touch screen with this app.\nAs you paint your greatest art, the art glows in the dark. It is wonderful!\n***\nThis drawing app is very functional. You can create a masterpice or just doodle text.\nYou can clear the screen, change brush color and background color, undo your recent actions.\n***\nIt is especially nice on tablet. Turn your tablet into sketcher tab and drawing pad.\nMultitouch allows you to use almost all your fingers to draw glowing art at the same time.\n***\nDraw and share your masterpices via MMS, social networks (facebook, twitter) and other applications.\nAlso you can just save your sketch on SD card.\nAnd you can load any image to canvas.\n***\nIt helps to create memorable art both for kids and adults.\nKids love to doodle. Painters can draw something complicated.\n***\nAdditional Keywords: sketch, painting, photo, paint joy, picture, finger paint, free sketch, sketch pad\n\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:d2cfa63cfc00c1c90c301c314fea172cbc8c5b3a","amp;dn":"Glow+Draw+Pro+v1.0+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2cfa63cfc00c1c90c301c314fea172cbc8c5b3a","infoHashBuffer":{"type":"Buffer","data":[210,207,166,60,252,0,193,201,12,48,28,49,79,234,23,44,188,140,91,58]},"announce":[],"urlList":[]}}