{"title":"Devicebondage---------DB-23729 Penny Pax","uid":7542312,"size":2485584907,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d32aec39e55e931f5c5d3e3e7b67400d17146126&amp;dn=Devicebondage---------DB-23729+Penny+Pax&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":-1,"time":1345247850,"description":"\nBlonde Cunt Penny Pax Subjected to Brutal Bondage\n\n\nAug 17, 2012 - Performers: Penny Pax \n\n\n\n\nWmv and Mp4 + Pics\n\n\n\n\nPenny is a special girl. Girl next door appearance, amazing curvy body, huge natural tits, blonde hair and blue eyes, and entirely unassuming personality... until you get this bitch in bondage and start manipulating her to your whim. In the first scene, Penny starts with her legs bound to a pole with leather straps and her arms bound strappado style up a metal pole. Her pain tolerances are immediately tested - to the limit. Claire puts as many nipple clamps as she can find on Penny's sensitive breasts and then adds an astounding amount of weight. Penny takes it like a champ. Upping the ante, Claire takes Penny and folds her over the metal her thighs are attached to, pulling her arms strict, taut, and far from her body. In scene two penny is in a v shaped hogtie predicament. Her forward momentum pushes her onto a metal bar gag and her tits are bound tightly holding up her torso. Claire's interested in her tiny soft feet. Taking advantage of the position, we get to see just how much can be stuffed into her slut holes. In the final scene, Penny is inverted on the ladder. Her tits are tied with leather and greased up to a perfect shine. Claire decorates Penny's body with clothespins, layers it with pain, shows her affection with pushing Penny further down the cum rabbit hole.\n\n\n\nScreens &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=23729&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=23729&lt;/a&gt;\n\n \n\nAnd if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\n \n\nCheers  :-) \n","torrent":{"xt":"urn:btih:d32aec39e55e931f5c5d3e3e7b67400d17146126","amp;dn":"Devicebondage---------DB-23729+Penny+Pax","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d32aec39e55e931f5c5d3e3e7b67400d17146126","infoHashBuffer":{"type":"Buffer","data":[211,42,236,57,229,94,147,31,92,93,62,62,123,103,64,13,23,20,97,38]},"announce":[],"urlList":[]}}