{"title":"Sexually Broken---Firsttime bondage skull fucking  Destiny Jayme","uid":7536413,"size":1018844100,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d45e873f5ff306eadbb1ed40c58c5bd16a9f733a&amp;dn=Sexually+Broken---Firsttime+bondage+skull+fucking++Destiny+Jayme&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1345103531,"description":"\nFirst time for bondage pro at skull fucking | Destiny Jaymes | Matt Williams\n\nAugust 15, 2012 \n\n\nMP4 and WMV + Pics  \n\n\nWelcome Destiny Jaymes to Sexually Broken. This is Destiny's first time in bondage anywhere. What to do with a sexy, tan, blond, former gymnast, what to do?\n\nDressed in her tight shorts and top, we toss her a ball gag and make her put it on. Next we have her take off her shirt exposing her perfect natural breasts. The ball gag is loose so we tighten it, and bind her elbows tightly together. She is helpless for the first time in her life. \n\nShe tries to escape, and finds it impossible. Destiny is overloaded with endorphins, and in the first few seconds that the vibrator hits her pussy, she squirts and cums. Still loopy from the orgasm, we knock her to her knees and skull fuck the hell out of our first time bondage girl next door.\n\nThis might be the first time Destiny has every been in bondage but, not the first time a cock has been jammed down her throat. This girl can suck cock and takes a devastating throat pounding. Helpless to stop the deep throat fucking, Destiny has no choice but to open her throat and take it as long as we want to give it. \n\nDestiny's brain is now in full sub space, from the orgasm and face fucking. We bind her to a beam, and tie her leg up into a full front split. Her shaved wet pussy is begging for attention, her neck bound tightly to the pole. We make Destiny cum over and over. Her brain broken with endorphins, she can only suffer in the brutal bondage... \n\nSexually Broken, is the perfect mix of rope bondage, and sex. Inescapable bondage and rough sex, the best bondage and sex site on the net today. \n &lt;a href=&quot;\nHttp://www.sexuallybroken.com/sexual/bondage/2012/08_15destiny/SexuallyBroken-Destiny-Jaymes-Matt-Williams-First-time-for-bondage-pro-at-skull-fucking.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nHttp://www.sexuallybroken.com/sexual/bondage/2012/08_15destiny/SexuallyBroken-Destiny-Jaymes-Matt-Williams-First-time-for-bondage-pro-at-skull-fucking.php&lt;/a&gt;\n\nAnd if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\nCheers  :-) \n\n \n\n","torrent":{"xt":"urn:btih:d45e873f5ff306eadbb1ed40c58c5bd16a9f733a","amp;dn":"Sexually+Broken---Firsttime+bondage+skull+fucking++Destiny+Jayme","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d45e873f5ff306eadbb1ed40c58c5bd16a9f733a","infoHashBuffer":{"type":"Buffer","data":[212,94,135,63,95,243,6,234,219,177,237,64,197,140,91,209,106,159,115,58]},"announce":[],"urlList":[]}}