{"title":"The Golden Apple - Original B'way Cast (1954)","uid":7465518,"size":538658338,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d5f9424903b2aa976c4ea3b94a4770afa41a9f5f&amp;dn=The+Golden+Apple+-+Original+B%27way+Cast+%281954%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"guidoanselmi","files":-1,"time":1342983576,"description":"One of the most original shows of its era (or ever), &quot;The Golden Apple&quot; was a hit off-Broadway in 1954 but died a quick death when it transfered to Broadway. Not one but two original cast albums were made (one on Elektra off Broadway, one on RCA as a &quot;Broadway production&quot;) with the same cast. Featuring a wonderful score by Jerome Moross (who'd soon be writing &quot;The Big Country&quot; and other film scores), lyrics by poet John Latouche and dazzling orchestrations by Hershey Kay, the musical reset the epic story of &quot;The Iliad&quot; and &quot;The Odyssey&quot; in the Pacific Northwest at the turn of the century. Conceived as a folk operetta, the entire show was sung and the cast recording, limited to one disc, preserved only 50 minutes of the score. The recording was a much-sought-after collector's item for decades, until finally reissued on CD in the early 2000s. One number, &quot;Lazy Afternoon,&quot; became a standard and has been recorded by numerous artists, but the entire score is a delight. Of the original stars, Kaye Ballard would go on to a major theater and cabaret career and Stephen Douglass next played Joe opposite Gwen Verdon in the original cast of &quot;Damn Yankees.&quot; Perhaps one day a full recording of the show will happen - as happened with Sondheim's originally truncated &quot;Follies.&quot; Until then, we can be thankful for this recording, especially Ms. Ballard's original version of the spell-binding &quot;Lazy Afternoon.&quot;\n\nTo bridge awkward transitions caused by cuts to the score, the recording inserted a narrator reciting rhymed couplets to fill the story gaps. In order to remove annoying clicks and breaks between digital files, I have merged all tracks into a continously playing file, which is the how the show was meant to be heard. \n\nMono sound - lossless WAV file. \n","torrent":{"xt":"urn:btih:d5f9424903b2aa976c4ea3b94a4770afa41a9f5f","amp;dn":"The+Golden+Apple+-+Original+B%27way+Cast+%281954%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5f9424903b2aa976c4ea3b94a4770afa41a9f5f","infoHashBuffer":{"type":"Buffer","data":[213,249,66,73,3,178,170,151,108,78,163,185,74,71,112,175,164,26,159,95]},"announce":[],"urlList":[]}}