{"title":"POtHS - Prophetic Times - 80 - Mystery Babylon Vol 5","uid":7571922,"size":4215802055,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d6032063496ee58f517da5d5ac477defc7bb589f&amp;dn=POtHS+-+Prophetic+Times+-+80+-+Mystery+Babylon+Vol+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":-1,"time":1346012266,"description":"\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Prophetic Times - 71 - Mystery Babylon -  Vol 4\n\n &lt;a href=&quot;\nhttp://babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://babylonthegreatisfalling.net&lt;/a&gt;\n\n\n\n\nPOtHS Comments on This one: This is &quot;Spirit World Stuff&quot; That few will understand.\n\nThis download contains the following presentations:\nFreeman Perspective with Eric Jon Phelps: &lt;a href=&quot;\nhttp://freemantv.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freemantv.com/&lt;/a&gt; &quot;The Agenda&quot; is one term for the &quot;new world order&quot; used by the insiders / globalists -- the ILLUMINISTS, also called the ILLUMINATI. Ultimately, the &quot;Agenda&quot; is: to move the Papacy to Jerusalem, and this has been the primary design for 1600 years, only overshadowed by the objective to wipe out the entire nation of Israel from the Earth.\n\n\nProphecy Club NWO Mind Control speaker Al Neal:\nAl Neal exposes the Satanic Occult's Agenda of the NWO and how they use various mind control techniques in the controlled media and subliminal advertising.\n\n\nElite Serial Killers of Lincoln JFK RFK &amp; MLK by Robert Gaylon Ross Sr.:\nFinally the truth is presented about the assassinations of President Abraham Lincoln, President John F. Kennedy, Senator/Attorney General Robert F. Kennedy, and Reverend Martin Luther King, Jr. This book tells who the real shooters were, where they were when they fired their shots, who organized these events, the motivations behind these killings, and who wrote the checks to pay the killers. It also provides the minutes of U. S. Senate hearing where U.S. Government officials were exposed as they committed terrible acts against U.S. citizens.\n\n\nThe End is Near by David Lankford:\nPastor Lankford on Obamacare as Mark of the Beast; Prepping[Self-Reliance] as Common/&quot;Horse&quot; Sense (Stable Thinking) ;-D and The Sins of Sodom.\nSteve Quayle's favorite preacher--Homespun Scriptural-based Wisdom. Very Refreshing.\n\n\nBible Symbols, The Crown of Thorns and the Defeat of the Antichrist by Mike Hoggard:\nThe first time Pastor Mike Hoggard ever saw the movie, The Omen, he was amazed at the occult and biblical symbolism embedded in the film, including the name given for the Antichrist. In this latest video from Pastor Mike, he reveals the secrets behind the Masonic symbol of the acacia tree and the construction of the wilderness tabernacle, including the symbolism of the crown of thorns on the head of Jesus Christ. This teaching reveals from the scriptures why many major denominations, ministries, well-known Christian leaders, and churches are moving rapidly toward the great falling away.\n\n\n           \n:thankyou:  :thankyou:   Thank You JESUS\n","torrent":{"xt":"urn:btih:d6032063496ee58f517da5d5ac477defc7bb589f","amp;dn":"POtHS+-+Prophetic+Times+-+80+-+Mystery+Babylon+Vol+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6032063496ee58f517da5d5ac477defc7bb589f","infoHashBuffer":{"type":"Buffer","data":[214,3,32,99,73,110,229,143,81,125,165,213,172,71,125,239,199,187,88,159]},"announce":[],"urlList":[]}}