{"title":"POtHS - Prophetic Times - 85 - Ancient Apocalypse - History Repe","uid":7609783,"size":4291508603,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d6e832552e020c5763d05e49bf4be3d1eb6d00f9&amp;dn=POtHS+-+Prophetic+Times+-+85+-+Ancient+Apocalypse+-+History+Repe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":-1,"time":1347033536,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Prophetic Times - 84 - Ancient Apocalypse - History Repeats\n\n\n\nPOtHS Comments on This one:Very Good.\nAncient Apocalypse Death on the Nile:\nThroughout the ages, civilisations have risen up and then disappeared. Traditionally, the disappearance of certain ancient civilizations has been left to the theologians and historians to explain. Now scientists have entered the fray. In this series geologists, archaeologists and climatologists explain their findings. Ancient Apocalypse seeks to explain how human achievements were destroyed by the forces of nature.\n\nEp 01: Death on the Nile:\nSeries using science to solve riddles of the ancient past. Prof Fekri Hassan attempts to determine why the Egyptian Old Kingdom, the civilisation of the great pyramids, collapsed around 2200 BC. Can science show that terrible forces of nature were to blame? Clues come from the deserts of southern Egypt, the glaciers of Iceland and a find in the Nile delta.\n\nEp 02: Mystery of the Minoans:\nSeries using science to solve riddles of the ancient past. Examining the Minoan civilisation, situated on the Mediterranean island of Crete, and how it was wiped out 3,500 years ago. The culprit was one of the biggest volcanic eruptions since the Ice Age on the nearby island of Thira.\n\nEp 03: The Maya Collapse:\nSeries using science to solve riddles of the ancient past. This programme unravels the reasons behind the disappearance of the Mayan civilisation in Central America and southern Mexico. Millions died and great cities were abandoned as people moved into the jungle.\n\nEp 04: Sodom and Gomorrah:\nSeries using science to solve riddles of the ancient past. Did the Biblical cities of Sodom and Gomorrah really exist? And was their destruction - believed to have been caused by the wrath of God - actually the result of an earthquake that triggered a devastating landslide?\n\n\nGOD'S TIME CAPSULE with Guest Ralph Lyman:\nInterview with Ralph Lyman who discusses his book regarding the Great Pyramid in Egypt and how it fits propheticly into the Bible and the upcoming Apocalypse.\n\n\nAlso included are Endtime News Updates 8-02-12 and 8-06-12\n\n\nThe Entire Collection can be found here: \n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\n","torrent":{"xt":"urn:btih:d6e832552e020c5763d05e49bf4be3d1eb6d00f9","amp;dn":"POtHS+-+Prophetic+Times+-+85+-+Ancient+Apocalypse+-+History+Repe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6e832552e020c5763d05e49bf4be3d1eb6d00f9","infoHashBuffer":{"type":"Buffer","data":[214,232,50,85,46,2,12,87,99,208,94,73,191,75,227,209,235,109,0,249]},"announce":[],"urlList":[]}}