{"title":"CoolUtils Total Doc Converter v2.2.202 with Key [iahq76]","uid":7594607,"size":7921486,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d7f974131997c7301be5c6cabaee49ba0b3568f9&amp;dn=CoolUtils+Total+Doc+Converter+v2.2.202+with+Key+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TorDigger","files":3,"time":1346651202,"description":"Total Doc Converter\n \nConvert Doc or RTF to PDF, HTML, XLS, Image and Text easily\n \nTotal Doc Converter is a professional solution to convert documents (Word, Doc, DocX, DocM, RTF, RVF, or TXT files) to HTML, PDF, XLS, JPG, TIFF, and text in batch. It features a step-by-step interface. So new users don't get lost in settings. Total Doc Converter can be run via command line as well. Use Total Doc Converter to save your time and effort: convert thousands of Doc files in 3 clicks. Total Doc Converter strickly preserves document layout. You get the exact copy of the source file in a new format. In addition you can use special options to achieve perfect results:\n When you convert DOC to PDF or TIFF you may combine all source files in one target file. I.e. convert five DOC documents into one multi-page TIFF file. \n\nTotal Doc Converter preserves document properties (i.e. author, creator, key words, subject, title, etc.) when you convert DOC to PDF. Alternatively, you can enter new properties for the output PDF file. \n\n\nUsers can encrypt the final PDF file and protect it from being copied or modified. The latest version adds a digital signature as well. More.. \n\nTotal Doc Converter was designed to convert documents in batches. It processes any number of docs at one go and keeps folder structure to avoid confusion. Download the most powerful batch DOC converter with a well-planned interface for free now.\n\n Key Features\n \nA set of converters in one (doc to pdf, doc to html, doc to xls, doc to jpg, doc to tiff, doc to txt)\n Rvf to PDF, Excel, HTML, JPEG, TIFF, RTF, Text \nDocX (Word 2007) to PDF, Excel, HTML, JPEG, TIFF, RTF, Text \nCommand line support \nCan sign output PDF files \nHeader &amp; Footer support \nIntegrates into Windows \nTransparent interface \nBatch conversion \nThe content of each file can be viewed before conversion \nFast \nVista compatible\n \nSupported OS: \n\nWindows 2000/NT/XP/2003/Vista/7\n \nHomepage: http://www.coolutils.com/TotalDocConverter\n \nInstallation Instructions:\n \n1. Install Program.\n2. Use given key to register application.\n3. Done, Emjoy.\n ","torrent":{"xt":"urn:btih:d7f974131997c7301be5c6cabaee49ba0b3568f9","amp;dn":"CoolUtils+Total+Doc+Converter+v2.2.202+with+Key+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7f974131997c7301be5c6cabaee49ba0b3568f9","infoHashBuffer":{"type":"Buffer","data":[215,249,116,19,25,151,199,48,27,229,198,202,186,238,73,186,11,53,104,249]},"announce":[],"urlList":[]}}