{"title":"TOTAL RECALL xvid cam - GLOBE","uid":7512735,"size":1285660482,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d7f9c9ced168ed64ee00398779ddbda09b98e871&amp;dn=TOTAL+RECALL+xvid+cam+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1344375247,"description":"* XVID CAM  * 01H44M37S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n \n* Plot :\n\nIn 2084, Earth has been divided into two superpowers following the devastation of World War III: the United Federation of Britain (UFB) and The Colony. With habitable space at a minimum, the UFB and the Colony struggle for supremacy. Citizens travel between the two nations via &quot;The Fall&quot;, a supermassive gravity elevator which travels through the Earth's core. The UFB also face terrorist attacks from a resistance movement.\n\nTired of his monotonous life in The Colony and spurred by his recurring violent nightmares, factory worker Douglas Quaid (Colin Farrell) decides to visit Rekall, a company that implants artificial memories. Rekall employee, McClane (John Cho), convinces Quaid to be implanted with memories of a secret agent. Quaid is tested to ensure compatibility but fails and McClane accuses Quaid of really being a spy. McClane and his co-workers are suddenly gunned down by a squad of armored police officers. While Quaid is being arrested, he instinctively reacts and kills the officers before escaping.\n\nQuaid returns home to his wife Lori (Kate Beckinsale) and confesses what has transpired. Lori attempts to kill Quaid, revealing that she is not really his wife of 7 years, but an undercover UFB agent monitoring him for the past 6 weeks. After a struggle, Quaid flees and manages to escape Lori and the police. Hammond (Dylan Scott Smith), a man claiming to be a former associate, contacts Quaid via a cell phone embedded in his hand, disclosing the location of a nearby safe-deposit box. Quaid cuts the cell phone out of his hand to avoid being traced. In the safe-deposit box Quaid discovers a recorded message from his former self, leading him to an apartment in UFB.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:d7f9c9ced168ed64ee00398779ddbda09b98e871","amp;dn":"TOTAL+RECALL+xvid+cam+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7f9c9ced168ed64ee00398779ddbda09b98e871","infoHashBuffer":{"type":"Buffer","data":[215,249,201,206,209,104,237,100,238,0,57,135,121,221,189,160,155,152,232,113]},"announce":[],"urlList":[]}}