{"title":"Remote Desktop Client v3.6.0 Final By bobiras2009","uid":7605676,"size":2735523,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:dc2093ec7042b80a652a622abe6535e990482d55&amp;dn=Remote+Desktop+Client+v3.6.0+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346943672,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nXtralogic Remote Desktop Client for Android enables you to connect to your Windows computers across the Internet from a mobile device powered by Google Android platform. Once connected, it gives you mouse and keyboard control over your computer while showing you everything that's happening on the screen.\n\nYou can leave your computer without losing access to your files, applications, and e-mail. Xtralogic Remote Desktop Client is using Microsoft Remote Desktop Protocol (RDP). All the necessary server components are already part of most versions of the Windows operating system (except Home varieties).\n\nFeatures : \n\n    8, 16, 24 and 32 bit color support \n    Custom screen resolutions, including an option to automatically fit to the device screen \n    SSL security and support for Network Level Authentication (NLA). \n    Microsoft Remote Desktop Gateway (RD Gateway, a.k.a. TS Gateway) support. \n    RemoteApp programs support. \n    On-screen keyboard for keys missing on the device (functional keys, etc.) \n    Server address book \n    Master password to secure server password storage \n    Audio redirection to the client from a remote computer \n    Microphone redirection from the client to a remote computer \n    File transfer between SD card and remote computer \n    Copy/paste text between client and server \n    Display zoom in/zoom out \n    Pinch-to-zoom (available on the devices with multi-touch functionality) \n    The first and only mobile Remote Desktop client with support for Microsoft Remote Assistance \n    RDP data compression and caching to save bandwidth \n    Android home screen shortcuts \n    Support for x86 based Android devices \n    Automatic activation of a software keyboard in text fields \n\nWhat's in this version: (Updated : Sep 4, 2012)\n\n    Added Alt+Shft keyboard shortcut\n    Fixed a problem with the prompt to close session on back key, when it breaks the standard behavior of the back key\n    Fixed a problem when connecting to a load balanced Remote Desktop server farm which is using token redirection\n    Fixed stylus behavior on Galaxy Note with ICS\n    Fixed a crash on master password change\n    Fixed a problem with empty text fields in secondary remote desktop sessions\n    Fixed a problem with text fields shown as black in some applications\n\nRequired Android O/S : 1.5+\n\n\n\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:dc2093ec7042b80a652a622abe6535e990482d55","amp;dn":"Remote+Desktop+Client+v3.6.0+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc2093ec7042b80a652a622abe6535e990482d55","infoHashBuffer":{"type":"Buffer","data":[220,32,147,236,112,66,184,10,101,42,98,42,190,101,53,233,144,72,45,85]},"announce":[],"urlList":[]}}