{"title":"All Girl Thrills (Underground - Restored)","uid":7586067,"size":23681565,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:dc380da3c744441b72d1941c5c759ea130c88150&amp;dn=All+Girl+Thrills+%28Underground+-+Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1346409345,"description":"I have almost 1500 Underground comic books in a digital format. I will be restoring and uploading many of my favorites over the coming months. Any requests, just say the word.\n\nSo what does 'Restored' mean? Well with all due respect to the great and wonderful Sir Real (if you know the name, you know his power!), the pages of these books were not yellow when first printed. Newsprint? Yes, often they were. Cheap paper? Yeah, that too. But not yellow. \n\nIn most cases, the changes make the books look better than they did when they were originally printed. By turning the newsprint or cheap paper they were printed on to a bright white, with crisp, clear greys and solid blacks on top, they look very much like a new b&amp;w comic you would buy right off the shelf today.\n\nThis is accomplished by running the b&amp;w pages through the PhotoScape Batch Editor. The Filters applied to the pages are; Grayscale (changes the image to greyscale); a 'Middle' setting on Auto Level (greatly improves the blacks); a 'Low' or +1 Sharpen (barely noticeable, even if you watch the changes take place). Color covers, back or interior pages are 'Restored' on a page by page basis. \n\nAnd even though I'm not really into scanner tags, out of respect for the huge amount of work he's done (or did - who knows how one so mysterious works?!), I have moved Sir Real's original front page to the back of each issue. \n\n------------------------------------------------------------------------------\n\n'All Girl Thrills'\n\nThe Print Mint ( http://en.wikipedia.org/wiki/Print_Mint ), 1971\n\nBy Trina Robbins, Willy Mendes, Julie Wood\n\n\nWhy? Well, anthropomorphic pot smoking horses, flying giraffes, Gods paper dolls, Venusians, karate, Jimi Hendrix calling a woman a 'white bitch' and then going to heaven. Do you really need more than that?","torrent":{"xt":"urn:btih:dc380da3c744441b72d1941c5c759ea130c88150","amp;dn":"All+Girl+Thrills+%28Underground+-+Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc380da3c744441b72d1941c5c759ea130c88150","infoHashBuffer":{"type":"Buffer","data":[220,56,13,163,199,68,68,27,114,209,148,28,92,117,158,161,48,200,129,80]},"announce":[],"urlList":[]}}