{"title":"Up with Chris Hayes 8-26-12.mp4","uid":7573297,"size":321207969,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dc6990c565ce04dce8fa6e0251e2b9b2708b8379&amp;dn=Up+with+Chris+Hayes+8-26-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1346049920,"description":"Up with Chris Hayes; Sunday, August 26, 2012.\n\nThe panel discussed the state of the modern Republican Party as the GOP heads into its national convention.\n\nAvik Roy (member of Mitt Romney's health care policy advisory group and senior fellow at the Manhattan Institute. He also writes The Apothecary, a Forbes blog on health-care and entitlement reform.)\nJoan Walsh (MSNBC political analyst, Salon's editor at large and author of &quot;What's the Matter with White People: Why We Long for a Golden Age That Never Was&quot;).\nElise Jordan (contributor with the National Review, Daily Best, Marie Claire, and Atlantic.com. Former director for communications for the national security council and former speechwriter to Condoleeza Rice.)\nSophia Nelson, columnist for TheGrio.com, former GOP House Committee Counsel, and author of &quot;Black Woman Redefined&quot;).\n\nMichael Steele (former RNC Chairman and MSNBC analyst joined via satellite a little later from Tampa, FL).\n\nLater:\n\nCorey Robin, (professor of political science at Brooklyn College and the CUNY Graduate Center and author of &quot;The Reactionary Mind: Conservatism from Edmund Burke to Sarah Palin&quot;) took the spot of Elise Jordan.\n\nThe panel then delved into the urban-rural divide, focusing on the the RNC's host city of Tampa as an example.\n\nWendell Cox (senior fellow at the Heartland Institute, consultant for the Department of Transportation, and former director of public policy at the American Legislative Council (ALEC) took the spot of Corey Robin.)\nMichael Bell (professor at Columbia University of Housing, visiting fellow at Harvard University, and an architect at Visible Weather. He also had an installation, which focused on a suburb of Tampa, FL, at the Museum of Modern Art took the spot of Sophia Nelson.)\nMayor Bob Buckhorn (Mayor of Tampa, FL. Also an Urban Land Institute fellow and travels around the country looking at how other cities develop) joined via satellite a little later from Tampa, FL.\n\n'You Should Know' the panelists in the last discussion period remained for 'YSK'.","torrent":{"xt":"urn:btih:dc6990c565ce04dce8fa6e0251e2b9b2708b8379","amp;dn":"Up+with+Chris+Hayes+8-26-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc6990c565ce04dce8fa6e0251e2b9b2708b8379","infoHashBuffer":{"type":"Buffer","data":[220,105,144,197,101,206,4,220,232,250,110,2,81,226,185,178,112,139,131,121]},"announce":[],"urlList":[]}}