{"title":"Toolstar FileRecovery Pro 3.5","uid":7451472,"size":6618772,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dccd93738afcb36c2786afaa33cc47bb0633c029&amp;dn=Toolstar+FileRecovery+Pro+3.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"openarena","files":-1,"time":1342484213,"description":"Toolstar Filerecovery Pro can scan and find lost partitions, boot sectors and other file system components. toolstar*filerecovery Pro can detect drives even if they are not visible in explorer. The full directory structure of the drive is displayed (Even on NTFS Drives where it is recoverable) and the built in search feature makes finding files much easier. The Recovery Wizard allows even novice users to successfully recover lost data.\n\nAllows data recovery from:\n\n* Lost or Deleted Partitions\n* Accidental or Malicious Formats\n* Installations Gone Wrong\n* Virus Attacks- Deletions\n* Local or over a network\n* Virtually Any Logical Disk Disaster\n* Supports IDE-, SATA-, SCSI- and SAS-Harddisks\n* Removable devices as floppys, SmartMedia, CompactFlash, MemorySticks, external harddrives ...\n* installed peripheral devices as ZIP, SyQuest, external HDs, ...\n* All FAT 12/16/32 partitions and all NTFS versions\n* Will support RAID 0, 1 and 5 as well!\n* Runs under all Windows operating systems from Win98 (Vista and Windows Server 2003 too)\n* Recovers the full directory structure with subdirectorys\n\nNOTE: To preserve the drive with the deleted files, all recovered files must be saved to another storage device or another drive letter in the system. DO NOT install the software to the drive that you want to recover. If you want to recover data from your system drive, run the software from CD*.\n\nToolstar Filerecovery Pro can recover files from an encrypted drive (EFS) as well as from Compressed Drives and Folders in NTFS. The recommended method is to recover under Windows XP oder higher.\n\nWe have experienced no problems with IDE, SATA, SCSI or SAS drives and have successfully tested the software on FireWire and USB 2.0 Disk Drives.\n\nSecure:\nTo preserve the drive with the deleted files, all recovered files will be stored to another Windows device. toolstar*filerecovery Pro DOSN'T CHANGE ANYTHING and works writeprotected. This means there will be no changes on the source device.\n\nToolstar Filerecovery Pro is NOT compatible with recovering CD ROMS, CDR's or CDRW's but these devices can be used for storage if they are mounted as Direct CD's - as long as the data being recovered is not on the system drive.\n\nNEW FORENSIC FEATURE:\nYou can now print a list of all deleted files on drive with all their information including; Creation Date, Modified Date and Accessed Date so a record can be kept of what was found on the drive. This feature is indispensable for forensic investigations or security investigations.\n","torrent":{"xt":"urn:btih:dccd93738afcb36c2786afaa33cc47bb0633c029","amp;dn":"Toolstar+FileRecovery+Pro+3.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dccd93738afcb36c2786afaa33cc47bb0633c029","infoHashBuffer":{"type":"Buffer","data":[220,205,147,115,138,252,179,108,39,134,175,170,51,204,71,187,6,51,192,41]},"announce":[],"urlList":[]}}