{"title":"Wave Control Pro v2.30 Final By bobiras2009","uid":7611671,"size":930256,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:dd97a1a1cf37da278091bbd3622941b0c18abb18&amp;dn=Wave+Control+Pro+v2.30+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1347084299,"description":"                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nControl Your Music With a Wave of Your Hand!\nUses the proximity sensor on your phone to allow control of your music playback by waving your hand over your phone. No need to turn on your screen or even touch your phone at all!\n\nPro Features:\n\n    No Ads\n    More Commands\n    Assign Which Gesture Does Which Command\n\nComing Soon:\n\n    More Features - feel free to email any requests you have\n    Update the UI\n\nEasy to use, just wave your hand over the sensor (usually located just next to the earpiece on your phone).\n\n    Holding it there will Pause/Resume\n    One wave across will go to the Next Song\n    Two waves across will go to the Previous Song\n    Three times (needs to be fast) will Pause or Resume the controls\n\nBe sure to enable Headset Button Control in your player of choice\n\nNotes:\n\n    There is a little less than a second to register your waves.\n    Tip for the hover gesture: if you move your hand away too quickly it'll register a wave\n    After an action, there is a 1 second delay before another gesture will be registered\n    Will work with any player that accepts headset (media button) controls\n    If the screen is off or another app is in focus, phone vibrates once on pause control and twice on resume controls \n    Practice your wave techniques by checking the &quot;Last Action&quot; \n    If you're getting another player responding to the commands, check if that app has the option to disable headset button controls\n\nWhat's in this version : (Updated : Sep 7, 2012)\n\n    Tasker Support! Switch Profiles with Tasker. Find it in the Plugin section in Tasker. Profile feature requires Pro or Assign Action Upgrade.\n    Quick Bug Fix for Motorola phones in V2.25\n    New: Profiles - Save up to 4 sets of settings and commands (Pro or Assignable Actions Needed)\n    Renamed Pocket Mode to Screen On Only Mode\n\nRequired Android O/S : 2.2+\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:dd97a1a1cf37da278091bbd3622941b0c18abb18","amp;dn":"Wave+Control+Pro+v2.30+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd97a1a1cf37da278091bbd3622941b0c18abb18","infoHashBuffer":{"type":"Buffer","data":[221,151,161,161,207,55,218,39,128,145,187,211,98,41,65,176,193,138,187,24]},"announce":[],"urlList":[]}}