{"title":"Inverted Suffering from Hell Cherry Torn Matt Williams","uid":7589493,"size":186840417,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ddc39822b1d8e96dc5c2464d26fb20fdbec30a06&amp;dn=Inverted+Suffering+from+Hell+Cherry+Torn+Matt+Williams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":-1,"time":1346458992,"description":"\nInverted Suffering from Hell: Pussy Torment &amp; Skull Fucking; Brutal Elbow Bondage! | Cherry Torn | Matt Williams\n\nAugust 31, 2012\n\n\nMP4 + Pics.        \n        \n\nCherry Torn has, in our humble opinion, the hottest natural body on the planet: the most perfect pussy and best ass and cutest face in hardcore bondage today. All that and she is tough! We often say nature doesn't give it all up in one package, but this is as close as it gets!\n\nHung upside down by thin strips of leather; this position is not trivial, it's painful. Cherry is already suffering. Add in the extreme elbow bondage and Cherry is suffering from the word go. \n\nWe start with the flogger: heavy brutal hits jar Cherry to the bone. Her body turns bright pink almost immediately. We beat on her rock hard stomach and perfect breasts, then switch to her gorgeous phat ass. The cane is next. The sweet sounds of pain make us hard, so a devastating skull fucking is in order. \n\nWe brutally fuck the back of Cherry's throat and vibrate her at the same time. The breath play makes her cum hard and harder. Her strongest orgasms cum when the cock is balls deep in her mouth and she is fighting to breath, to survive. Deep in subspace, disorientated and helpless to mount any kind of defense, we vibrate Cherry to several screaming orgasms, we even have her begging us to stop making her cum. She can't take anymore. We are bad listeners however, and torment her with agonizing pleasure.\n\nIn the end we pull her elbows back even further causing great pain and a beautiful arch to her body. We make her scream out another orgasm, and tie a massive oak apple box to a crotch rope that burns her poor little pussy. Nothing left to do but suffer until we want our cock sucked again.. \n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_31ctorn3/SexuallyBroken-Cherry-Torn-Matt-Williams-Inverted-suffering-from-Hell-Pussy-torment-skull-fucking-brutal-elbow-bondage!.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_31ctorn3/SexuallyBroken-Cherry-Torn-Matt-Williams-Inverted-suffering-from-Hell-Pussy-torment-skull-fucking-brutal-elbow-bondage!.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n\nCheers  :-) \n\n\n","torrent":{"xt":"urn:btih:ddc39822b1d8e96dc5c2464d26fb20fdbec30a06","amp;dn":"Inverted+Suffering+from+Hell+Cherry+Torn+Matt+Williams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddc39822b1d8e96dc5c2464d26fb20fdbec30a06","infoHashBuffer":{"type":"Buffer","data":[221,195,152,34,177,216,233,109,197,194,70,77,38,251,32,253,190,195,10,6]},"announce":[],"urlList":[]}}