{"title":"The Ed Show 8-6-12.mp4","uid":7512403,"size":207291453,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e08490b9f4d262a320abc2f6271c062d9fc5d419&amp;dn=The+Ed+Show+8-6-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1344363747,"description":"The Ed Show; August 6, 2012. &quot;Ed is back and rarin' to go!&quot;\n\nExactly three months before Election Day, Republicans are calling Harry Reid a &quot;dirty liar.&quot; But it was Mitt Romney who used America's heroes tell a real dirty lie.\n\nEd looked at Romney's never-ending tax nightmare with Rep. John Garamendi (D- CA) and Tom Perriello (former Democratic Congressman from Virginia, President and CEO of the Center for American Progress Action Fund).\n\nThen Ed explored, if the media is being fair to &quot;Dirty Harry&quot; Reid with the Big Panel; including Ari Berman (Contributing Writer for The Nation and Rolling Stone), Lizz Winstead (comedian and co-creator of &quot;The Daily Show&quot;) and Susan Del Percio (Republican Strategist and MSNBC Contributor).\n\nMeantime, Romney is hiding behind the military to suppress the vote in Ohio. Former Governor Ted Strickland (D-OH) has the latest on that.\n\nEd discussed President Obama making news on gun control following the second mass murder in two weeks. How far is he willing to go to stop the violence?\n\nMark Potok (Southern Poverty Law Center) says his group has been tracking the alleged white supremacist accused in the Sikh temple massacre for 10 years and he joined Ed Monday (8/6/12).\n\nAnd in the Big Finish, Derrick Pitts (Chief Astronomer at The Franklin Institute in Philadelphia), looks at one of the greatest accomplishments in the history of space exploration, paid for by the American taxpayer.\n","torrent":{"xt":"urn:btih:e08490b9f4d262a320abc2f6271c062d9fc5d419","amp;dn":"The+Ed+Show+8-6-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e08490b9f4d262a320abc2f6271c062d9fc5d419","infoHashBuffer":{"type":"Buffer","data":[224,132,144,185,244,210,98,163,32,171,194,246,39,28,6,45,159,197,212,25]},"announce":[],"urlList":[]}}