{"title":"Connectify Pro 3.6.0.24540.rar","uid":7539397,"size":6090398,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e0ba74ee9d1db4f6838d0212a0e5802587eaa394&amp;dn=Connectify+Pro+3.6.0.24540.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cowboy1966","files":-1,"time":1345175742,"description":"Connectify Pro 3.6.0.24540 | 7.5 Mb\n\n The Connectify application will turn your Windows 7 laptop into a WiFi Hotspot to share the Internet with friends, co-workers, and mobile devices. Connectify is running in the Notification Tray next to the system clock. It might not be visible, because Windows 7 has cleaned up the Notification Tray to hide the icons that you don't frequently use. If you click on the small white triangle it will show all of the icons, including the Connectify radio wave icon.\n \nWhen it is run in &quot;Access Point&quot; mode, Connectify is a real WiFi Access Point running on your computer. Any device that can connect to a regular access point, can connect to a Connectify Hotspot, with no special setup or software required.\n \nWhen Connectify is run in &quot;Ad Hoc&quot; mode it sets everything up for you (Wireless card, Internet sharing, firewall, etc.) in one press of a button. It also provides advanced features like showing you what computers are connected to your network, and letting you right click them to Explore their shared drives and printers.\n \nNOTE: Users can purchase the PRO version of the application (includes features like Share Wi-Fi from 3G/4G Networks, Fully-customizable SSID, AutoInternet selection or Simple Firewall Controls) here.\n \nHere are some key features of &quot;Connectify&quot;:\n \nSoftware-based Wireless Router:\n Â· Take any intemet connection and share it wirelessly with no additional hardware\n \nConnect with Mobile Devices:\n Â· Easily connect any number ot WiFi enabled devices to your mobile network\n \nHome Page - http://www.connectify.me/\n","torrent":{"xt":"urn:btih:e0ba74ee9d1db4f6838d0212a0e5802587eaa394","amp;dn":"Connectify+Pro+3.6.0.24540.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0ba74ee9d1db4f6838d0212a0e5802587eaa394","infoHashBuffer":{"type":"Buffer","data":[224,186,116,238,157,29,180,246,131,141,2,18,160,229,128,37,135,234,163,148]},"announce":[],"urlList":[]}}