{"title":"ImTOO Video Editor v2.2.0 Build 20120901 with Key [iahq76]","uid":7602908,"size":26081926,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e0d509a24f6c336049bbcdb4c2b4ad6be41124bf&amp;dn=ImTOO+Video+Editor+v2.2.0+Build+20120901+with+Key+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TorDigger","files":3,"time":1346870297,"description":"ImTOO Video Editor\n \nImTOO Video Editor is a professional video editing software comprising functions of Video Joiner, Video Splitter, and Video Cutter. This smart video editor can help you join multiple video files into a new one, split one file into several segments, or merge your favorite video segments which are cut from one video to a new one easily and fast. It supports editing video files such as AVI, MPEG, WMV, MP4.\n \nAs a video joiner, ImTOO Video Editor can join and merge multiple videos in the same or different formats as one file, such as AVI, MPEG, WMV, MP4, DivX, MOV, 3GP, ASF.\n As a video splitter, ImTOO Video Editor can split one video file into several manually or automatically. And if you prefer to split a movie automatically, you can adjust settings like splitting by time or size, or splitting averagely.\n As a video cutter, ImTOO Video Editor helps you cut out one or more segments from the original video and output these clips as one file. This function will satisfy your needs of video edit to perfect your movies/videos.\n \nKey Features\n \nThe format of the single output video file merged from multiple videos is one of the input formats.\n With this video editor, you can adjust bit rate, frame rate, resolution to get the best effect for your video.\n Video splitter allows you to automatically split by time, by segment size or by the number of segments.\n Cut out a video file to get video clips. Delete any clips shown in the list and output the desired clips as a one.\n The built-in player in the splitter, joiner and cutter helps you preview the video, as well as the output one.\n Automatically shut down or process other after-done actions when the cutting, splitting or joining is done.\n English, German, Spanish, Italian, French, Japanese, Simplified and Traditional Chinese interface languages are available.\n \nSystem Requirements:\n \nOS : MicrosoftÂ® Windows XP (SP2 or later), Windows Vista\n Processor : 1GHz Intel/AMD processor or above\n RAM : 256MB RAM (512MB or above recommended)\n Free Hard Disk : 30MB space for installation\n Graphic Card : Super VGA (800Ã—600) resolution, 16-bit graphics card or higher\n \nHomepage:\n \nInstallation Instructions:\n \n1. Install Program.\n2. Use given serial to register application.\n3. Done, Enjoy.\n ","torrent":{"xt":"urn:btih:e0d509a24f6c336049bbcdb4c2b4ad6be41124bf","amp;dn":"ImTOO+Video+Editor+v2.2.0+Build+20120901+with+Key+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0d509a24f6c336049bbcdb4c2b4ad6be41124bf","infoHashBuffer":{"type":"Buffer","data":[224,213,9,162,79,108,51,96,73,187,205,180,194,180,173,107,228,17,36,191]},"announce":[],"urlList":[]}}