{"title":"Droit de Regard. FR WebRip {XviD - MP3}","uid":7105037,"size":733110318,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e15af295b9aed2bd8124c3d03fe49354b6086b26&amp;dn=Droit+de+Regard.+FR+WebRip+%7BXviD+-+MP3%7D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1331840173,"description":"Lemission de France 2 du 3 octobre 2011, Un oeil sur la Planete, sous titree Un etat palestinien est-il encore possible, a presente du conflit israelo-palestinien une vision totalement tronquee et desequilibree. France Television en diffusant une emission a caractere propagandiste sest decredibilisee quant au serieux et a lobjectivite quune chaine publique devrait avoir.\n\nLe film que vous allez voir analyse plusieurs episodes ou le magazine de France 2 a distordu lhistoire du conflit et la realite sur le terrain. Linformation sur un conflit aussi complique, aussi mediatise, vehiculant autant de passion et de haine necessite une rigueur et un souci de la verite objective et non comme la fait France 2 un regard partisan et propagandiste.\n\nDes conseillers tres speciaux ont participe a la fabrication de ce magazine: tous pro-palestiniens !\n\nSuite a la demande dexplication de lambassade dIsrael aupres de France Televisions apres la diffusion du magazine, le delegue de la Palestine en France en a fait de meme. Etonnant pour un diplomate qui est au generique de lemission avec tous ses soutiens.\nAngle des sujets, interviews, choix des images. Beau travail journalistique, en confiance. Rien naurait pu se faire sans vous messieurs les conseillers !\nAu plaisir de poursuivre, ensemble.","torrent":{"xt":"urn:btih:e15af295b9aed2bd8124c3d03fe49354b6086b26","amp;dn":"Droit+de+Regard.+FR+WebRip+%7BXviD+-+MP3%7D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e15af295b9aed2bd8124c3d03fe49354b6086b26","infoHashBuffer":{"type":"Buffer","data":[225,90,242,149,185,174,210,189,129,36,195,208,63,228,147,84,182,8,107,38]},"announce":[],"urlList":[]}}