{"title":"Pulp Fiction (DVDRip) (1994).avi","uid":7099566,"size":2445629218,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e15b12acf48acc3f7deb0619a5c1afbe24e8c530&amp;dn=Pulp+Fiction+%28DVDRip%29+%281994%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"darius1954","files":1,"time":1331653542,"description":"Pulp Fiction is a 1994 American crime film directed by Quentin Tarantino, who co-wrote its screenplay with Roger Avary. The film is known for its rich, eclectic dialogue, ironic mix of humor and violence, nonlinear storyline, and host of cinematic allusions and pop culture references. The film was nominated for seven Oscars, including Best Picture; Tarantino and Avary won for Best Original Screenplay. It was also awarded the Palme d'Or at the 1994 Cannes Film Festival. A major critical and commercial success, it revitalized the career of its leading man, John Travolta, who received an Academy Award nomination, as did costars Samuel L. Jackson and Uma Thurman.\nDirected in a highly stylized manner, Pulp Fiction joins the intersecting storylines of Los Angeles mobsters, fringe players, small-time criminals, and a mysterious briefcase. Considerable screen time is devoted to conversations and monologues that reveal the characters' senses of humor and perspectives on life. The film's title refers to the pulp magazines and hardboiled crime novels popular during the mid-20th century, known for their graphic violence and punchy dialogue. Pulp Fiction is self-referential from its opening moments, beginning with a title card that gives two dictionary definitions of &quot;pulp&quot;. The plot, as in many of Tarantino's other works, is presented out of chronological sequence.","torrent":{"xt":"urn:btih:e15b12acf48acc3f7deb0619a5c1afbe24e8c530","amp;dn":"Pulp+Fiction+%28DVDRip%29+%281994%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e15b12acf48acc3f7deb0619a5c1afbe24e8c530","infoHashBuffer":{"type":"Buffer","data":[225,91,18,172,244,138,204,63,125,235,6,25,165,193,175,190,36,232,197,48]},"announce":[],"urlList":[]}}