{"title":"We Walk The Line A Celebration of the Music of Johnny Cash [Blu-","uid":7580315,"size":3328525978,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e332b8f99d1a925b51f571e029e45e865100c6c2&amp;dn=We+Walk+The+Line+A+Celebration+of+the+Music+of+Johnny+Cash+%5BBlu-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"alanwatson","files":-1,"time":1346222797,"description":"Johnny Cash influenced a great variety of musicians and it was never more apparent than on Friday, April 20, 2012 at The Moody Theater in Austin, TX. The special concert and 80th-birthday tribute, We Walk the Line: A Celebration of the Music of Johnny Cash, featured an all-star list of talent not only celebrating the life and legacy of Johnny Cash, but also paying tribute to Cash, his music, his roots and his heritage.\n\nThe two and a half hour show featured a wide spectrum of legendary musicians including Outlaw country pioneers Kris Kristofferson, Willie Nelson, contemporary icons (Ronnie Dunn, Evanescence s Amy Lee and Grammy Award Winners Pat Monahan of Train and The Carolina Chocolate Drops. An all-star band led by GRAMMY Award-winning Don Was which included Buddy Miller, Kenny Aronoff, Ian McLagen, and Greg Leisz served to back these once-in-a-lifetime performances. We Walk the Line: A Celebration of the Music of Johnny Cash features several remarkable pairings such as Willie Nelson and Sheryl Crow performing &quot;If I Were A Carpenter,&quot; one of several duets recorded by Cash and his wife, June Carter Cash. Pat Monohan and Shelby Lynne trade verses on &quot;It Ain' t Me Babe,&quot; Kris Kristofferson joins Jamey Johnson for &quot;Sunday Morning Comin' Down,&quot; both returning with Willie Nelson and Shooter Jennings for &quot;The Highwayman.&quot;\n\nBlu-ray Track List:\n1.Folsom Prison Blues Performed by Brandi Carlile \n2.Get Rhythm Performed by Andy Grammer \n3.I'm So Lonesome I Could Cry Performed by Amy Lee \n4.Hey Porter Performed by Buddy Miller\n5.Why Me Lord Performed by Shelby Lynne \n6.Help Me Make It Through the Night Performed by Pat Monahan \n7.It Ain't Me Babe Performed by Shelby Lynne and Pat Monahan\n8.Sunday Morning Coming Down Performed by Jamey Johnson and Kris Kristofferson \n9.Jackson Performed by Carolina Chocolate Drops \n10.Wreck Of The Old 97 Performed by Rhett Miller \n11.Ring Of Fire Performed by Ronnie Dunn \n12.Cocaine Blues Performed by Shooter Jennings \n13.Hurt Performed by Lucinda Williams\n14.The Long Black Veil Performed by Iron &amp; Wine\n15.Big River Performed by Kris Kristofferson \n16.Cry, Cry, Cry Performed by Sheryl Crow\n17.If I Were A Carpenter Performed by Willie Nelson and Sheryl Crow 18.Highwayman Performed by Willie Nelson, Kris Kristofferson, Shooter Jennings and Jamey Johnson \n19.I Walk The Line Performed by Full Ensemble\n\nBONUS Disc Included\n\ninfo disc 1\n\nFormat            : MPEG-4 at 5 043 Kbps\nLength            : 2.74 GiB for 1h 17mn 39s 200ms\n\nVideo #0          : AVC at 4 399 Kbps\nAspect            : 1280 x 720 (1.778) at 29.970 fps\n\nAudio #0          : AC-3 at 640 Kbps\nInfos             : 6 channels, 48.0 KHz\nLanguage          : en\n\n\n\ndisc 2[bonus]\n\nFormat            : MPEG-4 at 3 153 Kbps\nLength            : 373 MiB for 16mn 32s 543ms\n\nVideo #0          : AVC at 2 699 Kbps\nAspect            : 1280 x 720 (1.778) at 29.970 fps\n\nAudio #0          : AC-3 at 448 Kbps\nInfos             : 2 channels, 48.0 KHz\nLanguage          : en\n","torrent":{"xt":"urn:btih:e332b8f99d1a925b51f571e029e45e865100c6c2","amp;dn":"We+Walk+The+Line+A+Celebration+of+the+Music+of+Johnny+Cash+%5BBlu-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e332b8f99d1a925b51f571e029e45e865100c6c2","infoHashBuffer":{"type":"Buffer","data":[227,50,184,249,157,26,146,91,81,245,113,224,41,228,94,134,81,0,198,194]},"announce":[],"urlList":[]}}