{"title":"BubbleUPnP Pro v1.5.2 Final By bobiras2009","uid":7611659,"size":4367665,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:e449553aa50da4783d43214abe42f47f26bbecec&amp;dn=BubbleUPnP+Pro+v1.5.2+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1347083973,"description":"                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nPlay easily your music and videos on your phone and devices on your network (DLNA TVs, XMBC, WMP, ...) from your eQxternal UPnP Media Servers. Play your phone/tablet media to those devices.\nBrowse and play your local phone/tablet media from other devices (PS3, ...).\n\nOptional Internet Streaming:\nMore than just regular LAN streaming, BubbleUPnP can also stream efficiently your media via the Internet over a mobile or WiFi connection. Internet streaming requires installing server software &quot;BubbleUPnP Server&quot; running on Windows, MacOS X, Linux or a NAS (it is not required for regular LAN streaming, see NOTE below). To learn more about BubbleUPnP Server and Internet streaming visit http://bubbleguuum.free.fr/upnpserver\n\nFeatures:\n\n    Tablet support\n    stream music and videos from your UPnP/DLNA Media Server (Twonky, Asset UPnP, any NAS with UPnP, ...) to your Android device.\n    Codecs supported for audio: with system decoders: MP3, AAC (without DRM), WMA, Ogg Vorbis. With custom decoders WAV, FLAC, ALAC, LPCM. WMA support is manufacturer and model dependent. Vorbis may not work on Android 2.1/2.2.\n    Video playback is delagated to an external app (VPlayer, MoboPlayer, DicePlayer,...)\n    stream music/videos from your UPnP/DLNA Media Server to your UPnP renderers (software or hardware) on your network with regular playback controls (play, pause, seek, volume, ...). \n    UPnP Media Server (*** requires Android 2.2+ ***): play your local phone/tablet media to other devices or to your Android device (standalone media player). Browse and play your local phone/tablet media from other devices (PS3, WMP, ...). Able to browse Filesystem (SD Card) in licensed version.\n    UPnP renderer: control audio playback of your android device from another UPnP Control point\n    Internet streaming/downloading over a mobile or WiFi connection with BubbleUPnP Server\n    UPnP tethering with BubbleUPnP Server (makes Media Servers from a LAN visible on another LAN)\n\nWhat's in this version : (Updated : Sep 7, 2012)\n\n    fixed image viewer not showing next image when externally controlled\n    fixed local renderer not playing some WAV files\n    fixed duplicate entries appearing in Library on some tablets\n    fixed app exiting on inactivity while streaming to external renderers in some cases\n    fixed some files from the Local Media Server Filesystem folders not playing on buggy renderers (Onkyo)\n    fixed mp3 files failing to download from BubbleUPnP Server managed Media Servers in some cases\n    various other fixes\n\nRequired Android O/S : 2.1+\n\n\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:e449553aa50da4783d43214abe42f47f26bbecec","amp;dn":"BubbleUPnP+Pro+v1.5.2+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e449553aa50da4783d43214abe42f47f26bbecec","infoHashBuffer":{"type":"Buffer","data":[228,73,85,58,165,13,164,120,61,67,33,74,190,66,244,127,38,187,236,236]},"announce":[],"urlList":[]}}