{"title":"20120726-Stossel-[Myths and Truths].Fox Business.CF.avi","uid":7481231,"size":342890504,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e68c914fd0538417f3cba79e0ebcc92a6569d86c&amp;dn=20120726-Stossel-%5BMyths+and+Truths%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1343439665,"description":"----------\n\nSTOSSEL - [Myths &amp; Truths] - Fox Business Network\n(a/k/a &quot;What You Think You Know...may not be So&quot;)\n2012, July 26, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nThe United States Olympic team should wear American-made uniforms.\n\nScientists are boring.\n\nYoung people should go to college.\n\nPeople believe these things. But what you know, may not be so.\n\nOn our show this week, we separate myths from truths.\n\nEconomist Art Carden says that overpopulation isn't bad.\n\nJames Altucher gives advice, such as &quot;un-schooling&quot; your kids.\n\nSenator John Barrasso explains how the EPA makes people sick.\n\nAnd the physicist Michael Brooks says science often learns a lot from anarchy, not meticulous research. \n\nAnd finally, I show that government may not adopt the best product, like a superior fire retardant. I'll put it on my skin, and stick my hand in flame.\n\n-----\n\n(uploader note and opinion: \n\nOn the anarchy in science segment: this may also create valid reasons for skepticism of certain scientific work, principally where government is deeply entagled in the process and where higher order interests become involved.\n\nI take myself as one who tries to be a rational skeptic, and feel a little downcast when other skeptics quickly cast me aside as a &quot;denial-ist&quot; on scientific matters like global warming/cooling/anthropogenic climate change, to name the showpiece issue. I believe that the scientific method is likely the only way we have to best know about something, but there is also a vulnerability to labels. Just because a process is represented as scientific does not necessarily make it truly science. Credibility and the reputation of the process is everything, when people must at some point rely on the work (we have our own lives, not everyone can be their own scientist specializing in everything). \n\nWhat do we do then, when that process of science becomes tainted? In climate change debate, my skepticism comes not from science per se, but from an evidence-based worry that this scientific process has become tainted, and therefore the results may not be trustworthy. It's got the label: &quot;science&quot;, but was it?\n\nPhrases like, &quot;science in the public interest&quot;, give me great pause when I read them or hear them in media, as they seem to imply a close connection with government resources and its uniquely coercive power. Public policy is created by governments and justified by saying it is somehow &quot;for the best&quot;, &quot;in your best interest&quot;, etc. And this tying, which I might call &quot;government-sponsored scientism for government ends&quot; creates significant conflicts of interest that ordinarily would be called out as improper, but instead become short-circuited by politics into a virtue.\n\nProper science, the noble ideal to discover reality, becomes bastardized into a new clergy employed by government to bless its functionaries with an authority to rule.)","torrent":{"xt":"urn:btih:e68c914fd0538417f3cba79e0ebcc92a6569d86c","amp;dn":"20120726-Stossel-%5BMyths+and+Truths%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e68c914fd0538417f3cba79e0ebcc92a6569d86c","infoHashBuffer":{"type":"Buffer","data":[230,140,145,79,208,83,132,23,243,203,167,158,14,188,201,42,101,105,216,108]},"announce":[],"urlList":[]}}