{"title":"Straw Dogs (1971) DVD5 (ISO) Disc 2 Criterion Collection","uid":7596577,"size":4510351360,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e8320801ec57feca18b913b8cb1240df240be2a1&amp;dn=Straw+Dogs+%281971%29+DVD5+%28ISO%29+Disc+2+Criterion+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Auge","files":-1,"time":1346709650,"description":"Straw Dogs (1971) DVD5 (ISO) Disc 2 Criterion Collection\n\n*** \nI use a Transfer Cap and upload 7 gigs a day. \nThis is why I upload a new torrent every other day or so. \nI do this to keep my IP off my back as they have initiated a monthly limit.\nIt usually takes me two days to fully seed a torrent so please be patient. \n***\n\nThis is a DVD rip to an ISO so you can watch it on your media player mount it to a virtual drive or burn it to a DVD. You can even unzip it with WinZip or WinRAR to unpack it to the original VOBs.\n\nThis rip is a (DVD-5)\n\n- What I mean by (DVD-5) this ISO has been compressed to fit onto a single layer disc the main film has been touched as little as possible and unless you are watching this on a high definition projector at over 60 inches you should not be able to notice any difference. Nothing has been taken out of the original DVD.\n\n\n1960\n89 minutes\nColor\nWidescreen Anamorphic 1.78:1\nSpoken Language: English\nNTSC\n\nDirector: \nSam Peckinpah\n\nCast: \nDustin Hoffman Susan George Peter Vaughan T.P. McKenna Del Henney Jim Norton Donald Webster Ken Hutchison\n\nDisc Features:\n* Sam Peckinpah: Man of Iron an eighty-minute documentary on Sam Peckinpah\n* Behind-the-scenes footage\n* On Location: Dustin Hoffman on the set of Straw Dogs\n* New video interviews with Susan George and Daniel Melnick\n* Original theatrical and television trailers\n* Peckinpah Responds: Select letters to critics and viewers\n\nSYNOPSIS:  \nThe bonus disc to this 1971 drama starring Dustin Hoffman includes the following special features: Sam Peckinpah: Man of Iron, an 82-minute documentary of reflections by members of director Peckinpahs family, friends and collaborators; On Location: Dustin Hoffman, a 26-minute featurette; behind-the-scenes footage; video interviews with actress Susan George and producer Daniel Melnick; theatrical trailers and more.\n\nStuff I Want:\nI am desperately seeking an invite to BitHQ.\nIf anybody can help me out you would be doing me a big favor.\n","torrent":{"xt":"urn:btih:e8320801ec57feca18b913b8cb1240df240be2a1","amp;dn":"Straw+Dogs+%281971%29+DVD5+%28ISO%29+Disc+2+Criterion+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8320801ec57feca18b913b8cb1240df240be2a1","infoHashBuffer":{"type":"Buffer","data":[232,50,8,1,236,87,254,202,24,185,19,184,203,18,64,223,36,11,226,161]},"announce":[],"urlList":[]}}