{"title":"Parade Parade 1-2 [Hentai]","uid":7544649,"size":463568896,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:e834d409db297399ff878abc117aa4d44b749398&amp;dn=Parade+Parade+1-2+%5BHentai%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KawaiHentai","files":-1,"time":1345312076,"description":"Audio: Japanese\nSubtitles: English\nResolution: 640x480\nFormat: AVI\nUncensored\n\nKaori Shiina is an up-and-coming pop singer who has a little problem; she's a hermaphrodite. Whilst hiding her secret from the public eye, she is in a relationship with her manager, Yuko Imai. When rival singer Saki Midorisawa lays eyes on Kaori for the first time, she decides to include her into her stable of women lovers. She traps Kaori in the bathroom, where she discovers her secret and teases her, threatening to make her secret public if she rejects her advances. Yuko then steps in to save her, and Saki recognises her as her former co-worker and lover, Kaoru. In order to keep Kaori's nature a secret, Saki proposes a sex challenge, saying that if she wins, she'll keep Kaori in her harem. The contest was to swap partners, Saki with Kaori and Yuko with Sayaka, one of Saki's girls, and be the first to make the other reach orgasm. Yuko manages to win thanks to finding out Sayaka's weak spot, and Kaori managing to hold in her climax. As they leave, Yuko tells Kaori the story of how she and Saki were new singers who were sexually abused by their managers. Although the two of them got through thanks to each other, Yuko suddenly got a vocal cord infection, and left the industry without saying a word to Saki. The next day, Saki joins Kaori and Yuko at the office, saying that even though she lost the challenge, she hasn't given up on making Kaori hers.\n\nPreview Pics: &lt;a href=&quot;\nhttp://www.kawaihentai.com/2012/08/parade-parade-episodes-1-2.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kawaihentai.com/2012/08/parade-parade-episodes-1-2.html&lt;/a&gt;","torrent":{"xt":"urn:btih:e834d409db297399ff878abc117aa4d44b749398","amp;dn":"Parade+Parade+1-2+%5BHentai%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e834d409db297399ff878abc117aa4d44b749398","infoHashBuffer":{"type":"Buffer","data":[232,52,212,9,219,41,115,153,255,135,138,188,17,122,164,212,75,116,147,152]},"announce":[],"urlList":[]}}