{"title":"Sexually Broken-----Skull Fucked Ass Fucked Bondage Fucked Leila","uid":7442789,"size":1043392096,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e866b812e1c6e4672179f8c7d4421097051c5c15&amp;dn=Sexually+Broken-----Skull+Fucked+Ass+Fucked+Bondage+Fucked+Leila&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1342275630,"description":"\nSkull Fucked-Ass Fucked-Bondage Fucked! | Leilani Leeane | Matt Williams\n\nJuly 13, 2012 \n \n   \nMP4 and WMV + Pics. \n    \n \nAs we write this, Leilani Leeane is currently the 6th most popular porn star in the world according to AVN. Besides being beautiful and having one of the nicest asses on the planet, Leilani is a genuine sweetheart.\n\nYou know what we love doing to beautiful 19-year-olds? Yep, you guessed it, tying them up so they are completely helpless, and fucking the shit out of every hole they have. \n\nOur sexy little 19-year-old is way out of her comfort zone. She is used to making love, and having normal sex for the vanilla porn world. Not today. Today she finds out what being helpless is all about. \n\nWe brutally skull fuck her pie hole. Leilani can do nothing to prevent the hard cock from going ALL the way down her wet throat. We fuck her face, and control her breathing with cock. Tears trickle from her sad eyes as the cock rams home again and again, down the back of her throat. \n\nAfter that deep slippery throat saliva is coating that hard cock we jam it up her ass. For a 19-year-old with a perfect booty she sure can take a powerful ass fucking. We make her cum a few times, then make her suck her ass juices off the cock. \n\nBack and forth we fuck her. She is totally helpless as her holes are violated again and again. Totally fucked out we grab her ankles and turn her into a work of art. Her back is arched, her feet spread up and high. In this position we make the little slut cum again with a vibrator. \n\nSwimming in subspace, disorientated and cum drunk, we leave our beautiful star to suffer in the bondage. When we are ready to fuck her holes again we will let her down, but not before... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/07_13leilani2/SexuallyBroken-Leilani-Leeane-Matt-Williams-Skull-Fucked-Ass-Fucked-Bondage-Fucked.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/07_13leilani2/SexuallyBroken-Leilani-Leeane-Matt-Williams-Skull-Fucked-Ass-Fucked-Bondage-Fucked.php&lt;/a&gt;\n\nAnd if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n\nCheers  :-) \n\t\t\n\n\n","torrent":{"xt":"urn:btih:e866b812e1c6e4672179f8c7d4421097051c5c15","amp;dn":"Sexually+Broken-----Skull+Fucked+Ass+Fucked+Bondage+Fucked+Leila","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e866b812e1c6e4672179f8c7d4421097051c5c15","infoHashBuffer":{"type":"Buffer","data":[232,102,184,18,225,198,228,103,33,121,248,199,212,66,16,151,5,28,92,21]},"announce":[],"urlList":[]}}