{"title":"Voluntary Madness: My Year Lost and Found in the Loony Bin","uid":7567999,"size":182671953,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e92a5926ea9084d79b7d98aaf110807fafb10f63&amp;dn=Voluntary+Madness%3A+My+Year+Lost+and+Found+in+the+Loony+Bin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"geogaddi000","files":-1,"time":1345914995,"description":"Voluntary Madness -- My Year Lost and Found in the Loony Bin \nby Norah Vincent \n\nUnabridged. 9 hours. 64kbps MP3\n &lt;a href=&quot;\nhttp://health.usnews.com/health-news/family-health/brain-and-behavior/articles/2009/01/02/voluntary-madness-author-norah-vincent-tells-of-her-depression&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://health.usnews.com/health-news/family-health/brain-and-behavior/articles/2009/01/02/voluntary-madness-author-norah-vincent-tells-of-her-depression&lt;/a&gt;\n\nThe psychiatry field has come under a lot of fire lately for all those financial ties that big-time psychiatrists have with drug makers. Case in point: Noted Harvard psychiatrist Joseph Biederman stands accused by Sen. Charles Grassley of Iowa of failing to report more than $1.6 million in payments he received from pharmaceutical firms like Johnson &amp; Johnson and Eli Lilly. This week, Biederman agreed to stop working on drug company-sponsored clinical trials until the allegations are fully investigated by Massachusetts General Hospital, where he works.\n\nThere are concerns, too, that psychiatrists in the real world of city hospital psych wards and small private practices spend far too much time writing prescriptions and far too little time listening to patients to help them work through issues that may be the root of their illnesses. Norah Vincent explores this controversy through firsthand personal experience: She becomes a patient herself, documenting what she saw in her new book, Voluntary Madness: My Year Lost and Found in the Loony Bin.\n\nVincent, the bestselling author of Self-Made Man, in which she wrote about disguising herself as a man, decided to have herself voluntarily committed to three different institutions. (She declined to provide their real names to protect the privacy of doctors and patients she met there.) She first faked her way into a big city public hospital by pretending to have a recurrence of her previous depression. She then intentionally caused a relapse of her depression by going off her antidepressant, which led to her being admitted to a small private hospital. Finally, she tried a recovery facility replete with yoga classes, gym, and facials.\n\nSetting aside the ethical problems of faking mental illness (Vincent told her insurance company and offered to pay for the treatment) and the recklessness of causing your own depression relapse, the book is replete with insights into how varying treatment is for mental illness.","torrent":{"xt":"urn:btih:e92a5926ea9084d79b7d98aaf110807fafb10f63","amp;dn":"Voluntary+Madness%3A+My+Year+Lost+and+Found+in+the+Loony+Bin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e92a5926ea9084d79b7d98aaf110807fafb10f63","infoHashBuffer":{"type":"Buffer","data":[233,42,89,38,234,144,132,215,155,125,152,170,241,16,128,127,175,177,15,99]},"announce":[],"urlList":[]}}