{"title":"Handrite Note Pro v1.73 Final By bobiras2009","uid":7551156,"size":954534,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:e93352b83887e19da0d41a772e319cfa5b276b94&amp;dn=Handrite+Note+Pro+v1.73+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1345484262,"description":"                                  By bobiras2009\t\n\n\nIt's the write idea. Handrite alows you to write with your finger right on your screen. Each time you lift your finger, the character or symbol you wrote appears in the notebook interface. It replicates exactly what you add to the screen. Give up the apper habit and keep, send, or post your notes.\n\nYou're in an important meeting or lecture when suddenly you realize--you forgot your pen or notebook! Or you're at a party and need to take down a phone number or an e-mail address. Don't trust your memory or try to scribble on a dry-cleaning receipt; Handrite is the solution you need.\n\nThe Write Move\nRather than trying to frantically type notes on your device keyboard, Handrite Note allows you to write with your finger right on your Android's screen. Each time you lift your finger, the character or symbol you wrote appears in the notebook interface. When you finish a word, just hit the space bar icon at the bottom of the screen. Hit Return if you want to move down to the next line. If you make a mistake, there's a simple backspace button to delete as many characters as you need to. You can also cut and paste with ease.\nHandrite Note doesn't try to &quot;read&quot; your handwriting. Rather, it replicates exactly what you trace on the screen, as with a drawing program. This avoids the pain of having to &quot;train&quot; the app to read your writing, and the inevitable mistakes that occur. It also means you can sketch symbols, numbers, pictures, mathematical equations--whatever you write is instantly recorded digitally for later reference. And notes are saved automatically.\n\n\nWhat's in this version : (Updated : Aug 17, 2012)\n\n    Bug fix: Can't undo deletion of an picture.\n    Bug fix: Can't open the picture viewing app.\n    Bug fix: When a note is newly opened, the first click was wrongly positioned.\n\nRequired Android O/S : 1.6+\n\n\n\n                                  By bobiras2009\t","torrent":{"xt":"urn:btih:e93352b83887e19da0d41a772e319cfa5b276b94","amp;dn":"Handrite+Note+Pro+v1.73+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e93352b83887e19da0d41a772e319cfa5b276b94","infoHashBuffer":{"type":"Buffer","data":[233,51,82,184,56,135,225,157,160,212,26,119,46,49,156,250,91,39,107,148]},"announce":[],"urlList":[]}}