{"title":"PNotes 9.1[key.included]","uid":7592732,"size":1242963,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e9ee2d00de5870f460d0992ee9849258aff20eb2&amp;dn=PNotes+9.1%5Bkey.included%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1346601457,"description":"PNotes (Pinned Notes or Portable Notes) is written entirely in C and Windows API - so it is fast and light-weight. It has flexible settings - both for the program in whole and for individual note. Skins, fonts, colors, alarms, tags, transparency level - all-in-one. Any portion of note's text can be formatted separately. There is a variety of skins for PNotes and, moreover, you can create your own one if download PNSkinCreator - a small utility for creation PNotes skins. Notes can also be skinless, that allows stretching them to any reasonable size. You may set the password, which will prevent unauthorized access to program. In this case you can also store the notes as encrypted files, so even if you lose your USB stick nobody could read them. It is possible to schedule each note to remind you about significant events by different ways. Instead of using sound files you may let your notes to speak their text aloud. One more PNotes feature - ability to join notes into groups by your choice. You can create, modify, delete and relocate groups by simple click or drag-and-drop. Changing group for each note performed by dragging it onto appropriate group. There is also special group of notes: &quot;Diary&quot;. In order to save important information you may use FTP syncing or backups. PNotes is fully Unicode supported and translated into many languages. And, obviously, it is portable - it leaves no traces in Windows registry and can be started from any drive (fixed or flash) on any computer. Take your notes with you to any location.","torrent":{"xt":"urn:btih:e9ee2d00de5870f460d0992ee9849258aff20eb2","amp;dn":"PNotes+9.1%5Bkey.included%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9ee2d00de5870f460d0992ee9849258aff20eb2","infoHashBuffer":{"type":"Buffer","data":[233,238,45,0,222,88,112,244,96,208,153,46,233,132,146,88,175,242,14,178]},"announce":[],"urlList":[]}}