{"title":"POtHS - Prophetic Times - 81 - Apocalypse 2012 Prophecies Vol 19","uid":7572885,"size":4380636763,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ea5e6e8c9e3b05af9dc7befa71d4d3e8cc779d1e&amp;dn=POtHS+-+Prophetic+Times+-+81+-+Apocalypse+2012+Prophecies+Vol+19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":-1,"time":1346037921,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Prophetic Times - 81 - Apocalypse 2012 Prophecies Vol 19 - Petra - Israels Secret Hiding Place and Things to Come\n\nPOtHS Comments on This one: This is soon to come Prophecy for Israel\n\nPetra - Israels Secret Hiding Place:\nThis video will take you through the 30-square mile cave city of Esau--the most mysterious ghost town in the world. You will be shown from the Bible why Petra will be the secret hiding place of the Jewish remnant during the last half of the Tribulation. There is a lot of Biblical references and lore in the history lesson given in this video. The video has character with much to learn about the city of Petra with an entertaining presentation. If you are into history and archaeology then this video is for you.\n\n\nCURRENT EVENTS IN SYRIA - ISRAEL DANGER AND REDEMPTION:\nAvi Lipkin returns to the program with his son, Aaron, to discuss the civil war in Syria and how the warfare in Syria affects Israel and the rest of the Middle East.\n\n\nGLIMPSES OF THINGS TO COME:\nNoah Hutchings, Bob Glaze, and Larry Spargimino discuss the biblical signs of the end times prophesied through the Scriptures that are coming true right before our eyes.\n\n\nMarch Toward the Mark:\nCharles Lawson 07/25/12 (WN) Revelation 13:16-18 Obamacare and Bill Clinton's Agenda 21 Lay Out Signifcant Tools That Could Readily Emower the Antichrist to Enforce Only Sanctioned Commerce.\nShorts\nSigns of the Times\nSIN-ister Clips\nThe Holy Spirit\n\nThis is dedicated to my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\n\nThe Entire Collection can be found here: \n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\n","torrent":{"xt":"urn:btih:ea5e6e8c9e3b05af9dc7befa71d4d3e8cc779d1e","amp;dn":"POtHS+-+Prophetic+Times+-+81+-+Apocalypse+2012+Prophecies+Vol+19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea5e6e8c9e3b05af9dc7befa71d4d3e8cc779d1e","infoHashBuffer":{"type":"Buffer","data":[234,94,110,140,158,59,5,175,157,199,190,250,113,212,211,232,204,119,157,30]},"announce":[],"urlList":[]}}