{"title":"GRave Defense HD v1.10.0 Final By bobiras2009","uid":7501420,"size":22142955,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:eaa73a394d0c941ebcf44ff0db1354b992e494de&amp;dn=GRave+Defense+HD+v1.10.0+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1344032203,"description":"Grave Defense HD is the next step in the evolution of tower defense games for the mobile platform! It takes the best qualities from other tower defense games and adds many new features as well! It is an old-school hardcore game for Android only!\n\nGrave Defense HD has something that all those &quot;others&quot; don't: A storyline! Follow the harrowing encounters of the Fellowship of Survivals with mutated zombies and formidable boss monsters!\n\nA post-apocalyptic world destroyed by a nuclear war, hordes of zombies hunger for human flesh. But zombies aren't the only threats you'll encounter! Face off against some of History's most notorious baddies, like Dracula and Frankenstein! Obliterate mutant hordes across 20 levels using fire, electricity, lasers and more! Each battlefield is unique: Visit exotic locations like the Amazon Rainforest, the Bermuda Triangle and even an alien space! You must use your limited types of towers, some much more powerful than others, and evolving strategies and tactics to survive! Are you ready to be Humanity's last, best, and only chance for survival??? Lock and load soldier, and get ready for GRave Defense HD to blow your mind!!!\n\nWhy GRave Defense HD?\n\nGRave Defense HD includes all the levels from GRave Defense Gold, plus a new larger, beautiful and challenging multi-screen level! Look for more multi-screen levels AND GRave Defense Silver campaign coming in future updates!\n\nFeatures:\n\n    Amazing high-res graphics! All levels, towers, mutants, special effects and achievements now in HD!!\n    NEW achievements, enemies and towers!\n    NEW Military Ranks! Climb the militant ladder, all the way to the &quot;Top&quot;!\n    NEW Survival mode:\n        More tower upgrades!\n        Earn more points and get the High Score! \n        Online ranking system!\n    Four difficulty modes, from Casual to INSANE!!\n        New and Improved gameplay features:\n        Visible monster paths! Now see where creeps are going to travel!\n        Visible tower states and cooldowns! Improved tower states prompt an ever-changing battle plan!\n        Displays money earned for each creep killed!\n    New and Improved UI changes:\n        Improved in-battle HUD\n        Animated briefings\n        Convenient level selection\n        Better help system\n    Towers change their appearance with updates\n    Various gameplay balance improvements. (See www.artofbytes.com for details.)\n\nWhat's in this version : (Updated : Aug 3, 2012)\n\n    NEW Gold Campaign level: Norway! (38th)\n\nRequired Android O/S : 2.1+\n","torrent":{"xt":"urn:btih:eaa73a394d0c941ebcf44ff0db1354b992e494de","amp;dn":"GRave+Defense+HD+v1.10.0+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eaa73a394d0c941ebcf44ff0db1354b992e494de","infoHashBuffer":{"type":"Buffer","data":[234,167,58,57,77,12,148,30,188,244,79,240,219,19,84,185,146,228,148,222]},"announce":[],"urlList":[]}}