{"title":"Banned BBC News Syrian Rebels Use Prisoners As Unwilling Suicide","uid":7565215,"size":48623104,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:eaedf723fd25c0baf3e16e0fa2fb60c26be4ba58&amp;dn=Banned+BBC+News+Syrian+Rebels+Use+Prisoners+As+Unwilling+Suicide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Tabbytha","files":1,"time":1345844902,"description":"This video is a CamStudio-ed copy of a now banned and pulled BBC news clip showing Syrian rebels tricking a prisoner, after he has been beaten, into driving to a government checkpost in a truck filled with explosives... lying to him, he thought he was being released in a prisoner exchange situation.\n\nI am sorry that the colours are off and that the quality is poor, I don't know how to get CamStudio to work right (And I am using an old computer)... CamStudio has done this to every video I have created.\n\nWhat this video shows id very disturbing and the Syrian rebels are working with Al Queada, who we used to be at &quot;war on terror&quot; against.. There are many other incidents in the press showing the Syrian rebels doing terrible things to people that are inhumane and cruel, but they are supposedly the freedom fighters. When are we going to putting up with these things? Why are we supporting terrorists and terror under the guise of humanitarianism and freedom fighting?\n\nI just had to make sure this video doesn't disappear. You can find it on alternative sites for now, and now here.","torrent":{"xt":"urn:btih:eaedf723fd25c0baf3e16e0fa2fb60c26be4ba58","amp;dn":"Banned+BBC+News+Syrian+Rebels+Use+Prisoners+As+Unwilling+Suicide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eaedf723fd25c0baf3e16e0fa2fb60c26be4ba58","infoHashBuffer":{"type":"Buffer","data":[234,237,247,35,253,37,192,186,243,225,110,15,162,251,96,194,107,228,186,88]},"announce":[],"urlList":[]}}