{"title":"La collectionneuse (1967) Eric Rohmer","uid":7560222,"size":4692508172,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ebd63d687e54300d2d108e4c34f9f1f349d25f6c&amp;dn=La+collectionneuse+%281967%29+Eric+Rohmer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":15,"time":1345680388,"description":"Adrien goes to a villa on the Mediterranean. He is in vacation, and wants to do absolutely nothing. He has to share the villa with a friend, Daniel, and an unknown young girl, Haydee. Haydee has a lot of lovers, and at first, Adrien and Daniel despites her. But Adrien will be more and more attracted by her. Written by Yepok \n\nThe arrogant and pretentious intellectual art dealer Adrien invites his girlfriend to travel with him to the coast to spend one month vacation with his close friend and painter Daniel in the house of their Randolphe. Adrien expects to do nothing but read and rest in the house and meet a possible investor in an art gallery that he dreams on having; however she prefers to travel to London. When he arrives, he discovers that the sexy and promiscuous pleasure-seeking Haydee that had one nightstand with Randolphe is sharing the house with Daniel. Along the days, Adrien becomes obsessed in a sick game of humiliating Haydee and imaging that she is trying to seduce him; however, his lust for her increases but his moral rationalization of their possible relationship keeps them apart. Written by Claudio Carvalho, Rio de Janeiro, Brazil\n","torrent":{"xt":"urn:btih:ebd63d687e54300d2d108e4c34f9f1f349d25f6c","amp;dn":"La+collectionneuse+%281967%29+Eric+Rohmer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebd63d687e54300d2d108e4c34f9f1f349d25f6c","infoHashBuffer":{"type":"Buffer","data":[235,214,61,104,126,84,48,13,45,16,142,76,52,249,241,243,73,210,95,108]},"announce":[],"urlList":[]}}