{"title":"Hotspot Shield VPN v0.5.2 By bobiras2009","uid":7590954,"size":1588169,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:ec7515a7a585b5301d3da26ade3dac01d705ed61&amp;dn=Hotspot+Shield+VPN+v0.5.2+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346539132,"description":"                                    By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nRequirements: Android 2.0 - 4.1\nOverview: FREE VPN for your Android Device! with Unlimited Bandwidth!\n\n\nCurrently supports Android 2.x/4x OS devices only.\nHotspot Shield for Android provides the same great features as our popular desktop software which has been downloaded 60 million times:\nPROVIDES INTERNET SECURITY &amp; PRIVACY: protect yourself in Wi-Fi hotspots (VPN encrypts all traffic); protect your identity and your IP address to stop unwanted tracking.\nGIVES YOU ACCESS to your favorite sites: Unblock any blocked content and services--get Facebook, Skype, YouTube, Flickr and other sites wherever you are.\nBLOCKS &amp; NOTIFIES you of spam, phishing and rogue websites. (ELITE subscription* only)\n\nSAVES YOU $$$: Hotspot Shield Bandwidth Compression speeds up browsing and shows you how much you saved on your data plan. Hotspot Shield has already saved 37 million MB of bandwidth for its mobile users. (ELITE subscription only)\nOFFER MARKETPLACE: Gives you opportunity to download apps, complete easy offers and surveys to get Hotspot Shield ELITE for Android or desktop and hundreds of other items like gift cards and Facebook credits absolutely free!\n*Monthly and Annual ELITE Subscriptions Available. All subscriptions provide Unlimited VPN Bandwidth and No Ads.\n\nNOTE: Before starting Hotspot Shield VPN - if you have other installed VPN clients, please be sure that they are disconnected.\nNOTE: If you see the &quot;Uninstall&quot; button on the application main screen and if you plan to uninstall the app - please tap on this button to uninstall the application. If there is no &quot;Uninstall&quot; button on the screen - please use your usual way to uninstall application.\nNote: Application doesn't work on Amazon Kindle.\n\n                 \n                                  By bobiras2009\t","torrent":{"xt":"urn:btih:ec7515a7a585b5301d3da26ade3dac01d705ed61","amp;dn":"Hotspot+Shield+VPN+v0.5.2+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec7515a7a585b5301d3da26ade3dac01d705ed61","infoHashBuffer":{"type":"Buffer","data":[236,117,21,167,165,133,181,48,29,61,162,106,222,61,172,1,215,5,237,97]},"announce":[],"urlList":[]}}