{"title":"(Blues) Etta Britt - Out Of The Shadows","uid":7508019,"size":123806695,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ecd87d9b4afec44e8a837c911e6aed27e2f3690e&amp;dn=%28Blues%29+Etta+Britt+-+Out+Of+The+Shadows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"nightissuchproximity","files":15,"time":1344238441,"description":"Label: Wrinkled Records\nGenre: Blues, Contemporary Blues Vocals\nQuality: Mp3\nBitrate: 320 kbps\nTotal Time: 51:06 Min\nTotal Size: 124 Mb\n\n\nTracklist:\n\n1. Dog Wants In\n2. High\n3. The Chokin' Kind\n4. Leap of Faith (feat. Delbert Mc Clinton)\n5. In The Tears\n6. I Believe\n7. Quiet House\n8. The Long Haul\n9. Make It Fast\n10. Fallin'\n11. The Bigger The Love (The Harder The Fall)\n12. She's Eighteen\n\nEtta Britt may not be a name you know, but you have certainly heard her work. She's been a staple session singer of the Nashville scene for decades and has shared a studio or a stage with everyone from Waylon Jennings to Engelbert Humperdinck. She was also part of the country act Dave &amp; Sugar from 1979 to 1985 they were nominated for CMA vocal group of the year five times in a row during her stint with them. Despite being a card-carrying member of the Nashville scene (she's also married to Bob Britt session guitarist for Bob Dylan, Wynonna, John Fogerty...my God, the list goes on and on...), she is just now putting out her very first solo record, so appropriately titled Out of the Shadows. Etta has found a new home with nascent Nashville label, Wrinkled Records and we are finally getting the chance to hear her out front and in the spotlight. The album is the perfect mix of choice covers like the heartbreaking Harlan Howard tune Chokin' Kind and songs penned by Britt herself. Her song She's Eighteen really steals the show with its poignant account of a massive argument between Britt and her 18-year-old daughter. Though she cut her teeth on Nashville country, Shadows is steeped in blues and soul. And to top it all off, she duets with blues legend Delbert McClinton (and has several upcoming dates booked with him).\n\n","torrent":{"xt":"urn:btih:ecd87d9b4afec44e8a837c911e6aed27e2f3690e","amp;dn":"%28Blues%29+Etta+Britt+-+Out+Of+The+Shadows","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecd87d9b4afec44e8a837c911e6aed27e2f3690e","infoHashBuffer":{"type":"Buffer","data":[236,216,125,155,74,254,196,78,138,131,124,145,30,106,237,39,226,243,105,14]},"announce":[],"urlList":[]}}