{"title":"Transparent Screen through Cam v1.08 Final By bobiras2009","uid":7607362,"size":523690,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:ed456510a35277c785d7aa659496a3e862468284&amp;dn=Transparent+Screen+through+Cam+v1.08+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346972863,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nRequirements: Android 2.1+\nOverview: Turn your phone to transparent phone with camera.WOW your friend with this app. This app can make your phone like a transparent phone with your camera, you can wow your friend with this app. \n\n\nTurn your phone to transparent phone with camera.WOW your friend with this app.\n\nThis app can make your phone like a transparent phone with your camera, you can wow your friend with this app.\n\nWhy this app need system permission and phone call permission?\n[Answer:]system permission is help to display the preview overlay in your screen. phone call permission is used to hide this app icon in your phone.\n\nThere are already several apps like this app, but I add more functions, the difference between this app and other similar apps:\n1. Support front camera, when you read some text or book, you can see who is coming back to you through your transparent screen.\n\n2. You can take pictures while you are using this function.\n\n3. !!!!You also can hide the app icon in your phone, nobody can know you have installed this app.!!!\n\n4. It also can hide the picture you have snap into some magic pictures, this feature is really cool.\n\n5. You do not need to root your phone, you can use the silent camera function. It can remove camera sound in a special way.\n\n6. Auto-snap, you do not need to press any button, just hold your phone.\n\n7. Some other features like tuning the transparency level, vibrate during taking picture, password protect etc.\n\n\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:ed456510a35277c785d7aa659496a3e862468284","amp;dn":"Transparent+Screen+through+Cam+v1.08+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed456510a35277c785d7aa659496a3e862468284","infoHashBuffer":{"type":"Buffer","data":[237,69,101,16,163,82,119,199,133,215,170,101,148,150,163,232,98,70,130,132]},"announce":[],"urlList":[]}}