{"title":"Computer Boy [2000]","uid":7576803,"size":111861362,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:ee45e4f02ecb76cc5c030d8c25a99590bd0c621b&amp;dn=Computer+Boy+%5B2000%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BROKENgerbil","files":1,"time":1346133895,"description":"NOT FILMED WITH HANDHELD, BUT HAD FILE SIZE ERROR. SHOULD BE 'MOVIE'\n\nA comedic parody of The Matrix by Abe Forsyth. Made in 2000 in Sydney, Australia.\nIt's hard to find and worth the hunt, whether you are a hardcore Matrix fan, someone who hates The Matrix, or have never even seen it.\n\nHere's a review by a viewer from http://www.imdb.com/title/tt0388850/\n\n[i]Abe Forsythe is a parodic genius. Taking the best of &quot;The Matrix&quot;, the worst of Keanu Reeves, blending it together, and throwing in about a dozen McDonald's references... this is the ultimate parody. Unlike cheap knock-offs like &quot;Scary Movie&quot;, this one really has a story that carries it and a cast that can deliver the humor without resorting to crude sexual humor (though there are some fart jokes).\n\nFrom what I hear, this film never made it past the Internet stage due to copyright issues with McDonald's. Well, I'm sorry... that's just stupid. First of all, nothing about McDonald's is said that is damaging to the company. And second, the brand is so ubiquitous, that it's no surprise that it would end up in a film... so I don't think people would be confused and assume they endorsed this one.\n\nRegardless, this is obviously made by people who loved &quot;The Matrix&quot;, not people trying to trash it.\n\n8/10[/i]\n\nDownload, share, enjoy!\n","torrent":{"xt":"urn:btih:ee45e4f02ecb76cc5c030d8c25a99590bd0c621b","amp;dn":"Computer+Boy+%5B2000%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee45e4f02ecb76cc5c030d8c25a99590bd0c621b","infoHashBuffer":{"type":"Buffer","data":[238,69,228,240,46,203,118,204,92,3,13,140,37,169,149,144,189,12,98,27]},"announce":[],"urlList":[]}}