{"title":"Trainz Driver v1.0.1 Final + SD Data By bobiras2009","uid":7547434,"size":236712604,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:ee774bef1b0dd8abafb3882aee3cb8c489439bbb&amp;dn=Trainz+Driver+v1.0.1+Final+%2B+SD+Data+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1345392198,"description":"                                  By bobiras2009\t\n\nAll must read this:\n\nTrainz Driver v1.0.1 Final + SD Data By bobiras2009.txt\n\n\nThe #1 Ranked &quot;Trainz Simulator&quot; app has now been customized for Phones. Trainz Driver really delivers the goods!\nIt's time to pack more horsepower in your pocket and take Trainz Driver with you everywhere you go. With a new user interface, controls, and a mix of realistic routes and arcade style sessions, there is something for everyone with Trainz Driver.\n\nTrainz Driver puts you in the cab of a variety of locomotives from around the world. Choose from the &quot;Easy Mode&quot; speed controls, or the more advanced &quot;Realistic Mode&quot; control system. With multiple camera modes you can fly alongside your favourite train, admire the view from the cab, or watch from trackside all while you interact with industries and passenger stations, picking up and dropping off freight wagons, people, and more!\n\nExpand your experience: You can also create your own Routes and Sessions in Trainz Simulator for Tablet devices (available for separate purchase on Google Play) and then share them with Trainz Driver users through the Download Station. Hundreds of user-created routes are already available, free to download.\n\nPLEASE NOTE - Ice Cream Sandwich Devices\n\n    There is a bug in the Mali400 GPU Ice Cream Sandwich drivers which affects all devices running ICS with a Mali400 GPU. (This includes most newer Samsung devices).\n    We are working hard to work around the issue.\n    If anyone is experiencing crashes on a device with the Mali400 GPU, please contact support so we can get more information and try to resolve this issue.\n    There may have been a driver fix in Android 4.0.4 which resolves this problem, but we cannot confirm this. \n\nWhat's in this version : (Updated : )\n\n    Fix for saving sessions with non-default name.\n    Fix for startup problem on some devices.\n    Workaround for Mali400 driver crash bug. (Note we have unsubstanciated reports that the Mali400 driver crash has been fixed in Android 4.0.4).\n\nRequired Android O/S : 2.3+\n\n\n\n                                  By bobiras2009\t","torrent":{"xt":"urn:btih:ee774bef1b0dd8abafb3882aee3cb8c489439bbb","amp;dn":"Trainz+Driver+v1.0.1+Final+%2B+SD+Data+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee774bef1b0dd8abafb3882aee3cb8c489439bbb","infoHashBuffer":{"type":"Buffer","data":[238,119,75,239,27,13,216,171,175,179,136,42,238,60,184,196,137,67,155,187]},"announce":[],"urlList":[]}}