{"title":"Molti sogni per le strade (1948)","uid":7556471,"size":4518238208,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ee7ab454af59a6d44b041512417ee58acecd87b2&amp;dn=Molti+sogni+per+le+strade+%281948%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"andreydh","files":10,"time":1345629022,"description":"La Magnani's road movie! An overlooked little gem of a film where the sensational actress is at the top of her game ,with effective support by Massimo Girotti.\n\nLa Magnani often portrayed humble people, women of the people, and in the context of the Italian neorealism, she became a legend.\n\nI wonder whether the last lines (a voice over) are not ironical: they talk about urban life, and the relationship with the inhabitants. The beginning of the film shows a starving family (husband,wife,kid). Mario Camerini has a good sense of balance: he never sinks into miserabilism, in his movie, drama walks hand in hand with a good sense of humor. The little boy-like in &quot;the bicycle thief&quot;- sees his parents' plight, his mother who can't buy him an ice cream but gives him a lollipop, his washout of a father, scrounging for their next meal...\n\nThe title says it all: &quot;many a dream on the road&quot;. The car the dad stole is a way to escape from a hopeless city where hunger, unemployment and humiliation awaits, in the years just after WW2. As soon as they are on the road, we feel that the family and their friend are on their way to some kind of freedom, but it's many a mile to it: the episodes may be very funny particularly the scenes when the buyer wants to confess (a miracle,God and Virgin Mary be blessed). All they do seems to backfire on them...\n\nLa Magnani was unique.","torrent":{"xt":"urn:btih:ee7ab454af59a6d44b041512417ee58acecd87b2","amp;dn":"Molti+sogni+per+le+strade+%281948%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee7ab454af59a6d44b041512417ee58acecd87b2","infoHashBuffer":{"type":"Buffer","data":[238,122,180,84,175,89,166,212,75,4,21,18,65,126,229,138,206,205,135,178]},"announce":[],"urlList":[]}}