{"title":"ExploitedCollegeGirls - Allison","uid":7432153,"size":783403481,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ee7c2a06ac9ab9794e3785bf0613b1dc9a25379a&amp;dn=ExploitedCollegeGirls+-+Allison&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Xavier461","files":1,"time":1341974696,"description":"Screenshots\n &lt;a href=&quot;\nhttp://imagetwitch.com/exploitedcollegegirls-allison/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagetwitch.com/exploitedcollegegirls-allison/&lt;/a&gt;\n\n\n\nSize: 783403481 bytes (747.11 MiB), duration: 00:54:42, avg.bitrate: 1910 kb/s\nAudio: wmav2, 44100 Hz, stereo, 96 kb/s\nVideo: wmv3, yuv420p, 640x360, 1800 kb/s, 29.97 fps\n\n\nSchool: Long Beach State\nYear: Freshman\nAge: 18\nHeight: 6'\nFigure: 36D-30-32\nEyeColor: Blue\nFavorite Sexual Position: Rough and Hard\nHobbies: Making out with Bailey\nABOUT\n\nRemember when Bailey talked about that girlfriend she makes out with and who was wanting to do a porn video too? Well, you didn't expect I just let that one go, did ya? LOL! And Bailey was right: her friend, 18 year old Alison, is as horny and dirty as promised - and then some!\nAlison is the kind of chick who is up for anything - a few minutes after picking her up she is flashing her big, all natural 36D tits at other drivers, and blows my cock while I'm driving without as much as a second of hesitation. I was thinking this is too fucking good to keep going like this so it all would just go downhill from there, right? Oh hell now, Alison just got started. As she puts it, she is &quot;made for sex&quot;.\nWhen we arrived at my place we do the interview and you won't believe the dirty things you'll hear coming out of this (seemingly) sweet and innocent girl. Her favorite sexual fantasy? Holy hell - even I was stumped!\nI have her look at a porn magazine and she gets visibly turned on by what she sees. And so am I, especially when Alison strips again and shakes those massive tits in my face. I just had to have her blow me again and fuck her right then and there. The little whore does some sort of black magic on my cock and I know she will have the same effect on you.\nAnyways, after that it's time to go upstairs to my Room of Doom to see how far Alison is really willing to go. You know what? It's fucking FAR.\nBailey had told her about how great the Rabbit vibrator is and Alison was really looking forward to getting off with it, too. She enjoys it so much that I keep it in her pussy and on her clit while I make her blow me, and even when I deep throat her. But that's only the warm-up. Alison is doing everything I want - everything. She said she loves hard and rough sex and that's what she's getting. I slap, choke, and fishook her as I'm fucking her as hard as possible, I make her lick my ass several times and yes she is fucking great at it, too. Deep-tongue in ass and everything. In fact she's so good at it I make her do it until I can't hold back any longer and shoot my load straight in her mouth. What didn't end up down her throat she just licks up, without being told to.\nI can only imagine Alison and Bailey getting together - two of the most perverted girls I've ever met (and that says something as you well know) can only mean a great fucking time. Literally. Maybe I get that arranged in the future too. In the meantime enjoy one of the most enthusiastic little college sluts in our lineup. I hope you stocked up on Kleenex because you're gonna need them all... ","torrent":{"xt":"urn:btih:ee7c2a06ac9ab9794e3785bf0613b1dc9a25379a","amp;dn":"ExploitedCollegeGirls+-+Allison","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee7c2a06ac9ab9794e3785bf0613b1dc9a25379a","infoHashBuffer":{"type":"Buffer","data":[238,124,42,6,172,154,185,121,78,55,133,191,6,19,177,220,154,37,55,154]},"announce":[],"urlList":[]}}