{"title":"Transparent Theme Go Launcher 1.0 Final By bobiras2009","uid":7605876,"size":1941342,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:eeb992666fd915b0b7e71987795b5e5fee3de9c9&amp;dn=Transparent+Theme+Go+Launcher+1.0+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346946303,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nRequirements: 2.0 and up\nOverview: The theme is completely transparent, so you can change the appearence of the theme just by using a different wallpaper.\n\n\n\nThe theme contains seven wallpaper, but you can choose everything you want.\nIn the screenshot is also displayed the &quot;Transparent Keyboard&quot; and you can find it on the android market.\nPlease leave a comment on the market.\n===================================================\nMAKE SURE GO LAUNCHER IS INSTALLED BEFORE THIS APP!\n===================================================\nThis theme requires GO Launcher EX to work - it is available free on the android market. If you encounter a screen that just says loading it is caused by Go Launcher being installed AFTER the app, uninstall both this theme and Go Launcher, restart your device and install Go Launcher THEN this app!\nHow to install;\n1. Install the most recent GO Launcher EX for free from the android market.\n2. On the home screen open the menu and tap themes, then select the Transparent theme.\n3.To set a wallpaper open the home screen menu, tap wallpaper and then GO Launcher and take your pick!\nTroubleshooting;\nIf the theme is stuck on loading and you are sure that you have installed the theme AFTER Go launcher then follow these instructions;\n1. Apply the theme normally (menu --&gt; Themes -- Transparent --&gt; Apply)\n2. Open up the theme menu again and without selecting a theme tap &quot;Setting&quot; in the bottom right\n3. Set each option to the Transparent Theme (For example tap Icons --&gt; Dock Icon --&gt; Transparent Theme will change the dock)\n4. If you change each setting it should fix the issue and the theme should work normally!\nIf you are still having issues with icons not changing then long press the app you wish to change the icon of, tap replace and choose Theme's Icon. Select Transparent in the top right and then choose the correct icon.\nIf you don't find the voice &quot;theme&quot;, open &quot;setting theme&quot; in app draw and search Transparent, click on the image and then apply.\nThe clock widget is &quot;Advanced Clock Widget&quot; and you can find it on the android market.\nFor other icons, wallpapers or questions contact me at gmail.\nKeywords: transparent theme; clear theme; white theme; blue theme; colorful theme; 3d; abstract theme; go launcher theme;\n\n\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:eeb992666fd915b0b7e71987795b5e5fee3de9c9","amp;dn":"Transparent+Theme+Go+Launcher+1.0+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eeb992666fd915b0b7e71987795b5e5fee3de9c9","infoHashBuffer":{"type":"Buffer","data":[238,185,146,102,111,217,21,176,183,231,25,135,121,91,94,95,238,61,233,201]},"announce":[],"urlList":[]}}