{"title":"David Colbert - The Magical Worlds of Harry Potter (ePub/mobi)","uid":7599334,"size":16883503,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef1d8870c794f495f7208699f8080fd731f14696&amp;dn=David+Colbert+-+The+Magical+Worlds+of+Harry+Potter+%28ePub%2Fmobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xemius","files":-1,"time":1346772008,"description":"Summary\nThe reasons why goblins make perfect bankers and witches have always flown on broomsticks isn't obvious from J. K. Rowling's Harry Potter books, but lucky for us, many baffling questions are answered in David Colbert's helpful guide to the myths, legends, and fascinating facts behind our favorite wizard's worlds.\nWith subjects in alphabetical order, this solid resource provides quick-reference explanations to all the creatures, spells, character names, and events. Each chapter starts off with a lead-in question, followed by two or more pages of description and additional interesting facts in the margins. Magical topics themselves range from divination to Manticores to wands, and the most basic information usually includes name origin, appropriate historical facts, and myths surrounding the subject. It's a lot to absorb, but thankfully the book also contains page-topic tabs, cross-references in the margins, and a thorough index for easy navigation.\n\nFormats provided are:\n.ePub -\nCompatible with most eReaders including the Apple iPad. If you wish to read .ePub doucuments on a Mac/PC I would recommend downloading Adobe Digital Editions. (Just google it and follow the instructions on the Adobe website.)\n.mobi -\nFor the Amazon kindle. Kindle for PC may also be available depending on your region.\n\nIf you like the book, support the author and buy it!","torrent":{"xt":"urn:btih:ef1d8870c794f495f7208699f8080fd731f14696","amp;dn":"David+Colbert+-+The+Magical+Worlds+of+Harry+Potter+%28ePub%2Fmobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef1d8870c794f495f7208699f8080fd731f14696","infoHashBuffer":{"type":"Buffer","data":[239,29,136,112,199,148,244,149,247,32,134,153,248,8,15,215,49,241,70,150]},"announce":[],"urlList":[]}}