{"title":"Run Rhythm Run (Heartbeat) [FLAC] {MKOP}","uid":7553837,"size":216709921,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f14d1165af70de96602c97613d55aceaa6b27e4e&amp;dn=Run+Rhythm+Run+%28Heartbeat%29+%5BFLAC%5D+%7BMKOP%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mudmashers","files":19,"time":1345554010,"description":"Run Rhythm Run: Rock Steady And Reggae Intrumentals From Treasure Isle (Heartbeat) [FLAC] {MKOP}\n\nVintage reggae reissues are notorious for a lack of concrete information in the liner notes, but this is even skimpier than most. All that's known is that these rocksteady instrumentals were produced by Duke Reid during the 1960s at Treasure Isle, and that the musicians included Tommy McCook &amp; the Supersonics and the Duke Reid Group. That means that although this is a various-artists compilation, there are no actual &quot;groups&quot; credited with the individual tracks; it's almost as if they were &quot;found&quot; riddim tracks. A little mystique isn't always a bad thing, though. What's important is that this is very good instrumental rocksteady, with lots of neat organ licks, squeaky violin, throbbing beats, and the occasional gripping guitar line. The more soul-inspired cuts sound something like a Jamaica-fied Booker T. &amp; the M.G.s. Despite the anonymity of the actual contributions, it's one of the better rocksteady compilations floating around, with decent sound considering the standards of the era.~Richie Unterberger (Allmusic)\n\nThis album should be a real treat for lovers of rock steady and early reggae instrumentals, as it collects largely hereto unreleased material from the vaults of Duke Reid's Treasure Isle studio.  Some tracks will likely sound familiar -- like &quot;Sure Shot&quot; (from the Techniques' &quot;Love Is Not a Gamble&quot;) and &quot;Sunday Walking&quot; (from Alton Ellis' &quot;Remember That Sunday&quot;) -- but even the ones you don't necessarily recognize -- like the '70s funk vibe of &quot;Psychedelic Reggae&quot; or the melancholy &quot;Sweet Lorna&quot; -- are splendid examples of yesteryear and are a testament to the fine musicianship coming out of Jamaica, here headed by Tommy McCook and the Supersonics.~Reggae Reviews\n\n01. Uncle Sam\n02. Caught You\n03. Sure Shot\n04. Sweet Lorna\n05. Bawling People\n06. Bang Belly\n07. Loving Serenade\n08. Psychedelic Reggae\n09. Nightful\n10. Rockin' Soul\n11. Stolen Stolen\n12. Macca Bacca\n13. Found Out\n14. Billy Joe\n15. Our Man Flint\n16. Sunday Walking\n17. Work Your Soul\n18. Moody\n\nMusic Keep On Playing*Thank You Seeders!","torrent":{"xt":"urn:btih:f14d1165af70de96602c97613d55aceaa6b27e4e","amp;dn":"Run+Rhythm+Run+%28Heartbeat%29+%5BFLAC%5D+%7BMKOP%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f14d1165af70de96602c97613d55aceaa6b27e4e","infoHashBuffer":{"type":"Buffer","data":[241,77,17,101,175,112,222,150,96,44,151,97,61,85,172,234,166,178,126,78]},"announce":[],"urlList":[]}}