{"title":"Max Payne Mobile v1.1 Android","uid":7550971,"size":25071325,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:f172136daad7f50e2f1a852ab3d4fa5de491599d&amp;dn=Max+Payne+Mobile+v1.1+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"neon","files":-1,"time":1345482166,"description":"Max Payne Mobile v1.1 play.google.com.rockstar.maxpayne\nA fugitive undercover cop framed for murder, hunted by cops and the mob, Max is a man with his back against the wall, fighting a battle he cannot hope to win. Max Payne is a relentless story-driven game about a man on the edge, fighting to clear his name while struggling to uncover the truth about his slain family amongst a myriad of plot-twists.\n\nThe groundbreaking original cinematic action-shooter, Max Payne introduced the concept of Bullet TimeÂ® in videogames. Through its stylish slow-motion gunplay combined with a dark and twisted story, Max Payne redefined the action-shooter genre.\n\nMax Payne Mobile for Android has been fully optimized for the NVIDIAÂ® TegraÂ® 3 quad-core mobile processor with additional antistrophic texture filtering and enhanced lighting effects providing one of the most visually immersive Max Payne Mobile experiences available.\n\nFeatures:\nMax Payne's signature slow motion gunplay, Bullet TimeÂ® \nStunningly sharp, HD quality resolution and textures\nGameplay tailored for touch screen devices\nHighly customizable controls \nMultiple aiming modes\nCompatible with the GameStop Wireless Game Controller and select USB gamepads\nIntegrated with Immersion Haptic Vibration Feedback\nTailor your visual experience with adjustable graphic settings \nUnlock cheats, track your stats and more with full Rockstar Games Social Club integration\nMax Payne Mobile is now available on:\nAndroid Phones: \nMotorola Razr, Razr Maxx, Motorola Atrix, Motorola Photon, Motorola Droid Bionic, HTC Rezound, HTC One X, HTC One S, HTC Evo 3D, HTC Sensation, HTC Droid Incredible 2, Samsung Galaxy Nexus, Samsung Nexus S, Samsung Galaxy Note, Samsung S2, Samsung Galaxy R, Sony Xperia Play, Sony Xperia S, Sony Walkman Z Series Media Player\nAndroid Tablets: \nAcer Iconia, Asus Eee Pad Transformer, Asus Eee Pad Transformer Prime, LG Optimus Pad, Medion Lifetab, Motorola Xoom, Samsung Galaxy Tab 8.9 / 10.1, Sony Tablet S, Sony Tablet P, Toshiba Thrive, HTC Flyer, HTC Jetstream\nFor those using the &quot;Skip to Level&quot; cheat, we recommend that you have weapons in your inventory; as you will start a new level with your current weapon set.\n\nLanguages Supported: English, French, Italian, German, Spanish, Russian and Japanese.\n\nPlease ensure you have at least 1.33 GB of free space before installing Max Payne Mobile.\n\nFind out more about Max Payne 3: http://www.rockstargames.com/maxpayne3\n\nWhat's in this version: (Updated : Aug 16, 2012)\nFixed white screen issue caused by the EULA not loading in properly\nVarious crash fixes","torrent":{"xt":"urn:btih:f172136daad7f50e2f1a852ab3d4fa5de491599d","amp;dn":"Max+Payne+Mobile+v1.1+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f172136daad7f50e2f1a852ab3d4fa5de491599d","infoHashBuffer":{"type":"Buffer","data":[241,114,19,109,170,215,245,14,47,26,133,42,179,212,250,93,228,145,89,157]},"announce":[],"urlList":[]}}