{"title":"Construction Calc Pro v4.3.9 Final By bobiras2009","uid":7611631,"size":668608,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f1c0f67f8399852b45e2490af5d71608b05a9468&amp;dn=Construction+Calc+Pro+v4.3.9+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1347081973,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\nRequirements: Android 2.1+\nOverview: HE MOST ACCURATE AND EASY TO USE CONSTRUCTION CALCULATOR ON ANDROID!\n*GOOGLE PLAY - 4.5 STAR RATING*\n\n\n48 Tried and tested construction formula's in one app. These calculations have been tried and tested by professional tradespeople for over a decade.\nCalculate materials, area, volumes, angles and measurements to save you time and make your life easier. The ideal handy pocket companion for anyone in the construction industry.\nMORE ACCURATE THAN ANY OTHER APP - Our formula's are tried and tested and are more accurate than any other mobile application.\n----------------------\nHIGHLIGHTS\n----------------------\nSUPER ACCURATE - Formula's have been perfected by professional tradespeople for over a decade.\nSUPER EASY - No complicated manual to master. Enter measurements, quantities, area and angles and get instant answers.\nINSTRUCTIONAL DIAGRAMS - Easy to understand with handy visual aids\nHIGH VISIBILITY IN DIRECT SUNLIGHT - White on black text, with blue and orange inputs and outputs for high visibility in direct sunlight.\nMETRIC AND FEET/INCHES INPUTS - Enter measurements in either unit of measure. (Switch between the two using the menu button)\nAUTOMATIC UPDATES - Get all updates and new calculations added automatically.\n\n----------------------\nDEVELOPMENT\n----------------------\nConstruction Calc Pro has taken 5 months and 12,300 lines of code to develop. New calculator updates and calculators are free and automatically updated via Google Play.\n----------------------\n\nWhat's in this version:\n18th June - Improved legibility of outputs - implemented autoshrinking of multi-line outputs to fit available space. Increased outputs box width by 3%.\n17th June - Added 3 points decimal precision for Rise/Run/Angle calculator\n15th June - Added Stairs calculator diagram\n14th June - Added Backfill On Slope calculator\n13th June - Added Grade From Slope calculator\n12th June - Added Rebar Weight calculator\n11th June - Added Wire Mesh calculator\n9th June - Added Concrete Post Holes calculator\n\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:f1c0f67f8399852b45e2490af5d71608b05a9468","amp;dn":"Construction+Calc+Pro+v4.3.9+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1c0f67f8399852b45e2490af5d71608b05a9468","infoHashBuffer":{"type":"Buffer","data":[241,192,246,127,131,153,133,43,69,226,73,10,245,215,22,8,176,90,148,104]},"announce":[],"urlList":[]}}