{"title":"THE EXPENDABLES 2 xvid cam GLOBE","uid":7553633,"size":1113375851,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f2a2e5dd7fe92dee6b70711cbd867674947232e6&amp;dn=THE+EXPENDABLES+2+xvid+cam+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1345547355,"description":"* XVID CAM  * 01H30M32S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n* Plot :\n\nThe Expendables are deployed to Nepal in order to rescue a Chinese businessman. The team consists of leader Barney Ross (Sylvester Stallone), former SAS soldier and blades specialist Lee Christmas (Jason Statham), martial artist Yin Yang (Jet Li), weapons specialist Hale Caesar (Terry Crews), demolitions expert Toll Road (Randy Couture), and snipers Gunner Jensen (Dolph Lundgren) and Billy the Kid (Liam Hemsworth), the group's youngest and newest member. The mercenaries rescue the businessman, as well as Trench (Arnold Schwarzenegger), Ross's rival. Yang accompanies the businessman in his return to China, and temporarily departs from the group.\n\nAfterwards, Ross is forced to accept a mission from Mr. Church (Bruce Willis) to retrieve an item from a safe from an airplane that was shot down in Albania. The team, accompanied by tech genius Maggie (Yu Nan), retrieve the item from the airplane. However, their victory is short-lived. Billy is captured by Jean Vilain (Jean-Claude Van Damme), who demands the item in return for Billy's life. The Expendables surrender the item, however Vilain roundhouse kicks the knife into Billy's heart anyway and leaves. Billy survives just long enought to ask Barney to look in his pocket. Barney finds and reads aloud the letter meant for Billy's girlfriend. The group buries Billy and swears revenge on Vilain. Maggie reveals the item on the plane was a computer containing a blueprint to an abandoned Soviet Union mine which stores five tons of plutonium. Vilain, along with his right-hand man Hector (Scott Adkins), intends to retrieve the plutonium and sell it..\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:f2a2e5dd7fe92dee6b70711cbd867674947232e6","amp;dn":"THE+EXPENDABLES+2+xvid+cam+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2a2e5dd7fe92dee6b70711cbd867674947232e6","infoHashBuffer":{"type":"Buffer","data":[242,162,229,221,127,233,45,238,107,112,113,28,189,134,118,116,148,114,50,230]},"announce":[],"urlList":[]}}