{"title":"1967 Year that Transformed the Middle East.mobi","uid":7601196,"size":4279926,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f41e6cf38362824ad1b10cc9df167f27330392ac&amp;dn=1967+Year+that+Transformed+the+Middle+East.mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fuctyou","files":-1,"time":1346828042,"description":"1967: Israel, the War, and the Year that Transformed the Middle East by Tom Segev\n\nMetropolitan Books | 2007 | ISBN: 0805070575 | English | 688 pages | EPUB + MOBI | 4.60 MB + 4.10 MB\n\n From Israel's leading historian, a sweeping history of 1967--the war, what led up to it, what came after, and how it changed everything\n\n Tom Segev's acclaimed works One Palestine, Complete and The Seventh Million overturned accepted views of the history of Israel. Now, in 1967--a number-one bestseller in Hebrew--he brings his masterful skills to the watershed year when six days of war reshaped the country and the entire region.\n \nGoing far beyond a military account, Segev re-creates the crisis in Israel before 1967, showing how economic recession, a full grasp of the Holocaust's horrors, and the dire threats made by neighbor states combined to produce a climate of apocalypse. He depicts the country's bravado after its victory, the mood revealed in a popular joke in which one soldier says to his friend, &quot;Let's take over Cairo&quot;; the friend replies, &quot;Then what shall we do in the afternoon?&quot;\n \nDrawing on unpublished letters and diaries, as well as government memos and military records, Segev reconstructs an era of new possibilities and tragic missteps. He introduces the legendary figures--Moshe Dayan, Golda Meir, Gamal Abdul Nasser, and Lyndon Johnson--and an epic cast of soldiers, lobbyists, refugees, and settlers. He reveals as never before Israel's intimacy with the White House as well as the political rivalries that sabotaged any chance of peace. Above all, he challenges the view that the war was inevitable, showing that a series of disastrous miscalculations lie behind the bloodshed.\n \nA vibrant and original history, 1967 is sure to stand as the definitive account of that pivotal year.\n ","torrent":{"xt":"urn:btih:f41e6cf38362824ad1b10cc9df167f27330392ac","amp;dn":"1967+Year+that+Transformed+the+Middle+East.mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f41e6cf38362824ad1b10cc9df167f27330392ac","infoHashBuffer":{"type":"Buffer","data":[244,30,108,243,131,98,130,74,209,177,12,201,223,22,127,39,51,3,146,172]},"announce":[],"urlList":[]}}