{"title":"Jim Hansen - How we can save our children's future - MP3","uid":7576429,"size":11886883,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f509b51c66fbf1327f48a4e0475502011f31c770&amp;dn=Jim+Hansen+-+How+we+can+save+our+children%27s+future+-+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"UnviolentPeacemaker","files":3,"time":1346125123,"description":"NOTE:  This is read with a high quality electronic voice.  Dont like it? Dont download it.  Dont get in the way.\n\n\nThis is from Chapter 9, 'Storms of My Grandchildren.'\n\nIf the next billions of kids on earth were your kids, who would you select as their global 'doctor' for curing the destruction of their future from climate change?  There is only 1 obvious, qualified choice.  He's been correct, and ahead of everyone, in every field, for more than 30 years. He's been alone in putting life and limb on the line to bring the needed changes, in time.\n\nHe is shy, retiring, humble, but he also has an ego the size of Manhattan, and it comes out sometimes, and gets in the way of his essential message.  Maybe he is to be forgiven.  He does know an awful lot, and like to share it and have others see how much he knows.  But it puts off many, and draws ridicule from the deniers on the right, that rather than know a lot themselves, bullies in the school yard that they are, they just find cheap ways of tearing down others.  \n\nIn any case, Jim Hansen is the one that you, I, anyone sane, would want as the lead 'doctor' on the case of curing the environmental destruction, global warming, that is currently in the final stages of ravaging your children's future.\n\nHere it is - out of all of his talks and papers the last 30 years, this section from chapter 9 of 'Storms of my children,' here's the bottom line on what you need to make happen.\n","torrent":{"xt":"urn:btih:f509b51c66fbf1327f48a4e0475502011f31c770","amp;dn":"Jim+Hansen+-+How+we+can+save+our+children%27s+future+-+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f509b51c66fbf1327f48a4e0475502011f31c770","infoHashBuffer":{"type":"Buffer","data":[245,9,181,28,102,251,241,50,127,72,164,224,71,85,2,1,31,49,199,112]},"announce":[],"urlList":[]}}