{"title":"Beautiful Widgets v4.11.1 Final By bobiras2009","uid":7477513,"size":5232255,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f92678c9e6dac0cc88b33d2e70f9f394efceed87&amp;dn=Beautiful+Widgets+v4.11.1+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1343329815,"description":"Beautiful set of Widgets containing clock widget, clock and weather widget, weather widgets, date widgets and toggle widgets with skins/themes support!\nSelected by Google as an Android Editor's choice and first paid application to reach 1 million of downloads! What a success driven by its community!\n\nSee why it is the best Android clock and weather widgets and the only choice for thousands of users! You probably heard of Beautiful Widgets before!\n\nNow with Honeycomb tablets support (ie the Motorola Xoom, Galaxy Tab)!\n\n    High Definition Super Clock HD widgets available in many sizes and many layouts (also resizable on Android &gt; 3.0). High quality rendering and resizable with no loss of quality! \n    Display either the weather, battery icon (both with skins) or just a clock on the widget.\n    5 days Weather Forecast based on Google weather or Accuweather, with Geolocation support, automatic sunset/sunrise, also available on a weather only widget.\n    Support multiple locations for the forecast, so you always know the weather for any others places\n    Weather alerts (USA only), storm/rain/snow forecasts\n    More than 15 nice Weather Animations (rain, storm, etc) for your pleasure when tapping the weather icon from the widgets.\n    Moon phases, actual and a calendar for the next 4/5 phases\n    Nice toggle widgets for Wifi, Bluetooth, Mobile, Brightness, GPS (shortcut), Silent, Vibrate, Plane Mode, 4G (only for a few HTC devices), Rotate, Pattern (below android 2.2) and a Timed Silence!\n    More than 1000+ FREE Skins/Themes to changes the look and feel of you clock, weather icons or toggle buttons ! Impress your friends with your clock widget!\n    Weather Live Wallpaper OpenGL accelerated (for supported devices only) which allow to display the weather live from your wallpaper, with many effects, physics and interactions! \n    Auto-refresh weather on widgets when your phone is unlocked\n    Define applications to launch when tapping the hours, date or forecast details from the widgets so you can access the most important applications very easy from our beautiful widgets.\n    Introducing Beautiful Today widget which display the date using the same look as the Super Clock\n    Temperature displayed in your notification bar, with access to the weather forecast. Now with the Ice Cream Sandwich look &amp; feel if you are on Android 4.0!\n    Web Skin Market with cloud to device communication: browse skins from your computer and apply it directly to your phone along with a new wallpaper!\n    Web Skin Mixer: create your own customized skins from the elements of the others skins\n    Many options in order to create your own experience!\n\nDetails:\n\n    Super Clock HD widget with weather, battery or just the clock 4x3 4x2 4x1 2x1 5x3\n    Weather only widget 4x1 1x1\n    Battery widget 1x1\n    Date widget 2x1 1x1\n    Text Clock simple widget 2x1\n    Toggles widgets 1x1\n    Home widgets with clock and weather and 300 skins 4x1 2x1\n\nWhat's in this version: (Updated : Jul 26, 2012)\n\n    Fix transparent list element\n\nRequired Android O/S : 1.6+","torrent":{"xt":"urn:btih:f92678c9e6dac0cc88b33d2e70f9f394efceed87","amp;dn":"Beautiful+Widgets+v4.11.1+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f92678c9e6dac0cc88b33d2e70f9f394efceed87","infoHashBuffer":{"type":"Buffer","data":[249,38,120,201,230,218,192,204,136,179,61,46,112,249,243,148,239,206,237,135]},"announce":[],"urlList":[]}}