{"title":"Sexually Broken---Girl Next Door Sexually Destroyed  Audrey Rose","uid":7583450,"size":968571516,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:f9c7819e8db7ee5aa01ddd28c01dfaf0b78a37f3&amp;dn=Sexually+Broken---Girl+Next+Door+Sexually+Destroyed++Audrey+Rose&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":-1,"time":1346349146,"description":"Cute Girl Next Door Sexually Destroyed, Eyes Rolling Back into Head During Massive Orgasms! | Audrey Rose | Matt Williams \n\nAugust 29, 2012 \n \n   \nMP4 + Pics.  \n    \n \nWelcome back the beautiful Audrey Rose to Sexually Broken. Audrey is that cute girl next door who in a million years, you would never guess loves to be bound dominated, fucked and made to cum until her eyes roll up into the back of her head and drool runs down her body, but there it is.\n\nDressed in a stunning pull over and boots that she wore to the studio, we waste no time tying Audrey up very tightly. Unlike, well, every other bondage site on the net we do all our tying for this scene on camera. Audrey's elbows and wrist are quickly bound, and a big ring gag is placed in her huge mouth. With her mouth held open and her arms brutal bound behind her, Audrey can do nothing as the cock slides in her mouth and fucks the back of her throat.\n\nAudrey is helpless as we deep throat her face. The cock goes deep and cuts off her breathing, we hold it there and she is at our mercy for air. We are rough with her, very rough, she struggle for air, she fights for control but we own her with our cock and she knows fear. \n\nLoopy from breath play and already in subspace we pull Audrey to her feet, yank her panties to her knees, bend her over, and within seconds of fucking her deep and hard from behind, Audrey cums and cums hard. She is now a helpless slut, her brain flooded with endorphins, she is ours to abuse. With her breasts tightly bound and her huge nipples at attention, we strappado her against a post and skull fuck her until her brain flashes, now she is in survival mode.\n\nWe vibrate her to multiple devastating orgasms, one after another. Her eyes roll up into the back of her head and she screams primordially, hoping against all hope that we show mercy, we do not...  \n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_29audrey/SexuallyBroken-Audrey-Rose-Matt-Williams-Cute-Girl-Next-Door-Sexually-Destroyed-Eyes-Rolling-Back-into-Head-During-Massive-Orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/08_29audrey/SexuallyBroken-Audrey-Rose-Matt-Williams-Cute-Girl-Next-Door-Sexually-Destroyed-Eyes-Rolling-Back-into-Head-During-Massive-Orgasms.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n\nCheers  :-) \n\n","torrent":{"xt":"urn:btih:f9c7819e8db7ee5aa01ddd28c01dfaf0b78a37f3","amp;dn":"Sexually+Broken---Girl+Next+Door+Sexually+Destroyed++Audrey+Rose","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9c7819e8db7ee5aa01ddd28c01dfaf0b78a37f3","infoHashBuffer":{"type":"Buffer","data":[249,199,129,158,141,183,238,90,160,29,221,40,192,29,250,240,183,138,55,243]},"announce":[],"urlList":[]}}