{"title":"OfficeSuite Pro 6 (PDF AND HD) v6.5.948 Final By bobiras2009","uid":7596057,"size":16595610,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f9efb64d7fb96ca16c5c8b74058f08f4247208ab&amp;dn=OfficeSuite+Pro+6+%28PDF+AND+HD%29+v6.5.948+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346698162,"description":"                                    By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nRequirements: Android 1.5 and up\nOverview: View, Edit and Share your office documents on the go! OfficeSuite 5 out now!\n\n\n\nCreate, view, edit and share Microsoft Word, Excel and PowerPoint files and attachments and view PDF files on your Android based phone with a single complete feature-rich mobile office solution. Now also on Android Honeycomb. The software utilizes the most commonly used desktop document formats and also includes a File Browser and integration with Google Docs to help you manage your local, remote files and email attachments. OfficeSuite Pro is an essential productivity application offering greater office efficiency than ever anywhere, anytime.\n\nOfficeSuite 5 New Features\n* Completely redesigned and improved user interface and experience\n* Recent Files and My documents shortcuts in the File Browser allowing more efficient access to documents\n* Filters in the file browser to help you quickly access files from selected format\n* Intuitive toolbars added in the File Browser, the document and spreadsheet modules\n* Two pane user interface on Android 3.0 Honeycomb devices\n* Support for EML and RTF file formats\n* Direct Save of text documents in Google Docs\n* Email reader module allowing you to work with EML Outlook files\n\nLanguage Support\nEnglish, French, Italian, German, Spanish, Japanese, Chinese Traditional, Chinese Simplified, Swedish, Russian and Korean\n\nWhat's in this version:\n6.5 New Features:\n* Print - print documents with Google Cloud Print or previously installed third party printer\n* Convert to PDF - convert your text documents to PDF files\n* Spell-check (based on Google ICS spell-check)\n* New supported formats - opening of XLSM, PPTM, PPSM and DOCM formats\n* Thumbnail preview in Slideshow mode\n* Animated Slideshow -support for animated slideshows\n* Embedded images &amp; charts (in Excel module)\n* Now compatible with Microsoft SkyDrive\n* WiFi Direct support\n\n\n\n                                    By bobiras2009\t","torrent":{"xt":"urn:btih:f9efb64d7fb96ca16c5c8b74058f08f4247208ab","amp;dn":"OfficeSuite+Pro+6+%28PDF+AND+HD%29+v6.5.948+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9efb64d7fb96ca16c5c8b74058f08f4247208ab","infoHashBuffer":{"type":"Buffer","data":[249,239,182,77,127,185,108,161,108,92,139,116,5,143,8,244,36,114,8,171]},"announce":[],"urlList":[]}}