{"title":"7 Dirty Words - The Life and Crimes of George Carlin [128] Unab ","uid":7596008,"size":596594707,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fa7802d90704e978ec377b9c50cb9d645140e16f&amp;dn=7+Dirty+Words+-+The+Life+and+Crimes+of+George+Carlin+%5B128%5D+Unab+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":-1,"time":1346696470,"description":"James Sullivan - Seven Dirty Words: The Life and Crimes of George Carlin\n\nUnabridged; Read by Alan Sklar [128 kbps]\n\nOverview\nJournalist and cultural critic James Sullivan tells the story of Alternative America from the 1950s to the present in this definitive biography of the Catholic boy for whom nothing was sacred: George Carlin. Seven Dirty Words is a hilarious and insightful read, documenting the life and art of the legendary comic, provocateur, and social critic who fearlessly questioned the American way of life through the words we use.\n\nKirkus Reviews\nStraightforward biography of George Carlin (1937-2008), who survived countercultural excess to become a seminal American stand-up comedian. Boston Globe contributor Sullivan (The Hardest Working Man: How James Brown Saved the Soul of America, 2008, etc.) portrays Carlin as a singular cultural figure, connecting the 1950s' &quot;Silent Generation&quot; to '60s hippies, '70s stoners and '90s slackers, through a unique combination of shrewdness and provocation. &quot;George Carlin was a natural born transgressor,&quot; he writes. The author meticulously chronicles Carlin's career, which intersected with many formative cultural trends of the '50s and '60s. He began as a regional radio DJ, moved into mainstream comedy while observing the &quot;sick&quot; club scene epitomized by Mort Sahl and Lenny Bruce, toured extensively and became an early favorite on television, particularly late-night shows. Sullivan ably captures a sense of the entertainment industry at the time-glamorously competitive and fiercely insular. After years honing his comic chops and caricatures like the &quot;Hippie-Dippy Weatherman,&quot; Carlin aligned himself with the &quot;freaks&quot; at the right moment, becoming a hugely popular campus comedian and releasing Grammy-winning LPs. This culminated in his notorious 1972 Milwaukee arrest that eventually landed him before the Supreme Court on charges of obscenity. Sullivan argues that the incident has informed our (often incoherent) national conversation about free speech and obscenity ever since. The author also dutifully covers Carlin's personal life. Not surprisingly, he used drugs for a time, but by his own account weaned himself off them by the '90s. Alcohol, however, proved a harder addiction. Less well-known is hisfrequent personal generosity toward other comedians and his steady romance with Brenda, his wife of 36 years, who died after a brutal bout with liver cancer. Sullivan isn't able to fully penetrate Carlin's inner life, resulting in a fairly standard showbiz praise narrative. Still, this is an apt, detailed memorial to a groundbreaking performer.\n\nTable of Contents\n   Warm-up 1\n01 Heavy Mysteries 7\n02 Class Clown 25\n03 Attracting Attention 51\n04 Values (How Much is That Dog Crap in the Window?) 75\n05 The Confessional 97\n06 Special Dispensation 121\n07 Seven Words you Can Never Say on Television 143\n08 Wasted Time 167\n09 America the Beautiful 189\n10 Squeamish 205","torrent":{"xt":"urn:btih:fa7802d90704e978ec377b9c50cb9d645140e16f","amp;dn":"7+Dirty+Words+-+The+Life+and+Crimes+of+George+Carlin+%5B128%5D+Unab+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa7802d90704e978ec377b9c50cb9d645140e16f","infoHashBuffer":{"type":"Buffer","data":[250,120,2,217,7,4,233,120,236,55,123,156,80,203,157,100,81,64,225,111]},"announce":[],"urlList":[]}}