{"title":"The Fate of American Colleges and Universities.zip","uid":7541403,"size":4210852,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fbe7d911a7993f366cb97a47e6a87c7b4c1f3dc9&amp;dn=The+Fate+of+American+Colleges+and+Universities.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cowboy1966","files":-1,"time":1345226577,"description":"The Fate of American Colleges and Universities\n\nRichard A. DeMillo - Abelard to Apple: \n\n\nPublished: 2011-08-26 | ISBN: 0262015803 | PDF | 344 pages | 4 MB\n\n\nThe vast majority of American college students attend two thousand or so private and public institutions that might be described as the Middle--reputable educational institutions, but not considered equal to the elite and entrenched upper echelon of the Ivy League and other prestigious schools. Richard DeMillo has a warning for these colleges and universities in the Middle: If you do not change, you are heading for irrelevance and marginalization. In Abelard to Apple, DeMillo argues that these institutions, clinging precariously to a centuries-old model of higher education, are ignoring the social, historical, and economic forces at work in today's world. In the age of iTunes, open source software, and for-profit online universities, there are new rules for higher education. DeMillo, who has spent years in both academia andin industry, explains how higher education arrived at its current parlous state and offers a road map for the twenty-first century. He describes the evolving model for higher education, from European universities based on a medieval model to American land-grant colleges to Apple's iTunes U and MIT's OpenCourseWare. He offers ten rules to help colleges reinvent themselves (including &quot;Don't romanticize your weaknesses&quot;) and argues for a focus on teaching undergraduates. DeMillo's message--for colleges and universities, students, alumni, parents, employers, and politicians--is that any college or university can change course if it defines a compelling value proposition (one not based in &quot;institutional envy&quot; of Harvard and Berkeley) and imagines an institution that delivers it.\n\n","torrent":{"xt":"urn:btih:fbe7d911a7993f366cb97a47e6a87c7b4c1f3dc9","amp;dn":"The+Fate+of+American+Colleges+and+Universities.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbe7d911a7993f366cb97a47e6a87c7b4c1f3dc9","infoHashBuffer":{"type":"Buffer","data":[251,231,217,17,167,153,63,54,108,185,122,71,230,168,124,123,76,31,61,201]},"announce":[],"urlList":[]}}