{"title":"The Amazing Spiderman 2012 HDCAM.Complete - GLOBE","uid":7435879,"size":1477949713,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fde283b34a06db20f176d8afec3e92cd071b03be&amp;dn=The+Amazing+Spiderman+2012+HDCAM.Complete+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1342080876,"description":"* XVID CAM  * 02H01M00S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n\n* FILE INFO :  COMPLETE WITH THE CENE AFTER THE CREDITS\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Plot :\n \nA young Peter Parker discovers his father's study has been broken into. His father, Richard, gathers up hidden documents, and Peter's parents take him to the home of his Aunt May and Uncle Ben, then mysteriously depart. Years later, a teenage Peter attends Midtown Science High School, where he is bullied by Flash Thompson and has caught the eye of Gwen Stacy. At home, Peter finds Richard's papers, and learns his father worked with fellow scientist Dr. Curt Connors at OsCorp. Faking his way into OsCorp as one of a group of high-school interns, Peter sneaks into a lab where a &quot;biocable&quot; is being created from genetically modified spiders, one of which bites him. On the subway ride home, he is shocked to find strange spider-like abilities manifesting.\n \nAfter studying Richard's papers, he visits the one-armed Connors at home, reveals he is Richard Parker's son, and gives Connors his father's &quot;decay rate algorithm&quot;, the missing piece in Connors' experiments on regenerating limbs based on lizard DNA. Connors is being pressured by his superior, Dr. Ratha, to devise a cure for the dying, unseen head of OsCorp, Norman Osborn.\n \nIn school, attempting revenge on Flash, Peter gets in trouble, forcing Uncle Ben to change work shifts in order to meet with the principal; he tells Peter to pick up May tonight for him. Peter later goes to OsCorp and helps Connors regenerate a limb on a laboratory mouse, while ignoring a call from Ben. When Peter returns home, Ben scolds him for having neglected to pick up May. Peter storms off, and Ben goes out to search for him. Peter visits a convenience store, and while arguing with the clerk, a man steals from the till and dashes out. Peter refuses to give chase. The thief runs into Ben, who confronts him. They wrestle over a gun, and Ben is shot. The killer escapes as Peter finds his uncle, who dies in his arms.\n\n\n\nUPLOADER DISCLAIMER : \n\nsorry for my first torrent for this movie with only 1h44m but was the only cam that i get at that moment in time , now i get the CAMHD with about 30% of black borders in fullscreen view making the picture look like a small widescreen to any portable computer , that was corrected ans the colours improved , the last cene after the credits was addicionated to the main movie making this movie file version complete .\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012\n","torrent":{"xt":"urn:btih:fde283b34a06db20f176d8afec3e92cd071b03be","amp;dn":"The+Amazing+Spiderman+2012+HDCAM.Complete+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fde283b34a06db20f176d8afec3e92cd071b03be","infoHashBuffer":{"type":"Buffer","data":[253,226,131,179,74,6,219,32,241,118,216,175,236,62,146,205,7,27,3,190]},"announce":[],"urlList":[]}}