{"title":"NewSoftwares USB Block 1.5.1 + keys by Senzati.rar","uid":7539874,"size":6379420,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fe0e54fc84e2b0059fbbda8dde7ce48adf6a02af&amp;dn=NewSoftwares+USB+Block+1.5.1+%2B+keys+by+Senzati.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BySenzati","files":1,"time":1345188065,"description":"Overview\n\nDo you have important documents, financial reports, source codes or private files you don't want to get duplicated or stolen ever? Your PC is the perfect machine to let that happen easily, with so many open ports, USB drive slots, CD/DVD Writers, Memory Card slots and Network Access.\n\n USB Block is a two-in-one data leak prevention &amp; copy protection software that lets you prevent copying of sensitive information to any unauthorized portable device including USB drives, external hard drives, memory cards, digital cameras, iPods, CDs/DVDs, Network Computers and more. It is a permission based software, and once installed, only users with the correct password will be able to have access to the USB drives or external drives. You can maintain a list of all your drives that you need access to on a regular basis, while blocking all other USB and external drives that you have set the protection parameters for. USB Block also monitors and keeps a record of what devices have tried to access your PC by whom and when. Prevent data-leak, illegal copying, and duplication of your private and classified data and information. Additionally, the program also monitors and keeps a log of illegal program deletion attempts, unauthorized uninstall attempts as well as invalid password attempts. Furthermore, USB Block also protects your computers against malware attacks and malicious hacks by not allowing any USB drive or external drive, or any network computers and non-system drives to access your computer.","torrent":{"xt":"urn:btih:fe0e54fc84e2b0059fbbda8dde7ce48adf6a02af","amp;dn":"NewSoftwares+USB+Block+1.5.1+%2B+keys+by+Senzati.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe0e54fc84e2b0059fbbda8dde7ce48adf6a02af","infoHashBuffer":{"type":"Buffer","data":[254,14,84,252,132,226,176,5,159,187,218,141,222,124,228,138,223,106,2,175]},"announce":[],"urlList":[]}}