{"title":"Gin Blossoms Toronto Concert Hall  May 6, 1996 FM","uid":7468719,"size":78130403,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fe712fef13f673aca66c38b99576f62bca2e011f&amp;dn=Gin+Blossoms+Toronto+Concert+Hall++May+6%2C+1996+FM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":31,"time":1343080209,"description":"mp3 192\nfm broadcast\nexcellent quality\n\nBill Leen - bass\nJesse Valenzuela - guitar, vocals\nPhillip Rhodes - drums\nScott Johnson - guitar\nRobin Wilson - vocals, guitar\n\nThough word from the Gin Blossoms front was pretty quiet from 1997-2002 when they took an extended hiatus, in the mid-'90s you couldn't go anywhere without hearing their ubiquitous jangle rock hits. This show from Toronto finds the Arizona desert rats at the top of their form or as frontman Robin Wilson says, &quot;Well, honestly, this is just about as good as we ever sound,&quot; as they celebrate a Canadian number one hit.\n\n&quot;Follow You Down&quot; is the song that reached the top of the charts that spring, pulled from the band's then current album, Congratulations I'm Sorry, scheduled to go platinum that year. Most of the songs performed here are taken from that sophomore album with the bittersweet title (based on sentiments expressed to the band while its songs climbed the charts following the demise their writer). As you may remember, founding Gin Blossom and former band member Doug Hopkins took his own life, while the band was experiencing massive success with hits that he'd penned for New Miserable Experience, the band's 1992 debut. The conflation of events was disconcerting to say the least, but the season passed and the band clicked yet again, scoring a Top 10 in 1995 with &quot;Til I Hear It From You&quot; (included on the soundtrack to Empire Records). They followed that success with Congratulations and further hits, like the aforementioned &quot;Follow You Down,&quot; the gentle and sweetly melodic &quot;As Long As It Matters,&quot; and the frenzied, modern rock track, &quot;Day Job,&quot; all of them performed live here. &quot;Found Out About You&quot; elicits female screaming from the crowd, as does the mere mention of &quot;Hey Jealousy,&quot;--both hits for the band in their earliest incarnation and recorded with a different lineup--house rockers that shine through waves of chiming guitars.\n\nPart of the Gin Blossoms success was not only their accessible sound, but an amiable frontman in Robin Wilson. He quips that Scott Johnson is &quot;the best Swedish guitar player in all of Arizona,&quot; and that just may well be part of their success formula too, as Johnson reels off licks in the style of the Byrds/Buffalo Springfield and R.E.M.'s Peter Buck. Though perhaps not the most prolific recording artists (five albums released in a span of over 20 years, but hey, who's counting?), what the Gin Blossoms also had working in their favor was a bright hook-filled sound that rarely missed the bullseye in their mid-'90s, radio-friendly, halcyon days. Though surely their experience shows that success doesn't last forever, the good news is that the GBs have come back around: In 2006 they reemerged. An album in 2010, No Chocolate Cake and a road show taken to the troops in Iraq brings their story up-to-date. And, of course, the surfacing of this show--another in a series of the revelations proving what the fans knew all along: The Gin Blossoms are a hearty strain, long lasting perennials that no passing of the decades, changing trends, or even foul weather can knock down.","torrent":{"xt":"urn:btih:fe712fef13f673aca66c38b99576f62bca2e011f","amp;dn":"Gin+Blossoms+Toronto+Concert+Hall++May+6%2C+1996+FM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe712fef13f673aca66c38b99576f62bca2e011f","infoHashBuffer":{"type":"Buffer","data":[254,113,47,239,19,246,115,172,166,108,56,185,149,118,246,43,202,46,1,31]},"announce":[],"urlList":[]}}