{"title":"Solar and Space Physics {BBS}","uid":7558340,"size":43332708,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe72b2375588e747b004f3a679fe95d3747c8d14&amp;dn=Solar+and+Space+Physics+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1345677488,"description":"From the interior of the Sun, to the upper atmosphere and near-space environment of Earth, and outward to a region far beyond Pluto where the Sun's influence wanes, advances during the past decade in space physics and solar physics--the disciplines NASA refers to as heliophysics--have yielded spectacular insights into the phenomena that affect our home in space.\n\nSolar and Space Physics, from the National Research Council's (NRC's) Committee for a Decadal Strategy in Solar and Space Physics, is the second NRC decadal survey in heliophysics. Building on the research accomplishments realized during the past decade, the report presents a program of basic and applied research for the period 2013-2022 that will improve scientific understanding of the mechanisms that drive the Sun's activity and the fundamental physical processes underlying near-Earth plasma dynamics, determine the physical interactions of Earth's atmospheric layers in the context of the connected Sun-Earth system, and enhance greatly the capability to provide realistic and specific forecasts of Earth's space environment that will better serve the needs of society.\n\nAlthough the recommended program is directed primarily at NASA and the National Science Foundation for action, the report also recommends actions by other federal agencies, especially the parts of the National Oceanic and Atmospheric Administration charged with the day-to-day (operational) forecast of space weather. In addition to the recommendations included in this summary, related recommendations are presented in this report.\n\n\n# Paperback: 454 pages\n# Publisher: National Academies Press (December 31, 2012)\n# ISBN-10: 0309164281\n# ISBN-13: 978-0309164283","torrent":{"xt":"urn:btih:fe72b2375588e747b004f3a679fe95d3747c8d14","amp;dn":"Solar+and+Space+Physics+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe72b2375588e747b004f3a679fe95d3747c8d14","infoHashBuffer":{"type":"Buffer","data":[254,114,178,55,85,136,231,71,176,4,243,166,121,254,149,211,116,124,141,20]},"announce":[],"urlList":[]}}