{"title":"Chagaanti Koteshwar Rao - Sri Krishna Karnamrutam - by Srinu","uid":7440856,"size":1672455794,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fe7c0228c804199d12efcf6f59eb208e8847465a&amp;dn=Chagaanti+Koteshwar+Rao+-+Sri+Krishna+Karnamrutam+-+by+Srinu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"srinu2332","files":5,"time":1342214356,"description":"Brahmasri Chaganti Koteswara Rao an eminent pravachana chakravarthi, born to punya dampathulu late sri Chaganti Sundara Siva Rao garu and late smt Suseelamma. He married Smt.Subramanyeswary and blessed with two children Shanmukhacharan and chy. Sow Nagasrivalli and both have done their engineering . Presently he is working in Food Corporation of India, Kakinada. A silent reader of puranams and blessed with Saraswathi kataksham and started giving pravachanams on puranams extempore and proven his spectacular command on spiritual pravachanams on various purnanams and mythologies like Srimad Ramayanam, Srimad Bhagavatham Soundaryalahari, Lalithasahasranama strotram etc.,\n\nBrahmasri Koteswara Rao garu has delivered discourses for 42 days continuously at Kakinada on sampoorna ramayanam during 2005, Sreemad Bhagavatham for 42 days during 2006, Sivamahapuranam for 30 days during 2007 and Sree Lalitha Sahasranama Stothram for about 45 days during 2008 . In addition he gave numerous pravachanams on various topics throughout the country.\n\nHe mesmerizes the audience with well refined reciting and thought provoking citations from various puranams extempore.\n\nBrahmasri Koteswara Rao is a gifted personality with sarada kataksham who ensures of great spiritual anandam to all the audience.\n\nHe has been felicitated with citations like &quot;UPANYASA CHAKRAVARTHI&quot;, &quot;SARADA JNANA PUTRA&quot;...etc\n\nA group of his admirers started this web site to enable his valuable lectures to reach all the enthusiasists who like to know about our culture and tradition and all can freely make use of this site and we are grateful to them for a line of their response.","torrent":{"xt":"urn:btih:fe7c0228c804199d12efcf6f59eb208e8847465a","amp;dn":"Chagaanti+Koteshwar+Rao+-+Sri+Krishna+Karnamrutam+-+by+Srinu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe7c0228c804199d12efcf6f59eb208e8847465a","infoHashBuffer":{"type":"Buffer","data":[254,124,2,40,200,4,25,157,18,239,207,111,89,235,32,142,136,71,70,90]},"announce":[],"urlList":[]}}